// 修改此处可永久修改工具的数据，请谨慎修改
const rareList = [
  {
    "name": "莉格露",
    "money": [
      "200",
      "400"
    ],
    "favList": [
      "肉",
      "甜",
      "生",
      "猎奇"
    ],
    "dissList": [
      "素",
      "清淡",
      "凉爽"
    ],
    "drinkList": [
      "低酒精",
      "可加冰"
    ],
    "distanceList": [
      "妖怪兽道",
      "魔法森林"
    ],
    "type": "rare"
  },
  {
    "name": "露米娅",
    "money": [
      "150",
      "350"
    ],
    "favList": [
      "招牌",
      "肉",
      "饱腹",
      "生",
      "猎奇",
      "流行·喜爱"
    ],
    "dissList": [
      "昂贵",
      "下酒",
      "流行·厌恶"
    ],
    "drinkList": [
      "气泡",
      "苦"
    ],
    "distanceList": [
      "妖怪兽道",
      "魔法森林"
    ],
    "type": "rare"
  },
  {
    "name": "橙",
    "money": [
      "400",
      "600"
    ],
    "favList": [
      "肉",
      "水产",
      "重油",
      "甜",
      "烧烤",
      "流行·喜爱"
    ],
    "dissList": [
      "素",
      "猎奇",
      "灼热",
      "流行·厌恶"
    ],
    "drinkList": [
      "水果",
      "辛"
    ],
    "distanceList": [
      "妖怪兽道"
    ],
    "type": "rare"
  },
  {
    "name": "稗田阿求",
    "money": [
      "500",
      "800"
    ],
    "favList": [
      "清淡",
      "高级",
      "甜",
      "文化底蕴",
      "汤羹",
      "和风",
      "流行·喜爱"
    ],
    "dissList": [
      "重油",
      "咸",
      "灼热",
      "流行·厌恶"
    ],
    "drinkList": [
      "可加热",
      "清酒"
    ],
    "distanceList": [
      "人间之里"
    ],
    "type": "rare"
  },
  {
    "name": "上白泽慧音",
    "money": [
      "400",
      "800"
    ],
    "favList": [
      "家常",
      "素",
      "清淡",
      "文化底蕴",
      "和风",
      "中华",
      "流行·喜爱"
    ],
    "dissList": [
      "重油",
      "大份",
      "咸",
      "流行·厌恶"
    ],
    "drinkList": [
      "清酒",
      "烧酒",
      "利口酒"
    ],
    "distanceList": [
      "人间之里",
      "魔法森林"
    ],
    "type": "rare"
  },
  {
    "name": "茨木华扇",
    "money": [
      "400",
      "600"
    ],
    "favList": [
      "家常",
      "下酒",
      "文化底蕴",
      "和风"
    ],
    "dissList": [
      "实惠",
      "辣",
      "生"
    ],
    "drinkList": [
      "中酒精",
      "古典",
      "直饮"
    ],
    "distanceList": [
      "人间之里",
      "旧地狱"
    ],
    "type": "rare"
  },
  {
    "name": "博丽灵梦",
    "money": [
      "150",
      "300"
    ],
    "favList": [
      "实惠",
      "饱腹",
      "高级",
      "甜",
      "不可思议",
      "流行·喜爱"
    ],
    "dissList": [
      "昂贵",
      "下酒",
      "流行·厌恶"
    ],
    "drinkList": [
      "无酒精",
      "低酒精",
      "可加热"
    ],
    "distanceList": [
      "博丽神社",
      "妖怪兽道",
      "人间之里",
      "魔法森林",
      "妖怪之山"
    ],
    "type": "rare"
  },
  {
    "name": "伊吹萃香",
    "money": [
      "600",
      "800"
    ],
    "favList": [
      "肉",
      "下酒",
      "小巧",
      "力量涌现",
      "和风",
      "流行·喜爱"
    ],
    "dissList": [
      "重油",
      "流行·厌恶"
    ],
    "drinkList": [
      "高酒精",
      "直饮"
    ],
    "distanceList": [
      "博丽神社",
      "妖怪之山"
    ],
    "type": "rare"
  },
  {
    "name": "比那名居天子",
    "money": [
      "2000",
      "3000"
    ],
    "favList": [
      "昂贵",
      "素",
      "清淡",
      "传说",
      "甜",
      "果味",
      "适合拍照",
      "流行·厌恶"
    ],
    "dissList": [
      "家常",
      "肉",
      "重油",
      "流行·喜爱"
    ],
    "drinkList": [
      "高酒精",
      "鸡尾酒"
    ],
    "distanceList": [
      "博丽神社",
      "妖怪之山",
      "旧地狱"
    ],
    "type": "rare"
  },
  {
    "name": "红美铃",
    "money": [
      "200",
      "400"
    ],
    "favList": [
      "肉",
      "饱腹",
      "力量涌现",
      "中华",
      "流行·喜爱"
    ],
    "dissList": [
      "果味",
      "猎奇",
      "西式",
      "流行·厌恶"
    ],
    "drinkList": [
      "可加热",
      "古典",
      "提神"
    ],
    "distanceList": [
      "红魔馆"
    ],
    "type": "rare"
  },
  {
    "name": "琪露诺",
    "money": [
      "100",
      "200"
    ],
    "favList": [
      "甜",
      "凉爽",
      "猎奇",
      "适合拍照",
      "流行·厌恶"
    ],
    "dissList": [
      "昂贵",
      "下酒",
      "文化底蕴",
      "流行·喜爱"
    ],
    "drinkList": [
      "可加冰",
      "水果",
      "甘"
    ],
    "distanceList": [
      "红魔馆",
      "妖怪之山"
    ],
    "type": "rare"
  },
  {
    "name": "帕秋莉",
    "money": [
      "600",
      "1000"
    ],
    "favList": [
      "高级",
      "甜",
      "梦幻",
      "适合拍照",
      "西式"
    ],
    "dissList": [
      "咸",
      "生",
      "猎奇",
      "灼热"
    ],
    "drinkList": [
      "利口酒",
      "鸡尾酒",
      "气泡"
    ],
    "distanceList": [
      "红魔馆",
      "魔法森林",
      "地灵殿"
    ],
    "type": "rare"
  },
  {
    "name": "藤原妹红",
    "money": [
      "300",
      "600"
    ],
    "favList": [
      "辣",
      "果味",
      "灼热",
      "燃起来了"
    ],
    "dissList": [
      "昂贵",
      "高级",
      "不可思议"
    ],
    "drinkList": [
      "烧酒",
      "苦",
      "辛"
    ],
    "distanceList": [
      "迷途竹林",
      "妖怪兽道"
    ],
    "type": "rare"
  },
  {
    "name": "蓬莱山辉夜",
    "money": [
      "1000",
      "1500"
    ],
    "favList": [
      "传说",
      "不可思议",
      "文化底蕴",
      "和风",
      "流行·喜爱"
    ],
    "dissList": [
      "招牌",
      "大份",
      "猎奇",
      "流行·厌恶"
    ],
    "drinkList": [
      "清酒",
      "古典",
      "现代"
    ],
    "distanceList": [
      "迷途竹林"
    ],
    "type": "rare"
  },
  {
    "name": "因幡帝",
    "money": [
      "200",
      "400"
    ],
    "favList": [
      "小巧",
      "传说",
      "甜",
      "凉爽",
      "梦幻",
      "流行·喜爱"
    ],
    "dissList": [
      "重油",
      "山珍",
      "猎奇",
      "流行·厌恶"
    ],
    "drinkList": [
      "无酒精",
      "水果",
      "甘"
    ],
    "distanceList": [
      "迷途竹林",
      "博丽神社",
      "红魔馆",
      "迷途竹林",
      "魔法森林",
      "妖怪之山"
    ],
    "type": "rare"
  },
  {
    "name": "河城荷取",
    "money": [
      "400",
      "500"
    ],
    "favList": [
      "招牌",
      "水产",
      "下酒",
      "高级",
      "咸",
      "猎奇"
    ],
    "dissList": [
      "素",
      "山珍",
      "文化底蕴"
    ],
    "drinkList": [
      "中酒精",
      "高酒精",
      "清酒",
      "直饮"
    ],
    "distanceList": [
      "妖怪之山"
    ],
    "type": "rare"
  },
  {
    "name": "犬走椛",
    "money": [
      "300",
      "400"
    ],
    "favList": [
      "肉",
      "下酒",
      "重油",
      "大份",
      "山珍"
    ],
    "dissList": [
      "素",
      "清淡",
      "猎奇"
    ],
    "drinkList": [
      "中酒精",
      "高酒精",
      "直饮"
    ],
    "distanceList": [
      "妖怪之山"
    ],
    "type": "rare"
  },
  {
    "name": "东风谷早苗",
    "money": [
      "400",
      "600"
    ],
    "favList": [
      "家常",
      "甜",
      "梦幻",
      "适合拍照",
      "和风",
      "流行·喜爱"
    ],
    "dissList": [
      "重油",
      "生",
      "猎奇",
      "灼热",
      "流行·厌恶"
    ],
    "drinkList": [
      "无酒精",
      "低酒精",
      "清酒",
      "现代",
      "气泡",
      "水果",
      "直饮",
      "甘",
      "苦"
    ],
    "distanceList": [
      "妖怪之山",
      "魔法森林"
    ],
    "type": "rare"
  },
  {
    "name": "爱丽丝",
    "money": [
      "500",
      "800"
    ],
    "favList": [
      "家常",
      "高级",
      "甜",
      "文化底蕴",
      "西式"
    ],
    "dissList": [
      "肉",
      "饱腹",
      "重油",
      "猎奇"
    ],
    "drinkList": [
      "低酒精",
      "西洋酒",
      "现代"
    ],
    "distanceList": [
      "魔法森林"
    ],
    "type": "rare"
  },
  {
    "name": "雾雨魔理沙",
    "money": [
      "3000",
      "5000"
    ],
    "favList": [
      "重油",
      "传说",
      "灼热",
      "菌类",
      "和风",
      "流行·喜爱"
    ],
    "dissList": [
      "猎奇",
      "流行·厌恶"
    ],
    "drinkList": [
      "低酒精",
      "可加冰"
    ],
    "distanceList": [
      "魔法森林",
      "妖怪兽道",
      "人间之里",
      "博丽神社",
      "红魔馆",
      "迷途竹林",
      "妖怪之山",
      "旧地狱",
      "地灵殿"
    ],
    "type": "rare"
  },
  {
    "name": "矢田寺成美",
    "money": [
      "300",
      "600"
    ],
    "favList": [
      "清淡",
      "山珍",
      "文化底蕴",
      "特产",
      "和风"
    ],
    "dissList": [
      "饱腹",
      "重油"
    ],
    "drinkList": [
      "低酒精",
      "中酒精",
      "可加冰",
      "古典",
      "直饮"
    ],
    "distanceList": [
      "魔法森林"
    ],
    "type": "rare"
  },
  {
    "name": "黑谷山女",
    "money": [
      "250",
      "400"
    ],
    "favList": [
      "甜",
      "鲜",
      "生",
      "猎奇",
      "适合拍照",
      "流行·喜爱"
    ],
    "dissList": [
      "重油",
      "咸",
      "灼热",
      "流行·厌恶"
    ],
    "drinkList": [
      "低酒精",
      "中酒精",
      "啤酒",
      "甘"
    ],
    "distanceList": [
      "旧地狱",
      "妖怪兽道",
      "红魔馆",
      "魔法森林",
      "妖怪之山"
    ],
    "type": "rare"
  },
  {
    "name": "水桥帕露西",
    "money": [
      "300",
      "400"
    ],
    "favList": [
      "肉",
      "酸",
      "辣",
      "咸",
      "鲜",
      "果味",
      "流行·厌恶"
    ],
    "dissList": [
      "甜",
      "流行·喜爱"
    ],
    "drinkList": [
      "无酒精",
      "可加热",
      "直饮",
      "苦",
      "辛"
    ],
    "distanceList": [
      "旧地狱"
    ],
    "type": "rare"
  },
  {
    "name": "星熊勇仪",
    "money": [
      "600",
      "1000"
    ],
    "favList": [
      "招牌",
      "下酒",
      "大份",
      "传说",
      "力量涌现",
      "燃起来了",
      "和风",
      "流行·喜爱"
    ],
    "dissList": [
      "素",
      "小巧",
      "猎奇",
      "流行·厌恶"
    ],
    "drinkList": [
      "高酒精",
      "啤酒",
      "清酒",
      "古典"
    ],
    "distanceList": [
      "旧地狱",
      "博丽神社",
      "妖怪之山",
      "地灵殿"
    ],
    "type": "rare"
  },
  {
    "name": "古明地觉",
    "money": [
      "500",
      "600"
    ],
    "favList": [
      "家常",
      "小巧",
      "甜",
      "梦幻",
      "力量涌现",
      "特产"
    ],
    "dissList": [
      "肉",
      "大份",
      "山珍",
      "猎奇",
      "灼热"
    ],
    "drinkList": [
      "无酒精",
      "气泡",
      "提神",
      "苦"
    ],
    "distanceList": [
      "地灵殿",
      "人间之里",
      "博丽神社",
      "红魔馆",
      "迷途竹林",
      "魔法森林"
    ],
    "type": "rare"
  },
  {
    "name": "火焰猫燐",
    "money": [
      "500",
      "700"
    ],
    "favList": [
      "水产",
      "甜",
      "鲜",
      "海味",
      "梦幻",
      "猎奇",
      "流行·喜爱"
    ],
    "dissList": [
      "生",
      "灼热",
      "流行·厌恶"
    ],
    "drinkList": [
      "低酒精",
      "清酒",
      "水果"
    ],
    "distanceList": [
      "地灵殿",
      "人间之里",
      "博丽神社",
      "妖怪之山",
      "旧地狱"
    ],
    "type": "rare"
  },
  {
    "name": "灵乌路空",
    "money": [
      "500",
      "800"
    ],
    "favList": [
      "肉",
      "重油",
      "辣",
      "咸",
      "灼热",
      "力量涌现"
    ],
    "dissList": [
      "清淡",
      "菌类"
    ],
    "drinkList": [
      "中酒精",
      "可加热",
      "鸡尾酒"
    ],
    "distanceList": [
      "地灵殿",
      "妖怪之山"
    ],
    "type": "rare"
  },
  {
    "name": "萌澄果",
    "money": [
      "1200",
      "1600"
    ],
    "favList": [
      "肉",
      "水产",
      "甜",
      "梦幻",
      "流行·喜爱"
    ],
    "dissList": [
      "猎奇",
      "灼热",
      "流行·厌恶"
    ],
    "drinkList": [
      "可加冰",
      "水果",
      "甘",
      "辛"
    ],
    "distanceList": [
      "妖怪兽道",
      "人间之里",
      "博丽神社",
      "红魔馆",
      "迷途竹林",
      "魔法森林",
      "妖怪之山"
    ],
    "type": "rare"
  },
  {
    "name": "蹦蹦跳跳的三妖精",
    "money": [
      "300",
      "400"
    ],
    "favList": [
      "家常",
      "小巧",
      "甜",
      "凉爽",
      "梦幻",
      "菌类",
      "流行·喜爱"
    ],
    "dissList": [
      "生",
      "猎奇",
      "灼热",
      "流行·厌恶"
    ],
    "drinkList": [
      "无酒精",
      "水果",
      "甘",
      "苦"
    ],
    "distanceList": [
      "妖怪兽道",
      "人间之里",
      "博丽神社",
      "红魔馆",
      "迷途竹林",
      "妖怪之山"
    ],
    "type": "rare"
  },
  {
    "name": "冴月麟",
    "money": [
      "400",
      "600"
    ],
    "favList": [
      "家常",
      "水产",
      "辣",
      "中华",
      "流行·喜爱"
    ],
    "dissList": [
      "下酒",
      "重油",
      "生",
      "流行·厌恶"
    ],
    "drinkList": [
      "无酒精",
      "气泡",
      "甘"
    ],
    "distanceList": [
      "妖怪兽道",
      "人间之里",
      "博丽神社",
      "红魔馆",
      "迷途竹林"
    ],
    "type": "rare"
  },
  {
    "name": "森近霖之助",
    "money": [
      "250",
      "400"
    ],
    "favList": [
      "家常",
      "饱腹",
      "鲜",
      "流行·喜爱"
    ],
    "dissList": [
      "下酒",
      "重油",
      "猎奇",
      "流行·厌恶"
    ],
    "drinkList": [
      "啤酒",
      "烧酒"
    ],
    "distanceList": [
      "人间之里"
    ],
    "type": "rare"
  },
  {
    "name": "立空汐",
    "money": [
      "500",
      "800"
    ],
    "favList": [
      "昂贵",
      "肉",
      "下酒",
      "山珍",
      "力量涌现",
      "和风",
      "流行·厌恶"
    ],
    "dissList": [
      "素",
      "清淡",
      "流行·喜爱"
    ],
    "drinkList": [
      "高酒精",
      "可加冰",
      "可加热"
    ],
    "distanceList": [
      "妖怪兽道",
      "博丽神社",
      "红魔馆",
      "迷途竹林",
      "妖怪之山"
    ],
    "type": "rare"
  },
  {
    "name": "时焉侑",
    "money": [
      "1300",
      "1800"
    ],
    "favList": [
      "下酒",
      "传说",
      "文化底蕴",
      "特产",
      "西式",
      "中华"
    ],
    "dissList": [
      "水产",
      "饱腹",
      "重油"
    ],
    "drinkList": [
      "中酒精",
      "可加冰",
      "西洋酒",
      "鸡尾酒"
    ],
    "distanceList": [
      "人间之里",
      "博丽神社"
    ],
    "type": "rare"
  },
  {
    "name": "蕾米莉亚",
    "money": [],
    "favList": [
      "高级",
      "甜",
      "生",
      "西式"
    ],
    "dissList": [],
    "drinkList": [
      "西洋酒",
      "古典",
      "水果",
      "甘"
    ],
    "distanceList": [
      "红魔馆"
    ],
    "type": "rare"
  },
  {
    "name": "魂魄妖梦",
    "money": [
      "300",
      "400"
    ],
    "favList": [
      "家常",
      "清淡",
      "鲜",
      "力量涌现"
    ],
    "dissList": [
      "重油",
      "猎奇"
    ],
    "drinkList": [
      "无酒精",
      "可加热",
      "水果"
    ],
    "distanceList": [
      "妖怪兽道",
      "人间之里",
      "博丽神社",
      "迷途竹林"
    ],
    "type": "rare"
  },
  {
    "name": "饕餮尤魔",
    "money": [
      "9999",
      "9999"
    ],
    "favList": [
      "肉",
      "饱腹",
      "大份",
      "高级",
      "传说",
      "鲜",
      "生",
      "不可思议",
      "力量涌现"
    ],
    "dissList": [],
    "drinkList": [
      "高酒精",
      "烧酒",
      "直饮",
      "辛"
    ],
    "distanceList": [
      "妖怪之山",
      "妖怪兽道",
      "博丽神社",
      "红魔馆",
      "迷途竹林",
      "魔法森林",
      "旧地狱",
      "地灵殿"
    ],
    "type": "rare"
  },
  {
    "name": "西行寺幽幽子",
    "money": [
      "1300",
      "1800"
    ],
    "favList": [
      "肉",
      "水产",
      "饱腹",
      "大份",
      "高级",
      "传说",
      "和风",
      "中华"
    ],
    "dissList": [
      "素",
      "清淡",
      "小巧"
    ],
    "drinkList": [
      "高酒精",
      "可加冰",
      "鸡尾酒"
    ],
    "distanceList": [
      "博丽神社",
      "红魔馆",
      "迷途竹林"
    ],
    "type": "rare"
  },
  {
    "name": "古明地恋",
    "money": [
      "800",
      "1200"
    ],
    "favList": [
      "甜",
      "咸",
      "生",
      "梦幻",
      "猎奇",
      "不可思议",
      "流行·厌恶"
    ],
    "dissList": [],
    "drinkList": [
      "高酒精",
      "烧酒",
      "气泡",
      "苦"
    ],
    "distanceList": [
      "地灵殿",
      "妖怪兽道",
      "人间之里",
      "博丽神社",
      "红魔馆",
      "迷途竹林",
      "魔法森林",
      "妖怪之山",
      "旧地狱"
    ],
    "type": "rare"
  }
] 
const normalList = [
  {
    "name": "妖怪兔",
    "favList": [
      "招牌",
      "家常",
      "甜",
      "咸",
      "鲜",
      "果味",
      "凉爽",
      "力量涌现",
      "流行·喜爱"
    ],
    "drinkList": [
      "无酒精"
    ],
    "distanceList": [
      "妖怪兽道",
      "红魔馆",
      "迷途竹林",
      "魔法森林",
      "妖怪之山",
      "地灵殿"
    ],
    "type": "normal"
  },
  {
    "name": "妖怪猫",
    "favList": [
      "招牌",
      "肉",
      "海味",
      "凉爽",
      "中华",
      "流行·喜爱"
    ],
    "drinkList": [
      "可加冰",
      "啤酒",
      "苦"
    ],
    "distanceList": [
      "妖怪兽道",
      "博丽神社",
      "红魔馆",
      "迷途竹林",
      "魔法森林",
      "妖怪之山",
      "地灵殿"
    ],
    "type": "normal"
  },
  {
    "name": "妖怪狸",
    "favList": [
      "招牌",
      "肉",
      "饱腹",
      "重油",
      "咸",
      "山珍",
      "流行·喜爱"
    ],
    "drinkList": [
      "甘",
      "辛"
    ],
    "distanceList": [
      "妖怪兽道",
      "博丽神社",
      "红魔馆",
      "迷途竹林",
      "魔法森林",
      "妖怪之山"
    ],
    "type": "normal"
  },
  {
    "name": "妖怪狐",
    "favList": [
      "招牌",
      "肉",
      "小巧",
      "和风",
      "中华",
      "流行·喜爱"
    ],
    "drinkList": [
      "直饮"
    ],
    "distanceList": [
      "妖怪兽道",
      "红魔馆",
      "迷途竹林",
      "妖怪之山",
      "旧地狱"
    ],
    "type": "normal"
  },
  {
    "name": "蟒蛇精",
    "favList": [
      "肉",
      "下酒",
      "山珍",
      "力量涌现",
      "流行·喜爱"
    ],
    "drinkList": [
      "清酒",
      "烧酒"
    ],
    "distanceList": [
      "妖怪兽道",
      "妖怪之山",
      "旧地狱"
    ],
    "type": "normal"
  },
  {
    "name": "人类小孩",
    "favList": [
      "招牌",
      "家常",
      "肉",
      "饱腹",
      "甜",
      "咸",
      "凉爽",
      "中华",
      "流行·喜爱"
    ],
    "drinkList": [
      "无酒精"
    ],
    "distanceList": [
      "人间之里"
    ],
    "type": "normal"
  },
  {
    "name": "人类男性",
    "favList": [
      "肉",
      "下酒",
      "咸",
      "鲜",
      "灼热",
      "文化底蕴",
      "和风",
      "流行·喜爱"
    ],
    "drinkList": [
      "可加热",
      "烧酒"
    ],
    "distanceList": [
      "人间之里"
    ],
    "type": "normal"
  },
  {
    "name": "人类女性",
    "favList": [
      "招牌",
      "水产",
      "高级",
      "咸",
      "鲜",
      "凉爽",
      "流行·喜爱"
    ],
    "drinkList": [
      "可加冰"
    ],
    "distanceList": [
      "人间之里",
      "博丽神社"
    ],
    "type": "normal"
  },
  {
    "name": "人类长者",
    "favList": [
      "招牌",
      "高级",
      "灼热",
      "适合拍照",
      "流行·喜爱"
    ],
    "drinkList": [
      "低酒精"
    ],
    "distanceList": [
      "人间之里",
      "博丽神社"
    ],
    "type": "normal"
  },
  {
    "name": "左卫门",
    "favList": [
      "高级",
      "生",
      "猎奇",
      "力量涌现",
      "流行·喜爱"
    ],
    "drinkList": [
      "高酒精"
    ],
    "distanceList": [
      "人间之里",
      "博丽神社"
    ],
    "type": "normal"
  },
  {
    "name": "座敷童子",
    "favList": [
      "招牌",
      "甜",
      "生",
      "山珍",
      "凉爽",
      "和风",
      "流行·喜爱"
    ],
    "drinkList": [
      "无酒精",
      "低酒精"
    ],
    "distanceList": [
      "博丽神社"
    ],
    "type": "normal"
  },
  {
    "name": "河童",
    "favList": [
      "招牌",
      "大份",
      "小巧",
      "高级",
      "海味",
      "猎奇",
      "灼热",
      "流行·喜爱"
    ],
    "drinkList": [
      "甘"
    ],
    "distanceList": [
      "博丽神社",
      "红魔馆",
      "魔法森林",
      "妖怪之山"
    ],
    "type": "normal"
  },
  {
    "name": "鸦天狗",
    "favList": [
      "招牌",
      "高级",
      "适合拍照",
      "菌类",
      "流行·喜爱"
    ],
    "drinkList": [
      "清酒",
      "烧酒"
    ],
    "distanceList": [
      "博丽神社",
      "红魔馆",
      "迷途竹林",
      "妖怪之山"
    ],
    "type": "normal"
  },
  {
    "name": "妖精",
    "favList": [
      "甜",
      "鲜",
      "果味",
      "梦幻",
      "适合拍照",
      "菌类",
      "特产",
      "流行·喜爱"
    ],
    "drinkList": [
      "气泡",
      "水果",
      "直饮",
      "甘"
    ],
    "distanceList": [
      "红魔馆",
      "迷途竹林",
      "魔法森林"
    ],
    "type": "normal"
  },
  {
    "name": "魔法使",
    "favList": [
      "家常",
      "素",
      "清淡",
      "高级",
      "传说",
      "鲜",
      "凉爽",
      "适合拍照",
      "西式",
      "流行·喜爱"
    ],
    "drinkList": [
      "可加热",
      "西洋酒",
      "鸡尾酒",
      "提神"
    ],
    "distanceList": [
      "魔法森林"
    ],
    "type": "normal"
  },
  {
    "name": "森之妖精",
    "favList": [
      "招牌",
      "家常",
      "小巧",
      "甜",
      "鲜",
      "凉爽",
      "梦幻",
      "和风",
      "中华",
      "流行·喜爱"
    ],
    "drinkList": [
      "无酒精",
      "低酒精",
      "清酒",
      "水果",
      "甘"
    ],
    "distanceList": [
      "魔法森林"
    ],
    "type": "normal"
  },
  {
    "name": "迷之人形",
    "favList": [
      "家常",
      "小巧",
      "咸",
      "生",
      "梦幻",
      "猎奇",
      "适合拍照",
      "菌类",
      "流行·喜爱"
    ],
    "drinkList": [
      "气泡",
      "水果",
      "提神",
      "苦"
    ],
    "distanceList": [
      "魔法森林"
    ],
    "type": "normal"
  },
  {
    "name": "山姥",
    "favList": [
      "家常",
      "肉",
      "饱腹",
      "高级",
      "鲜",
      "猎奇",
      "力量涌现",
      "流行·喜爱"
    ],
    "drinkList": [
      "高酒精",
      "烧酒",
      "古典",
      "直饮"
    ],
    "distanceList": [
      "妖怪之山"
    ],
    "type": "normal"
  },
  {
    "name": "山童",
    "favList": [
      "招牌",
      "大份",
      "小巧",
      "高级",
      "山珍",
      "猎奇",
      "灼热",
      "流行·喜爱"
    ],
    "drinkList": [
      "中酒精",
      "苦"
    ],
    "distanceList": [
      "妖怪之山"
    ],
    "type": "normal"
  },
  {
    "name": "白狼天狗",
    "favList": [
      "招牌",
      "肉",
      "饱腹",
      "重油",
      "咸",
      "鲜",
      "生",
      "山珍",
      "特产",
      "流行·喜爱"
    ],
    "drinkList": [
      "中酒精",
      "高酒精",
      "清酒",
      "烧酒"
    ],
    "distanceList": [
      "妖怪之山"
    ],
    "type": "normal"
  },
  {
    "name": "土蜘蛛",
    "favList": [
      "肉",
      "饱腹",
      "重油",
      "大份",
      "甜",
      "鲜",
      "生",
      "山珍",
      "猎奇",
      "流行·喜爱"
    ],
    "drinkList": [
      "中酒精",
      "可加冰",
      "利口酒",
      "现代",
      "直饮",
      "甘",
      "苦"
    ],
    "distanceList": [
      "旧地狱"
    ],
    "type": "normal"
  },
  {
    "name": "鬼",
    "favList": [
      "肉",
      "下酒",
      "高级",
      "传说",
      "鲜",
      "力量涌现",
      "燃起来了",
      "特产",
      "流行·喜爱"
    ],
    "drinkList": [
      "中酒精",
      "高酒精",
      "烧酒",
      "直饮"
    ],
    "distanceList": [
      "旧地狱"
    ],
    "type": "normal"
  },
  {
    "name": "骨女",
    "favList": [
      "素",
      "清淡",
      "酸",
      "鲜",
      "生",
      "凉爽",
      "猎奇",
      "菌类",
      "流行·喜爱"
    ],
    "drinkList": [
      "低酒精",
      "可加热",
      "啤酒",
      "水果",
      "苦"
    ],
    "distanceList": [
      "旧地狱"
    ],
    "type": "normal"
  },
  {
    "name": "地狱鸦",
    "favList": [
      "家常",
      "肉",
      "小巧",
      "酸",
      "咸",
      "山珍",
      "海味",
      "燃起来了",
      "流行·喜爱"
    ],
    "drinkList": [
      "中酒精",
      "可加热",
      "啤酒",
      "苦",
      "辛"
    ],
    "distanceList": [
      "地灵殿"
    ],
    "type": "normal"
  },
  {
    "name": "姑获鸟",
    "favList": [
      "家常",
      "水产",
      "清淡",
      "酸",
      "鲜",
      "猎奇",
      "文化底蕴",
      "流行·喜爱"
    ],
    "drinkList": [
      "低酒精",
      "可加热",
      "烧酒",
      "苦"
    ],
    "distanceList": [
      "地灵殿"
    ],
    "type": "normal"
  },
  {
    "name": "豹女",
    "favList": [
      "肉",
      "重油",
      "高级",
      "生",
      "山珍",
      "海味",
      "灼热",
      "特产",
      "流行·喜爱"
    ],
    "drinkList": [
      "中酒精",
      "高酒精",
      "直饮",
      "辛"
    ],
    "distanceList": [
      "地灵殿"
    ],
    "type": "normal"
  },
  {
    "name": "地精",
    "favList": [
      "重油",
      "高级",
      "山珍",
      "凉爽",
      "灼热",
      "力量涌现",
      "流行·喜爱"
    ],
    "drinkList": [
      "清酒",
      "西洋酒"
    ],
    "distanceList": [
      "爱丽丝奖励符卡召唤"
    ],
    "type": "normal"
  }
] 
const dishList = [
  {
    "name": "饭团",
    "cook": "料理台",
    "price": "6",
    "props": [
      "实惠",
      "家常",
      "素",
      "饱腹",
      "和风"
    ],
    "useList": [
      "海苔"
    ],
    "invalidList": [
      ""
    ]
  },
  {
    "name": "海鲜味噌汤",
    "cook": "煮锅",
    "price": "8",
    "props": [
      "实惠",
      "家常",
      "素",
      "汤羹"
    ],
    "useList": [
      "海苔"
    ],
    "invalidList": [
      "重油"
    ]
  },
  {
    "name": "司康饼",
    "cook": "蒸锅",
    "price": "8",
    "props": [
      "实惠",
      "饱腹",
      "西式"
    ],
    "useList": [
      "黄油",
      "面粉"
    ],
    "invalidList": [
      ""
    ]
  },
  {
    "name": "炙猪肉饭团",
    "cook": "料理台",
    "price": "14",
    "props": [
      "实惠",
      "家常",
      "肉",
      "饱腹",
      "和风"
    ],
    "useList": [
      "猪肉"
    ],
    "invalidList": [
      ""
    ]
  },
  {
    "name": "炒肉丝",
    "cook": "油锅",
    "price": "15",
    "props": [
      "实惠",
      "家常",
      "肉",
      "下酒",
      "重油",
      "中华"
    ],
    "useList": [
      "猪肉"
    ],
    "invalidList": [
      ""
    ]
  },
  {
    "name": "油豆腐",
    "cook": "油锅",
    "price": "16",
    "props": [
      "实惠",
      "家常",
      "素",
      "重油",
      "和风"
    ],
    "useList": [
      "豆腐"
    ],
    "invalidList": [
      ""
    ]
  },
  {
    "name": "腌黄瓜",
    "cook": "料理台",
    "price": "16",
    "props": [
      "实惠",
      "素",
      "下酒",
      "小巧",
      "咸"
    ],
    "useList": [
      "黄瓜",
      "黑盐"
    ],
    "invalidList": [
      ""
    ]
  },
  {
    "name": "烤蘑菇",
    "cook": "烤架",
    "price": "18",
    "props": [
      "实惠",
      "素",
      "咸",
      "灼热",
      "菌类",
      "烧烤"
    ],
    "useList": [
      "蘑菇"
    ],
    "invalidList": [
      ""
    ]
  },
  {
    "name": "露水煮蛋",
    "cook": "蒸锅",
    "price": "18",
    "props": [
      "实惠",
      "清淡",
      "生"
    ],
    "useList": [
      "鸡蛋",
      "露水"
    ],
    "invalidList": [
      "肉",
      "水产",
      "重油"
    ]
  },
  {
    "name": "豆腐锅",
    "cook": "煮锅",
    "price": "19",
    "props": [
      "实惠",
      "素",
      "清淡",
      "灼热",
      "和风"
    ],
    "useList": [
      "豆腐"
    ],
    "invalidList": [
      ""
    ]
  },
  {
    "name": "香炸蝉蜕",
    "cook": "油锅",
    "price": "19",
    "props": [
      "实惠",
      "重油",
      "猎奇"
    ],
    "useList": [
      "蝉蜕"
    ],
    "invalidList": [
      ""
    ]
  },
  {
    "name": "蘑菇肉片",
    "cook": "油锅",
    "price": "20",
    "props": [
      "家常",
      "肉",
      "重油",
      "菌类"
    ],
    "useList": [
      "猪肉",
      "蘑菇"
    ],
    "invalidList": [
      ""
    ]
  },
  {
    "name": "凉菜雕花",
    "cook": "料理台",
    "price": "20",
    "props": [
      "素",
      "清淡",
      "凉爽",
      "适合拍照"
    ],
    "useList": [
      "萝卜"
    ],
    "invalidList": [
      "肉",
      "灼热"
    ]
  },
  {
    "name": "猪肉盖浇饭",
    "cook": "煮锅",
    "price": "20",
    "props": [
      "家常",
      "肉",
      "饱腹"
    ],
    "useList": [
      "猪肉"
    ],
    "invalidList": [
      ""
    ]
  },
  {
    "name": "牛肉盖浇饭",
    "cook": "煮锅",
    "price": "20",
    "props": [
      "家常",
      "肉",
      "饱腹"
    ],
    "useList": [
      "牛肉"
    ],
    "invalidList": [
      ""
    ]
  },
  {
    "name": "奶油炖菜",
    "cook": "蒸锅",
    "price": "20",
    "props": [
      "素",
      "菌类",
      "汤羹",
      "西式"
    ],
    "useList": [
      "洋葱",
      "蘑菇",
      "黄油"
    ],
    "invalidList": [
      ""
    ]
  },
  {
    "name": "月饼",
    "cook": "蒸锅",
    "price": "20",
    "props": [
      "饱腹",
      "小巧",
      "甜",
      "不可思议",
      "文化底蕴",
      "中华"
    ],
    "useList": [
      "蜂蜜",
      "面粉",
      "糯米",
      "月光草"
    ],
    "invalidList": [
      ""
    ]
  },
  {
    "name": "豆腐味噌",
    "cook": "煮锅",
    "price": "21",
    "props": [
      "家常",
      "素",
      "清淡",
      "汤羹",
      "和风"
    ],
    "useList": [
      "豆腐"
    ],
    "invalidList": [
      "重油"
    ]
  },
  {
    "name": "冷豆腐",
    "cook": "料理台",
    "price": "21",
    "props": [
      "家常",
      "素",
      "下酒",
      "清淡",
      "小巧"
    ],
    "useList": [
      "豆腐",
      "萝卜"
    ],
    "invalidList": [
      ""
    ]
  },
  {
    "name": "煮豆腐",
    "cook": "煮锅",
    "price": "22",
    "props": [
      "家常",
      "素",
      "清淡"
    ],
    "useList": [
      "豆腐"
    ],
    "invalidList": [
      ""
    ]
  },
  {
    "name": "土豆可乐饼",
    "cook": "油锅",
    "price": "22",
    "props": [
      "家常",
      "素",
      "重油"
    ],
    "useList": [
      "土豆"
    ],
    "invalidList": [
      "凉爽"
    ]
  },
  {
    "name": "炸虾天妇罗",
    "cook": "油锅",
    "price": "22",
    "props": [
      "下酒",
      "重油"
    ],
    "useList": [
      "虾",
      "面粉"
    ],
    "invalidList": [
      "清淡"
    ]
  },
  {
    "name": "热松饼",
    "cook": "油锅",
    "price": "22",
    "props": [
      "饱腹",
      "甜",
      "西式"
    ],
    "useList": [
      "鸡蛋",
      "蜂蜜",
      "面粉"
    ],
    "invalidList": [
      ""
    ]
  },
  {
    "name": "烤八目鳗",
    "cook": "烤架",
    "price": "22",
    "props": [
      "招牌",
      "水产",
      "烧烤"
    ],
    "useList": [
      "八目鳗"
    ],
    "invalidList": [
      "肉",
      "素"
    ]
  },
  {
    "name": "臭豆腐",
    "cook": "油锅",
    "price": "24",
    "props": [
      "素",
      "辣",
      "猎奇",
      "中华"
    ],
    "useList": [
      "豆腐",
      "辣椒"
    ],
    "invalidList": [
      "甜",
      "果味"
    ]
  },
  {
    "name": "大阪烧",
    "cook": "油锅",
    "price": "24",
    "props": [
      "招牌",
      "小巧",
      "适合拍照",
      "和风"
    ],
    "useList": [
      "萝卜",
      "鸡蛋",
      "面粉"
    ],
    "invalidList": [
      ""
    ]
  },
  {
    "name": "丧气芝士条",
    "cook": "蒸锅",
    "price": "25",
    "props": [
      "下酒",
      "咸",
      "鲜",
      "特产"
    ],
    "useList": [
      "白果",
      "白果",
      "芝士"
    ],
    "invalidList": [
      ""
    ]
  },
  {
    "name": "炸猪肉排",
    "cook": "油锅",
    "price": "25",
    "props": [
      "家常",
      "肉",
      "饱腹",
      "重油"
    ],
    "useList": [
      "猪肉"
    ],
    "invalidList": [
      ""
    ]
  },
  {
    "name": "竹笋炒肉",
    "cook": "油锅",
    "price": "25",
    "props": [
      "家常",
      "肉",
      "下酒"
    ],
    "useList": [
      "猪肉",
      "竹笋"
    ],
    "invalidList": [
      ""
    ]
  },
  {
    "name": "北极甜虾蜜桃色拉",
    "cook": "料理台",
    "price": "25",
    "props": [
      "素",
      "水产",
      "清淡",
      "甜",
      "果味",
      "不可思议",
      "适合拍照"
    ],
    "useList": [
      "虾",
      "桃子",
      "冰块"
    ],
    "invalidList": [
      "肉",
      "咸"
    ]
  },
  {
    "name": "芝士蛋",
    "cook": "油锅",
    "price": "26",
    "props": [
      "重油",
      "咸",
      "鲜",
      "生"
    ],
    "useList": [
      "鸡蛋",
      "芝士"
    ],
    "invalidList": [
      "肉"
    ]
  },
  {
    "name": "猫饭",
    "cook": "料理台",
    "price": "26",
    "props": [
      "水产",
      "小巧",
      "鲜"
    ],
    "useList": [
      "鳟鱼",
      "露水",
      "面粉"
    ],
    "invalidList": [
      "重油"
    ]
  },
  {
    "name": "猪肉鳟鱼熏",
    "cook": "烤架",
    "price": "26",
    "props": [
      "家常",
      "肉",
      "水产",
      "烧烤"
    ],
    "useList": [
      "鳟鱼",
      "猪肉"
    ],
    "invalidList": [
      ""
    ]
  },
  {
    "name": "炸八目鳗",
    "cook": "油锅",
    "price": "27",
    "props": [
      "招牌",
      "水产",
      "重油"
    ],
    "useList": [
      "八目鳗"
    ],
    "invalidList": [
      "凉爽"
    ]
  },
  {
    "name": "狮子头",
    "cook": "煮锅",
    "price": "28",
    "props": [
      "招牌",
      "肉",
      "下酒",
      "鲜",
      "特产"
    ],
    "useList": [
      "牛肉"
    ],
    "invalidList": [
      "水产",
      "饱腹"
    ]
  },
  {
    "name": "奶香蘑菇汤",
    "cook": "煮锅",
    "price": "28",
    "props": [
      "家常",
      "适合拍照",
      "菌类"
    ],
    "useList": [
      "土豆",
      "蘑菇",
      "奶油"
    ],
    "invalidList": [
      ""
    ]
  },
  {
    "name": "手握寿司",
    "cook": "料理台",
    "price": "28",
    "props": [
      "水产",
      "清淡",
      "鲜",
      "生",
      "文化底蕴",
      "和风"
    ],
    "useList": [
      "三文鱼",
      "金枪鱼"
    ],
    "invalidList": [
      ""
    ]
  },
  {
    "name": "麻薯",
    "cook": "料理台",
    "price": "30",
    "props": [
      "小巧",
      "甜",
      "和风"
    ],
    "useList": [
      "糯米"
    ],
    "invalidList": [
      "肉",
      "水产",
      "咸",
      "鲜"
    ]
  },
  {
    "name": "秘制小鱼干",
    "cook": "料理台",
    "price": "30",
    "props": [
      "水产",
      "小巧",
      "咸",
      "鲜"
    ],
    "useList": [
      "鳟鱼"
    ],
    "invalidList": [
      ""
    ]
  },
  {
    "name": "温暖饭团",
    "cook": "料理台",
    "price": "30",
    "props": [
      "家常",
      "素",
      "水产",
      "饱腹",
      "灼热",
      "和风"
    ],
    "useList": [
      "鳟鱼",
      "洋葱"
    ],
    "invalidList": [
      ""
    ]
  },
  {
    "name": "樱花布丁",
    "cook": "蒸锅",
    "price": "32",
    "props": [
      "小巧",
      "甜",
      "果味",
      "凉爽",
      "适合拍照",
      "特产"
    ],
    "useList": [
      "桃子",
      "蜂蜜"
    ],
    "invalidList": [
      "重油",
      "咸"
    ]
  },
  {
    "name": "麻婆豆腐",
    "cook": "油锅",
    "price": "32",
    "props": [
      "素",
      "辣",
      "灼热",
      "中华"
    ],
    "useList": [
      "猪肉",
      "豆腐",
      "辣椒"
    ],
    "invalidList": [
      "甜",
      "果味",
      "凉爽"
    ]
  },
  {
    "name": "力量汤",
    "cook": "煮锅",
    "price": "34",
    "props": [
      "肉",
      "山珍",
      "灼热",
      "力量涌现",
      "汤羹"
    ],
    "useList": [
      "野猪肉",
      "海苔"
    ],
    "invalidList": [
      "小巧",
      "凉爽"
    ]
  },
  {
    "name": "水饺",
    "cook": "煮锅",
    "price": "35",
    "props": [
      "家常",
      "素",
      "文化底蕴",
      "中华"
    ],
    "useList": [
      "面粉"
    ],
    "invalidList": [
      ""
    ]
  },
  {
    "name": "汤圆",
    "cook": "煮锅",
    "price": "35",
    "props": [
      "家常",
      "素",
      "文化底蕴",
      "中华"
    ],
    "useList": [
      "糯米"
    ],
    "invalidList": [
      ""
    ]
  },
  {
    "name": "班尼迪克蛋",
    "cook": "油锅",
    "price": "35",
    "props": [
      "饱腹",
      "小巧",
      "生",
      "西式"
    ],
    "useList": [
      "竹笋",
      "鸡蛋",
      "黄油",
      "面粉"
    ],
    "invalidList": [
      "甜",
      "果味"
    ]
  },
  {
    "name": "章鱼烧",
    "cook": "油锅",
    "price": "36",
    "props": [
      "招牌",
      "水产",
      "饱腹",
      "小巧",
      "适合拍照"
    ],
    "useList": [
      "章鱼",
      "海苔",
      "面粉"
    ],
    "invalidList": [
      ""
    ]
  },
  {
    "name": "阴郁水果派",
    "cook": "料理台",
    "price": "36",
    "props": [
      "酸",
      "咸",
      "鲜",
      "果味",
      "特产"
    ],
    "useList": [
      "葡萄",
      "柠檬",
      "芝士"
    ],
    "invalidList": [
      ""
    ]
  },
  {
    "name": "杂炊",
    "cook": "煮锅",
    "price": "40",
    "props": [
      "家常",
      "肉",
      "鲜",
      "灼热"
    ],
    "useList": [
      "鳟鱼",
      "豆腐",
      "海苔"
    ],
    "invalidList": [
      ""
    ]
  },
  {
    "name": "竹筒蒸蛋",
    "cook": "蒸锅",
    "price": "40",
    "props": [
      "家常",
      "清淡",
      "菌类"
    ],
    "useList": [
      "海苔",
      "蘑菇",
      "鸡蛋",
      "竹子"
    ],
    "invalidList": [
      ""
    ]
  },
  {
    "name": "黄金酥鱼饼",
    "cook": "油锅",
    "price": "40",
    "props": [
      "水产",
      "下酒",
      "重油",
      "力量涌现"
    ],
    "useList": [
      "鳟鱼",
      "蜂蜜",
      "面粉"
    ],
    "invalidList": [
      ""
    ]
  },
  {
    "name": "流水素面",
    "cook": "料理台",
    "price": "40",
    "props": [
      "素",
      "清淡",
      "凉爽",
      "不可思议"
    ],
    "useList": [
      "面粉",
      "竹子"
    ],
    "invalidList": [
      "重油"
    ]
  },
  {
    "name": "脆旋风",
    "cook": "料理台",
    "price": "42",
    "props": [
      "饱腹",
      "生",
      "猎奇",
      "特产"
    ],
    "useList": [
      "蜂蜜",
      "蝉蜕",
      "面粉"
    ],
    "invalidList": [
      "重油"
    ]
  },
  {
    "name": "提神布丁",
    "cook": "蒸锅",
    "price": "42",
    "props": [
      "小巧",
      "酸",
      "甜",
      "果味",
      "凉爽",
      "力量涌现"
    ],
    "useList": [
      "葡萄",
      "葡萄",
      "柠檬"
    ],
    "invalidList": [
      "重油",
      "咸"
    ]
  },
  {
    "name": "红烧鳗鱼",
    "cook": "油锅",
    "price": "42",
    "props": [
      "招牌",
      "素",
      "水产",
      "重油",
      "鲜"
    ],
    "useList": [
      "八目鳗",
      "洋葱"
    ],
    "invalidList": [
      ""
    ]
  },
  {
    "name": "三文鱼天妇罗",
    "cook": "油锅",
    "price": "44",
    "props": [
      "水产",
      "重油",
      "小巧",
      "高级",
      "鲜"
    ],
    "useList": [
      "三文鱼",
      "鸡蛋",
      "黄油",
      "面粉"
    ],
    "invalidList": [
      ""
    ]
  },
  {
    "name": "能量串",
    "cook": "烤架",
    "price": "50",
    "props": [
      "肉",
      "饱腹",
      "烧烤"
    ],
    "useList": [
      "牛肉",
      "洋葱",
      "南瓜"
    ],
    "invalidList": [
      ""
    ]
  },
  {
    "name": "樱落雪",
    "cook": "料理台",
    "price": "50",
    "props": [
      "水产",
      "小巧",
      "高级",
      "生",
      "海味",
      "适合拍照",
      "和风"
    ],
    "useList": [
      "极上金枪鱼"
    ],
    "invalidList": [
      "重油"
    ]
  },
  {
    "name": "桃花羹",
    "cook": "煮锅",
    "price": "55",
    "props": [
      "素",
      "甜",
      "果味",
      "凉爽",
      "适合拍照",
      "汤羹"
    ],
    "useList": [
      "桃子",
      "露水",
      "冰块"
    ],
    "invalidList": [
      ""
    ]
  },
  {
    "name": "真·海鲜味噌汤",
    "cook": "煮锅",
    "price": "55",
    "props": [
      "家常",
      "水产",
      "清淡",
      "汤羹"
    ],
    "useList": [
      "鳟鱼",
      "三文鱼"
    ],
    "invalidList": [
      ""
    ]
  },
  {
    "name": "南瓜虾盅",
    "cook": "蒸锅",
    "price": "55",
    "props": [
      "水产",
      "饱腹",
      "清淡",
      "甜",
      "鲜",
      "适合拍照",
      "特产"
    ],
    "useList": [
      "虾",
      "豆腐",
      "南瓜"
    ],
    "invalidList": [
      ""
    ]
  },
  {
    "name": "白桃生八桥",
    "cook": "料理台",
    "price": "55",
    "props": [
      "甜",
      "果味",
      "和风"
    ],
    "useList": [
      "桃子",
      "糯米"
    ],
    "invalidList": [
      "肉",
      "水产",
      "咸",
      "鲜"
    ]
  },
  {
    "name": "普通小蛋糕",
    "cook": "蒸锅",
    "price": "56",
    "props": [
      "高级",
      "甜",
      "果味",
      "适合拍照",
      "文化底蕴"
    ],
    "useList": [
      "鸡蛋",
      "葡萄",
      "奶油"
    ],
    "invalidList": [
      ""
    ]
  },
  {
    "name": "蔬菜专辑",
    "cook": "料理台",
    "price": "56",
    "props": [
      "素",
      "清淡",
      "生",
      "凉爽"
    ],
    "useList": [
      "土豆",
      "洋葱",
      "南瓜"
    ],
    "invalidList": [
      "肉",
      "水产",
      "灼热"
    ]
  },
  {
    "name": "香煎三文鱼",
    "cook": "油锅",
    "price": "58",
    "props": [
      "肉",
      "鲜",
      "西式"
    ],
    "useList": [
      "三文鱼",
      "竹笋"
    ],
    "invalidList": [
      ""
    ]
  },
  {
    "name": "黄油牛排",
    "cook": "油锅",
    "price": "60",
    "props": [
      "肉",
      "饱腹",
      "重油",
      "西式"
    ],
    "useList": [
      "和牛",
      "黄油"
    ],
    "invalidList": [
      "甜",
      "凉爽"
    ]
  },
  {
    "name": "巨人玉子烧",
    "cook": "油锅",
    "price": "60",
    "props": [
      "饱腹",
      "高级",
      "甜",
      "力量涌现",
      "和风"
    ],
    "useList": [
      "鸡蛋",
      "鸡蛋",
      "面粉",
      "面粉"
    ],
    "invalidList": [
      "下酒"
    ]
  },
  {
    "name": "豚骨拉面",
    "cook": "煮锅",
    "price": "60",
    "props": [
      "家常",
      "肉",
      "饱腹",
      "咸"
    ],
    "useList": [
      "猪肉",
      "海苔",
      "鸡蛋"
    ],
    "invalidList": [
      ""
    ]
  },
  {
    "name": "诗礼银杏",
    "cook": "蒸锅",
    "price": "60",
    "props": [
      "素",
      "甜",
      "文化底蕴",
      "中华"
    ],
    "useList": [
      "白果",
      "蜂蜜"
    ],
    "invalidList": [
      "咸"
    ]
  },
  {
    "name": "猩红恶魔蛋糕",
    "cook": "料理台",
    "price": "60",
    "props": [
      "甜",
      "梦幻",
      "猎奇",
      "适合拍照",
      "西式"
    ],
    "useList": [
      "土豆",
      "南瓜",
      "蜂蜜",
      "露水"
    ],
    "invalidList": [
      ""
    ]
  },
  {
    "name": "无意识妖怪慕斯",
    "cook": "料理台",
    "price": "60",
    "props": [
      "高级",
      "甜",
      "梦幻",
      "适合拍照",
      "西式"
    ],
    "useList": [
      "豆腐",
      "洋葱",
      "蜂蜜",
      "黄油"
    ],
    "invalidList": [
      ""
    ]
  },
  {
    "name": "秘制鲜菌煲",
    "cook": "煮锅",
    "price": "62",
    "props": [
      "昂贵",
      "鲜",
      "菌类",
      "特产",
      "和风"
    ],
    "useList": [
      "蘑菇",
      "松露",
      "露水"
    ],
    "invalidList": [
      ""
    ]
  },
  {
    "name": "一击☆必杀",
    "cook": "烤架",
    "price": "62",
    "props": [
      "昂贵",
      "肉",
      "饱腹",
      "重油",
      "山珍",
      "力量涌现"
    ],
    "useList": [
      "鹿肉",
      "野猪肉",
      "洋葱"
    ],
    "invalidList": [
      ""
    ]
  },
  {
    "name": "白果萝卜排骨汤",
    "cook": "煮锅",
    "price": "65",
    "props": [
      "昂贵",
      "肉",
      "灼热",
      "汤羹",
      "中华"
    ],
    "useList": [
      "猪肉",
      "萝卜",
      "白果"
    ],
    "invalidList": [
      ""
    ]
  },
  {
    "name": "竹取姬",
    "cook": "蒸锅",
    "price": "65",
    "props": [
      "昂贵",
      "肉",
      "高级",
      "传说",
      "适合拍照",
      "文化底蕴",
      "特产",
      "和风"
    ],
    "useList": [
      "黑毛猪肉",
      "松露",
      "竹笋",
      "白果",
      "竹子"
    ],
    "invalidList": [
      ""
    ]
  },
  {
    "name": "不死鸟",
    "cook": "烤架",
    "price": "65",
    "props": [
      "昂贵",
      "高级",
      "传说",
      "燃起来了",
      "适合拍照",
      "烧烤",
      "西式"
    ],
    "useList": [
      "土豆",
      "洋葱",
      "萝卜",
      "蜂蜜",
      "面粉"
    ],
    "invalidList": [
      ""
    ]
  },
  {
    "name": "仰望天花板派",
    "cook": "蒸锅",
    "price": "66",
    "props": [
      "昂贵",
      "招牌",
      "下酒",
      "海味",
      "猎奇",
      "适合拍照",
      "特产"
    ],
    "useList": [
      "鳟鱼",
      "桃子",
      "面粉"
    ],
    "invalidList": [
      "肉"
    ]
  },
  {
    "name": "月之恋人",
    "cook": "料理台",
    "price": "66",
    "props": [
      "昂贵",
      "小巧",
      "甜",
      "适合拍照",
      "特产"
    ],
    "useList": [
      "鸡蛋",
      "黄油",
      "面粉",
      "月光草"
    ],
    "invalidList": [
      "肉",
      "素",
      "水产"
    ]
  },
  {
    "name": "野味加农",
    "cook": "煮锅",
    "price": "66",
    "props": [
      "昂贵",
      "肉",
      "饱腹",
      "重油",
      "山珍",
      "灼热"
    ],
    "useList": [
      "黑毛猪肉",
      "土豆",
      "南瓜"
    ],
    "invalidList": [
      ""
    ]
  },
  {
    "name": "水煮鱼",
    "cook": "煮锅",
    "price": "68",
    "props": [
      "昂贵",
      "水产",
      "辣",
      "灼热",
      "燃起来了",
      "中华"
    ],
    "useList": [
      "鳟鱼",
      "辣椒"
    ],
    "invalidList": [
      "肉",
      "甜",
      "果味",
      "凉爽"
    ]
  },
  {
    "name": "意式烩饭",
    "cook": "蒸锅",
    "price": "70",
    "props": [
      "昂贵",
      "饱腹",
      "鲜",
      "菌类",
      "西式"
    ],
    "useList": [
      "洋葱",
      "蘑菇",
      "竹笋",
      "黄油"
    ],
    "invalidList": [
      "甜"
    ]
  },
  {
    "name": "赛熊掌",
    "cook": "蒸锅",
    "price": "70",
    "props": [
      "昂贵",
      "肉",
      "水产",
      "高级",
      "鲜",
      "山珍",
      "不可思议",
      "力量涌现"
    ],
    "useList": [
      "河豚",
      "黑毛猪肉",
      "竹笋"
    ],
    "invalidList": [
      ""
    ]
  },
  {
    "name": "蜜汁叉烧",
    "cook": "烤架",
    "price": "70",
    "props": [
      "昂贵",
      "肉",
      "重油",
      "甜",
      "不可思议",
      "中华"
    ],
    "useList": [
      "猪肉",
      "蜂蜜"
    ],
    "invalidList": [
      ""
    ]
  },
  {
    "name": "燃尽布丁",
    "cook": "蒸锅",
    "price": "73",
    "props": [
      "昂贵",
      "招牌",
      "小巧",
      "酸",
      "甜",
      "果味",
      "凉爽",
      "梦幻",
      "力量涌现"
    ],
    "useList": [
      "蜂蜜",
      "葡萄",
      "柠檬",
      "柠檬"
    ],
    "invalidList": [
      "重油",
      "咸"
    ]
  },
  {
    "name": "毛玉三色冰激凌",
    "cook": "料理台",
    "price": "75",
    "props": [
      "昂贵",
      "甜",
      "凉爽",
      "梦幻",
      "适合拍照",
      "西式"
    ],
    "useList": [
      "豆腐",
      "鸡蛋",
      "蜂蜜",
      "露水"
    ],
    "invalidList": [
      ""
    ]
  },
  {
    "name": "幻昙花糕",
    "cook": "蒸锅",
    "price": "78",
    "props": [
      "昂贵",
      "高级",
      "传说",
      "甜",
      "梦幻",
      "适合拍照"
    ],
    "useList": [
      "幻昙华",
      "露水"
    ],
    "invalidList": [
      "肉",
      "水产"
    ]
  },
  {
    "name": "猪鹿蝶",
    "cook": "蒸锅",
    "price": "78",
    "props": [
      "昂贵",
      "肉",
      "高级",
      "适合拍照",
      "文化底蕴"
    ],
    "useList": [
      "鹿肉",
      "野猪肉",
      "月光草"
    ],
    "invalidList": [
      ""
    ]
  },
  {
    "name": "月光团子",
    "cook": "料理台",
    "price": "80",
    "props": [
      "昂贵",
      "甜",
      "不可思议",
      "特产",
      "和风"
    ],
    "useList": [
      "糯米",
      "月光草"
    ],
    "invalidList": [
      "肉",
      "水产",
      "咸",
      "鲜"
    ]
  },
  {
    "name": "毛玉熔岩豆腐",
    "cook": "料理台",
    "price": "85",
    "props": [
      "昂贵",
      "素",
      "鲜",
      "不可思议",
      "适合拍照",
      "中华"
    ],
    "useList": [
      "牛肉",
      "豆腐",
      "洋葱",
      "辣椒"
    ],
    "invalidList": [
      ""
    ]
  },
  {
    "name": "奶油焗蟹",
    "cook": "油锅",
    "price": "88",
    "props": [
      "昂贵",
      "招牌",
      "下酒",
      "高级",
      "鲜",
      "海味",
      "适合拍照"
    ],
    "useList": [
      "螃蟹",
      "奶油"
    ],
    "invalidList": [
      ""
    ]
  },
  {
    "name": "刺身拼盘",
    "cook": "料理台",
    "price": "88",
    "props": [
      "昂贵",
      "水产",
      "高级",
      "生",
      "适合拍照",
      "和风"
    ],
    "useList": [
      "三文鱼",
      "金枪鱼"
    ],
    "invalidList": [
      "灼热"
    ]
  },
  {
    "name": "二天一流",
    "cook": "烤架",
    "price": "90",
    "props": [
      "昂贵",
      "肉",
      "高级",
      "山珍",
      "燃起来了",
      "文化底蕴",
      "烧烤"
    ],
    "useList": [
      "野猪肉",
      "黑毛猪肉"
    ],
    "invalidList": [
      "家常"
    ]
  },
  {
    "name": "绝叫关东煮",
    "cook": "煮锅",
    "price": "92",
    "props": [
      "昂贵",
      "肉",
      "饱腹",
      "大份",
      "高级",
      "辣",
      "鲜",
      "灼热",
      "力量涌现",
      "特产"
    ],
    "useList": [
      "牛肉",
      "豆腐",
      "萝卜",
      "辣椒",
      "辣椒"
    ],
    "invalidList": [
      ""
    ]
  },
  {
    "name": "七色羊羹",
    "cook": "蒸锅",
    "price": "92",
    "props": [
      "昂贵",
      "高级",
      "甜",
      "果味",
      "梦幻",
      "不可思议",
      "适合拍照",
      "文化底蕴"
    ],
    "useList": [
      "海苔",
      "幻昙华",
      "露水",
      "葡萄"
    ],
    "invalidList": [
      ""
    ]
  },
  {
    "name": "白雪",
    "cook": "煮锅",
    "price": "98",
    "props": [
      "昂贵",
      "肉",
      "水产",
      "高级",
      "文化底蕴",
      "和风"
    ],
    "useList": [
      "八目鳗",
      "河豚",
      "海苔"
    ],
    "invalidList": [
      ""
    ]
  },
  {
    "name": "大奢宴",
    "cook": "煮锅",
    "price": "105",
    "props": [
      "昂贵",
      "肉",
      "水产",
      "饱腹",
      "高级",
      "山珍"
    ],
    "useList": [
      "河豚",
      "黑毛猪肉",
      "和牛"
    ],
    "invalidList": [
      "实惠",
      "家常"
    ]
  },
  {
    "name": "兜甲蛋糕",
    "cook": "蒸锅",
    "price": "105",
    "props": [
      "昂贵",
      "招牌",
      "饱腹",
      "高级",
      "鲜",
      "生",
      "猎奇",
      "力量涌现",
      "适合拍照",
      "特产"
    ],
    "useList": [
      "黑毛猪肉",
      "蜂蜜",
      "蝉蜕",
      "面粉"
    ],
    "invalidList": [
      ""
    ]
  },
  {
    "name": "地狱激辛警告！",
    "cook": "油锅",
    "price": "108",
    "props": [
      "昂贵",
      "肉",
      "重油",
      "辣",
      "咸",
      "猎奇",
      "灼热",
      "力量涌现",
      "适合拍照"
    ],
    "useList": [
      "牛肉",
      "辣椒",
      "辣椒",
      "辣椒",
      "芝士"
    ],
    "invalidList": [
      "素",
      "清淡"
    ]
  },
  {
    "name": "海胆刺身",
    "cook": "料理台",
    "price": "108",
    "props": [
      "昂贵",
      "小巧",
      "高级",
      "甜",
      "海味",
      "不可思议",
      "适合拍照",
      "特产"
    ],
    "useList": [
      "海胆",
      "露水"
    ],
    "invalidList": [
      ""
    ]
  },
  {
    "name": "蘑女的舞踏烩",
    "cook": "煮锅",
    "price": "112",
    "props": [
      "昂贵",
      "水产",
      "重油",
      "辣",
      "咸",
      "鲜",
      "灼热",
      "适合拍照",
      "菌类"
    ],
    "useList": [
      "虾",
      "章鱼",
      "蘑菇",
      "辣椒"
    ],
    "invalidList": [
      ""
    ]
  },
  {
    "name": "全肉盛宴",
    "cook": "烤架",
    "price": "115",
    "props": [
      "昂贵",
      "肉",
      "下酒",
      "大份",
      "高级",
      "咸",
      "山珍",
      "灼热",
      "适合拍照"
    ],
    "useList": [
      "鹿肉",
      "野猪肉",
      "黑毛猪肉",
      "和牛"
    ],
    "invalidList": [
      ""
    ]
  },
  {
    "name": "拟尻子玉",
    "cook": "煮锅",
    "price": "120",
    "props": [
      "昂贵",
      "下酒",
      "小巧",
      "传说",
      "梦幻",
      "猎奇",
      "灼热"
    ],
    "useList": [
      "鹿肉",
      "松露",
      "蝉蜕"
    ],
    "invalidList": [
      ""
    ]
  },
  {
    "name": "岩浆",
    "cook": "煮锅",
    "price": "125",
    "props": [
      "昂贵",
      "肉",
      "水产",
      "饱腹",
      "高级",
      "灼热",
      "力量涌现",
      "菌类"
    ],
    "useList": [
      "河豚",
      "牛肉",
      "和牛",
      "松露"
    ],
    "invalidList": [
      "凉爽"
    ]
  },
  {
    "name": "蓬莱玉枝",
    "cook": "烤架",
    "price": "125",
    "props": [
      "昂贵",
      "肉",
      "高级",
      "传说",
      "文化底蕴",
      "烧烤"
    ],
    "useList": [
      "三文鱼",
      "猪肉",
      "鹿肉",
      "和牛",
      "竹子"
    ],
    "invalidList": [
      ""
    ]
  },
  {
    "name": "华光玉煎包",
    "cook": "油锅",
    "price": "128",
    "props": [
      "昂贵",
      "肉",
      "高级",
      "传说",
      "梦幻",
      "菌类",
      "中华"
    ],
    "useList": [
      "黑毛猪肉",
      "蘑菇"
    ],
    "invalidList": [
      ""
    ]
  },
  {
    "name": "鱼跃龙门",
    "cook": "蒸锅",
    "price": "142",
    "props": [
      "昂贵",
      "肉",
      "水产",
      "大份",
      "高级",
      "甜",
      "鲜",
      "海味",
      "梦幻",
      "文化底蕴",
      "菌类",
      "中华"
    ],
    "useList": [
      "极上金枪鱼",
      "鹿肉",
      "松露",
      "蜂蜜",
      "月光草"
    ],
    "invalidList": [
      ""
    ]
  },
  {
    "name": "惠灵顿牛排",
    "cook": "油锅",
    "price": "150",
    "props": [
      "昂贵",
      "肉",
      "高级",
      "传说",
      "山珍",
      "西式"
    ],
    "useList": [
      "和牛",
      "松露",
      "鸡蛋",
      "黄油",
      "面粉"
    ],
    "invalidList": [
      "甜",
      "凉爽"
    ]
  },
  {
    "name": "幻想佛跳墙",
    "cook": "煮锅",
    "price": "160",
    "props": [
      "昂贵",
      "肉",
      "水产",
      "高级",
      "传说",
      "山珍",
      "力量涌现",
      "适合拍照",
      "文化底蕴",
      "菌类",
      "特产",
      "中华"
    ],
    "useList": [
      "极上金枪鱼",
      "河豚",
      "黑毛猪肉",
      "和牛",
      "松露"
    ],
    "invalidList": [
      ""
    ]
  },
  {
    "name": "大江户船祭",
    "cook": "料理台",
    "price": "206",
    "props": [
      "昂贵",
      "招牌",
      "水产",
      "下酒",
      "高级",
      "传说",
      "鲜",
      "生",
      "海味",
      "适合拍照",
      "文化底蕴",
      "和风"
    ],
    "useList": [
      "鳟鱼",
      "三文鱼",
      "金枪鱼",
      "极上金枪鱼",
      "冰块"
    ],
    "invalidList": [
      ""
    ]
  }
] 
const wineList = [
  {
    "name": "绿茶",
    "price": "1",
    "props": [
      "无酒精"
    ]
  },
  {
    "name": "果味High Ball",
    "price": "12",
    "props": [
      "低酒精",
      "可加冰",
      "西洋酒",
      "鸡尾酒",
      "水果",
      "甘",
      "苦"
    ]
  },
  {
    "name": "果味SOUR",
    "price": "12",
    "props": [
      "低酒精",
      "可加冰",
      "烧酒",
      "鸡尾酒",
      "水果",
      "甘",
      "苦"
    ]
  },
  {
    "name": "牛奶",
    "price": "16",
    "props": [
      "无酒精",
      "直饮"
    ]
  },
  {
    "name": "淇",
    "price": "18",
    "props": [
      "低酒精",
      "可加冰",
      "清酒",
      "鸡尾酒",
      "气泡",
      "甘",
      "苦",
      "辛"
    ]
  },
  {
    "name": "超ZUN啤酒",
    "price": "18",
    "props": [
      "低酒精",
      "可加冰",
      "啤酒",
      "苦"
    ]
  },
  {
    "name": "红柚果汁",
    "price": "24",
    "props": [
      "无酒精",
      "水果"
    ]
  },
  {
    "name": "红魔馆红茶",
    "price": "25",
    "props": [
      "无酒精",
      "可加热",
      "水果",
      "提神"
    ]
  },
  {
    "name": "波子汽水",
    "price": "30",
    "props": [
      "无酒精",
      "现代",
      "气泡"
    ]
  },
  {
    "name": "梅酒",
    "price": "32",
    "props": [
      "中酒精",
      "可加冰",
      "可加热",
      "利口酒",
      "水果"
    ]
  },
  {
    "name": "普通健身茶",
    "price": "32",
    "props": [
      "中酒精",
      "利口酒",
      "气泡",
      "苦"
    ]
  },
  {
    "name": "日月星",
    "price": "34",
    "props": [
      "中酒精",
      "可加冰",
      "可加热",
      "清酒",
      "直饮"
    ]
  },
  {
    "name": "古明地冰激凌",
    "price": "35",
    "props": [
      "无酒精",
      "现代",
      "水果",
      "甘"
    ]
  },
  {
    "name": "“大冰棍儿！”",
    "price": "35",
    "props": [
      "无酒精",
      "现代",
      "提神",
      "甘"
    ]
  },
  {
    "name": "阿芙加朵",
    "price": "35",
    "props": [
      "无酒精",
      "可加冰",
      "提神",
      "甘",
      "苦"
    ]
  },
  {
    "name": "古法奶油冰沙",
    "price": "42",
    "props": [
      "无酒精",
      "可加冰",
      "古典",
      "甘"
    ]
  },
  {
    "name": "冰山毛玉冻柠",
    "price": "45",
    "props": [
      "无酒精",
      "可加冰",
      "气泡",
      "水果",
      "提神",
      "直饮",
      "甘"
    ]
  },
  {
    "name": "月面火箭",
    "price": "45",
    "props": [
      "无酒精",
      "可加冰",
      "现代",
      "气泡"
    ]
  },
  {
    "name": "气保健",
    "price": "45",
    "props": [
      "无酒精",
      "提神",
      "直饮",
      "甘"
    ]
  },
  {
    "name": "猩红恶魔",
    "price": "45",
    "props": [
      "低酒精",
      "可加冰",
      "西洋酒",
      "鸡尾酒"
    ]
  },
  {
    "name": "神之麦",
    "price": "45",
    "props": [
      "中酒精",
      "可加冰",
      "可加热",
      "烧酒",
      "直饮"
    ]
  },
  {
    "name": "玉露茶",
    "price": "50",
    "props": [
      "无酒精",
      "可加热",
      "古典"
    ]
  },
  {
    "name": "雀酒",
    "price": "50",
    "props": [
      "中酒精",
      "可加冰",
      "可加热",
      "清酒",
      "辛"
    ]
  },
  {
    "name": "冬酿",
    "price": "60",
    "props": [
      "低酒精",
      "可加冰",
      "可加热",
      "古典",
      "甘"
    ]
  },
  {
    "name": "咖啡",
    "price": "62",
    "props": [
      "无酒精",
      "可加冰",
      "可加热",
      "现代",
      "提神",
      "苦"
    ]
  },
  {
    "name": "天狗踊",
    "price": "70",
    "props": [
      "高酒精",
      "可加冰",
      "可加热",
      "清酒",
      "直饮"
    ]
  },
  {
    "name": "红雾",
    "price": "75",
    "props": [
      "中酒精",
      "可加热",
      "西洋酒"
    ]
  },
  {
    "name": "妖精雨露",
    "price": "80",
    "props": [
      "无酒精",
      "可加冰",
      "甘"
    ]
  },
  {
    "name": "尼格罗尼",
    "price": "100",
    "props": [
      "中酒精",
      "可加冰",
      "西洋酒",
      "鸡尾酒",
      "水果",
      "苦"
    ]
  },
  {
    "name": "水獭祭",
    "price": "130",
    "props": [
      "中酒精",
      "可加冰",
      "可加热",
      "清酒",
      "直饮"
    ]
  },
  {
    "name": "风祝",
    "price": "130",
    "props": [
      "中酒精",
      "可加冰",
      "鸡尾酒",
      "现代",
      "甘"
    ]
  },
  {
    "name": "教父",
    "price": "180",
    "props": [
      "高酒精",
      "可加冰",
      "西洋酒",
      "鸡尾酒",
      "古典",
      "苦"
    ]
  },
  {
    "name": "大吟酿",
    "price": "210",
    "props": [
      "中酒精",
      "可加冰",
      "清酒",
      "古典",
      "水果",
      "直饮",
      "甘"
    ]
  },
  {
    "name": "鬼杀",
    "price": "320",
    "props": [
      "高酒精",
      "可加冰",
      "烧酒",
      "古典",
      "辛"
    ]
  },
  {
    "name": "晓",
    "price": "400",
    "props": [
      "高酒精",
      "可加冰",
      "西洋酒",
      "直饮"
    ]
  },
  {
    "name": "火鼠裘",
    "price": "420",
    "props": [
      "高酒精",
      "可加热",
      "烧酒",
      "辛"
    ]
  },
  {
    "name": "十四夜",
    "price": "440",
    "props": [
      "中酒精",
      "可加冰",
      "可加热",
      "清酒",
      "古典",
      "甘"
    ]
  }
] 
