// 修改此处可永久修改工具的数据，请谨慎修改
export const rareList = [
  {
    "name": "莉格露",
    "distanceList": [
      "妖怪兽道"
    ],
    "money": [
      "200",
      "400"
    ],
    "favList": [
      "甜",
      "生",
      "肉",
      "猎奇"
    ],
    "drinkList": [
      "低酒精",
      "可加冰"
    ],
    "dissList": [
      "素",
      "清淡",
      "凉爽"
    ],
    "type": "rare"
  },
  {
    "name": "露米娅",
    "distanceList": [
      "妖怪兽道"
    ],
    "money": [
      "150",
      "350"
    ],
    "favList": [
      "猎奇",
      "生",
      "饱腹",
      "招牌",
      "肉",
      "流行·喜爱"
    ],
    "drinkList": [
      "苦",
      "气泡"
    ],
    "dissList": [
      "下酒",
      "昂贵",
      "流行·厌恶"
    ],
    "type": "rare"
  },
  {
    "name": "橙",
    "distanceList": [
      "妖怪兽道"
    ],
    "money": [
      "400",
      "600"
    ],
    "favList": [
      "肉",
      "水产",
      "烧烤",
      "甜",
      "重油",
      "流行·喜爱"
    ],
    "drinkList": [
      "水果",
      "辛"
    ],
    "dissList": [
      "素",
      "灼热",
      "猎奇",
      "流行·厌恶"
    ],
    "type": "rare"
  },
  {
    "name": "稗田阿求",
    "distanceList": [
      "人间之里"
    ],
    "money": [
      "500",
      "800"
    ],
    "favList": [
      "和风",
      "甜",
      "文化底蕴",
      "清淡",
      "高级",
      "汤羹",
      "流行·喜爱"
    ],
    "drinkList": [
      "可加热",
      "清酒"
    ],
    "dissList": [
      "咸",
      "灼热",
      "重油",
      "流行·厌恶"
    ],
    "type": "rare"
  },
  {
    "name": "上白泽慧音",
    "distanceList": [
      "人间之里"
    ],
    "money": [
      "400",
      "800"
    ],
    "favList": [
      "清淡",
      "素",
      "家常",
      "和风",
      "中华",
      "文化底蕴",
      "流行·喜爱"
    ],
    "drinkList": [
      "烧酒",
      "清酒",
      "利口酒"
    ],
    "dissList": [
      "重油",
      "大份",
      "咸",
      "流行·厌恶"
    ],
    "type": "rare"
  },
  {
    "name": "茨木华扇",
    "distanceList": [
      "人间之里"
    ],
    "money": [
      "400",
      "600"
    ],
    "favList": [
      "文化底蕴",
      "家常",
      "下酒",
      "和风"
    ],
    "drinkList": [
      "中酒精",
      "古典",
      "直饮"
    ],
    "dissList": [
      "实惠",
      "生",
      "辣"
    ],
    "type": "rare"
  },
  {
    "name": "博丽灵梦",
    "distanceList": [
      "博丽神社",
      "人间之里",
      "魔法森林"
    ],
    "money": [
      "150",
      "300"
    ],
    "favList": [
      "实惠",
      "饱腹",
      "甜",
      "不可思议",
      "高级",
      "流行·喜爱"
    ],
    "drinkList": [
      "无酒精",
      "可加热",
      "低酒精"
    ],
    "dissList": [
      "昂贵",
      "下酒",
      "流行·厌恶"
    ],
    "type": "rare"
  },
  {
    "name": "伊吹萃香",
    "distanceList": [
      "博丽神社",
      "妖怪之山"
    ],
    "money": [
      "600",
      "800"
    ],
    "favList": [
      "肉",
      "下酒",
      "力量涌现",
      "小巧",
      "和风",
      "流行·喜爱"
    ],
    "drinkList": [
      "高酒精",
      "直饮"
    ],
    "dissList": [
      "重油",
      "流行·厌恶"
    ],
    "type": "rare"
  },
  {
    "name": "比那名居天子",
    "distanceList": [
      "博丽神社",
      "妖怪之山"
    ],
    "money": [
      "2000",
      "3000"
    ],
    "favList": [
      "素",
      "清淡",
      "甜",
      "传说",
      "适合拍照",
      "果味",
      "昂贵",
      "流行·厌恶"
    ],
    "drinkList": [
      "鸡尾酒",
      "高酒精"
    ],
    "dissList": [
      "肉",
      "家常",
      "重油",
      "流行·喜爱"
    ],
    "type": "rare"
  },
  {
    "name": "红美铃",
    "distanceList": [
      "红魔馆"
    ],
    "money": [
      "200",
      "400"
    ],
    "favList": [
      "中华",
      "肉",
      "饱腹",
      "力量涌现",
      "流行·喜爱"
    ],
    "drinkList": [
      "提神",
      "可加热",
      "古典"
    ],
    "dissList": [
      "西式",
      "猎奇",
      "果味",
      "流行·厌恶"
    ],
    "type": "rare"
  },
  {
    "name": "琪露诺",
    "distanceList": [
      "红魔馆",
      "妖怪之山"
    ],
    "money": [
      "100",
      "200"
    ],
    "favList": [
      "凉爽",
      "甜",
      "适合拍照",
      "猎奇",
      "流行·厌恶"
    ],
    "drinkList": [
      "水果",
      "甘",
      "可加冰"
    ],
    "dissList": [
      "昂贵",
      "文化底蕴",
      "下酒",
      "流行·喜爱"
    ],
    "type": "rare"
  },
  {
    "name": "帕秋莉",
    "distanceList": [
      "红魔馆",
      "地灵殿"
    ],
    "money": [
      "600",
      "1000"
    ],
    "favList": [
      "适合拍照",
      "西式",
      "甜",
      "梦幻",
      "高级"
    ],
    "drinkList": [
      "利口酒",
      "鸡尾酒",
      "气泡"
    ],
    "dissList": [
      "生",
      "灼热",
      "猎奇",
      "咸"
    ],
    "type": "rare"
  },
  {
    "name": "藤原妹红",
    "distanceList": [
      "迷途竹林"
    ],
    "money": [
      "300",
      "600"
    ],
    "favList": [
      "果味",
      "燃起来了",
      "辣",
      "灼热"
    ],
    "drinkList": [
      "烧酒",
      "辛",
      "苦"
    ],
    "dissList": [
      "高级",
      "昂贵",
      "不可思议"
    ],
    "type": "rare"
  },
  {
    "name": "蓬莱山辉夜",
    "distanceList": [
      "迷途竹林"
    ],
    "money": [
      "1000",
      "1500"
    ],
    "favList": [
      "传说",
      "不可思议",
      "和风",
      "文化底蕴",
      "流行·喜爱"
    ],
    "drinkList": [
      "清酒",
      "现代",
      "古典"
    ],
    "dissList": [
      "招牌",
      "大份",
      "猎奇",
      "流行·厌恶"
    ],
    "type": "rare"
  },
  {
    "name": "因幡帝",
    "distanceList": [
      "迷途竹林"
    ],
    "money": [
      "200",
      "400"
    ],
    "favList": [
      "小巧",
      "甜",
      "传说",
      "凉爽",
      "梦幻",
      "流行·喜爱"
    ],
    "drinkList": [
      "甘",
      "无酒精",
      "水果"
    ],
    "dissList": [
      "山珍",
      "重油",
      "猎奇",
      "流行·厌恶"
    ],
    "type": "rare"
  },
  {
    "name": "雾雨魔理沙",
    "distanceList": [
      "任意地点"
    ],
    "money": [
      "3000",
      "5000"
    ],
    "favList": [
      "和风",
      "菌类",
      "传说",
      "灼热",
      "重油",
      "流行·喜爱"
    ],
    "drinkList": [
      "低酒精",
      "可加冰"
    ],
    "dissList": [
      "猎奇",
      "流行·厌恶"
    ],
    "type": "rare"
  },
  {
    "name": "矢田寺成美",
    "distanceList": [
      "魔法森林",
      "命莲寺"
    ],
    "money": [
      "300",
      "600"
    ],
    "favList": [
      "特产",
      "和风",
      "文化底蕴",
      "山珍",
      "清淡"
    ],
    "drinkList": [
      "直饮",
      "古典",
      "低酒精",
      "中酒精",
      "可加冰"
    ],
    "dissList": [
      "饱腹",
      "重油"
    ],
    "type": "rare"
  },
  {
    "name": "爱丽丝",
    "distanceList": [
      "魔法森林"
    ],
    "money": [
      "500",
      "800"
    ],
    "favList": [
      "家常",
      "高级",
      "文化底蕴",
      "甜",
      "西式"
    ],
    "drinkList": [
      "低酒精",
      "西洋酒",
      "现代"
    ],
    "dissList": [
      "肉",
      "饱腹",
      "重油",
      "猎奇"
    ],
    "type": "rare"
  },
  {
    "name": "东风谷早苗",
    "distanceList": [
      "妖怪之山",
      "魔法森林"
    ],
    "money": [
      "400",
      "600"
    ],
    "favList": [
      "和风",
      "梦幻",
      "适合拍照",
      "甜",
      "家常",
      "流行·喜爱"
    ],
    "drinkList": [
      "现代",
      "无酒精",
      "水果",
      "清酒",
      "直饮",
      "苦",
      "甘",
      "低酒精",
      "气泡"
    ],
    "dissList": [
      "猎奇",
      "生",
      "重油",
      "灼热"
    ],
    "type": "rare"
  },
  {
    "name": "犬走椛",
    "distanceList": [
      "妖怪之山"
    ],
    "money": [
      "300",
      "400"
    ],
    "favList": [
      "重油",
      "肉",
      "下酒",
      "山珍",
      "大份"
    ],
    "drinkList": [
      "中酒精",
      "高酒精",
      "直饮"
    ],
    "dissList": [
      "清淡",
      "猎奇",
      "素"
    ],
    "type": "rare"
  },
  {
    "name": "河城荷取",
    "distanceList": [
      "妖怪之山"
    ],
    "money": [
      "400",
      "500"
    ],
    "favList": [
      "高级",
      "下酒",
      "咸",
      "招牌",
      "水产",
      "猎奇"
    ],
    "drinkList": [
      "直饮",
      "高酒精",
      "中酒精",
      "清酒"
    ],
    "dissList": [
      "素",
      "文化底蕴",
      "山珍"
    ],
    "type": "rare"
  },
  {
    "name": "黑谷山女",
    "distanceList": [
      "旧地狱"
    ],
    "money": [
      "250",
      "400"
    ],
    "favList": [
      "猎奇",
      "甜",
      "适合拍照",
      "生",
      "鲜",
      "流行·喜爱"
    ],
    "drinkList": [
      "低酒精",
      "中酒精",
      "啤酒",
      "甘"
    ],
    "dissList": [
      "重油",
      "灼热",
      "咸"
    ],
    "type": "rare"
  },
  {
    "name": "水桥帕露西",
    "distanceList": [
      "旧地狱"
    ],
    "money": [
      "300",
      "400"
    ],
    "favList": [
      "咸",
      "鲜",
      "辣",
      "酸",
      "果味",
      "肉",
      "流行·厌恶"
    ],
    "drinkList": [
      "辛",
      "无酒精",
      "直饮",
      "苦",
      "可加热"
    ],
    "dissList": [
      "甜",
      "流行·喜爱"
    ],
    "type": "rare"
  },
  {
    "name": "星熊勇仪",
    "distanceList": [
      "旧地狱",
      "地灵殿"
    ],
    "money": [
      "600",
      "1000"
    ],
    "favList": [
      "招牌",
      "传说",
      "下酒",
      "燃起来了",
      "和风",
      "大份",
      "力量涌现"
    ],
    "drinkList": [
      "高酒精",
      "清酒",
      "古典",
      "啤酒"
    ],
    "dissList": [
      "素",
      "猎奇",
      "小巧"
    ],
    "type": "rare"
  },
  {
    "name": "古明地觉",
    "distanceList": [
      "地灵殿"
    ],
    "money": [
      "500",
      "600"
    ],
    "favList": [
      "小巧",
      "甜",
      "梦幻",
      "特产",
      "家常",
      "力量涌现"
    ],
    "drinkList": [
      "气泡",
      "提神",
      "苦",
      "无酒精"
    ],
    "dissList": [
      "肉",
      "山珍",
      "灼热",
      "猎奇",
      "大份"
    ],
    "type": "rare"
  },
  {
    "name": "火焰猫燐",
    "distanceList": [
      "地灵殿",
      "旧地狱"
    ],
    "money": [
      "500",
      "600"
    ],
    "favList": [
      "水产",
      "鲜",
      "甜",
      "梦幻",
      "海味",
      "猎奇",
      "流行·喜爱"
    ],
    "drinkList": [
      "清酒",
      "水果",
      "低酒精"
    ],
    "dissList": [
      "生",
      "灼热"
    ],
    "type": "rare"
  },
  {
    "name": "灵乌路空",
    "distanceList": [
      "地灵殿",
      "旧地狱"
    ],
    "money": [
      "500",
      "800"
    ],
    "favList": [
      "力量涌现",
      "重油",
      "咸",
      "肉",
      "辣",
      "灼热"
    ],
    "drinkList": [
      "中酒精",
      "可加热",
      "鸡尾酒"
    ],
    "dissList": [
      "菌类",
      "清淡"
    ],
    "type": "rare"
  },
  {
    "name": "多多良小伞",
    "distanceList": [
      "命莲寺"
    ],
    "money": [
      "150",
      "900"
    ],
    "favList": [
      "甜",
      "家常",
      "饱腹",
      "适合拍照",
      "力量涌现",
      "猎奇",
      "不可思议",
      "流行·喜爱"
    ],
    "drinkList": [
      "水果",
      "中酒精",
      "古典",
      "可加冰"
    ],
    "dissList": [
      "灼热",
      "汤羹",
      "辣"
    ],
    "type": "rare"
  },
  {
    "name": "村纱水蜜",
    "distanceList": [
      "命莲寺"
    ],
    "money": [
      "400",
      "600"
    ],
    "favList": [
      "咸",
      "特产",
      "力量涌现",
      "鲜",
      "肉",
      "高级",
      "饱腹"
    ],
    "drinkList": [
      "辛",
      "高酒精",
      "可加冰",
      "西洋酒"
    ],
    "dissList": [
      "素",
      "小巧",
      "猎奇",
      "酸"
    ],
    "type": "rare"
  },
  {
    "name": "封兽鵺",
    "distanceList": [
      "命莲寺"
    ],
    "money": [
      "300",
      "500"
    ],
    "favList": [
      "鲜",
      "不可思议",
      "特产",
      "生",
      "肉",
      "招牌",
      "适合拍照",
      "猎奇",
      "流行·厌恶"
    ],
    "drinkList": [
      "烧酒",
      "古典",
      "直饮",
      "可加热"
    ],
    "dissList": [
      "酸",
      "西式",
      "流行·喜爱"
    ],
    "type": "rare"
  },
  {
    "name": "物部布都",
    "distanceList": [
      "神灵庙"
    ],
    "money": [
      "600",
      "900"
    ],
    "favList": [
      "高级",
      "传说",
      "清淡",
      "燃起来了",
      "山珍",
      "和风",
      "流行·喜爱"
    ],
    "drinkList": [
      "可加热",
      "中酒精",
      "气泡",
      "直饮"
    ],
    "dissList": [
      "西式",
      "生",
      "流行·厌恶"
    ],
    "type": "rare"
  },
  {
    "name": "霍青娥",
    "distanceList": [
      "神灵庙"
    ],
    "money": [
      "400",
      "900"
    ],
    "favList": [
      "传说",
      "小巧",
      "甜",
      "特产",
      "素",
      "不可思议",
      "中华",
      "流行·喜爱"
    ],
    "drinkList": [
      "低酒精",
      "清酒",
      "水果",
      "现代"
    ],
    "dissList": [
      "饱腹",
      "重油"
    ],
    "type": "rare"
  },
  {
    "name": "苏我屠自古",
    "distanceList": [
      "神灵庙"
    ],
    "money": [
      "500",
      "600"
    ],
    "favList": [
      "饱腹",
      "家常",
      "重油",
      "烧烤",
      "力量涌现",
      "招牌",
      "和风"
    ],
    "drinkList": [
      "高酒精",
      "啤酒",
      "烧酒",
      "苦"
    ],
    "dissList": [
      "甜",
      "凉爽"
    ],
    "type": "rare"
  },
  {
    "name": "萌澄果",
    "money": [
      "1200",
      "1600"
    ],
    "favList": [
      "肉",
      "水产",
      "甜",
      "梦幻",
      "流行·喜爱"
    ],
    "dissList": [
      "猎奇",
      "灼热",
      "流行·厌恶"
    ],
    "drinkList": [
      "可加冰",
      "水果",
      "甘",
      "辛"
    ],
    "distanceList": [
      "妖怪兽道",
      "人间之里",
      "博丽神社",
      "红魔馆",
      "迷途竹林",
      "魔法森林",
      "妖怪之山"
    ],
    "type": "rare"
  },
  {
    "name": "蹦蹦跳跳的三妖精",
    "money": [
      "300",
      "400"
    ],
    "favList": [
      "家常",
      "小巧",
      "甜",
      "凉爽",
      "梦幻",
      "菌类",
      "流行·喜爱"
    ],
    "dissList": [
      "生",
      "猎奇",
      "灼热",
      "流行·厌恶"
    ],
    "drinkList": [
      "无酒精",
      "水果",
      "甘",
      "苦"
    ],
    "distanceList": [
      "妖怪兽道",
      "人间之里",
      "博丽神社",
      "红魔馆",
      "迷途竹林",
      "妖怪之山"
    ],
    "type": "rare"
  },
  {
    "name": "冴月麟",
    "money": [
      "400",
      "600"
    ],
    "favList": [
      "家常",
      "水产",
      "辣",
      "中华",
      "流行·喜爱"
    ],
    "dissList": [
      "下酒",
      "重油",
      "生",
      "流行·厌恶"
    ],
    "drinkList": [
      "无酒精",
      "气泡",
      "甘"
    ],
    "distanceList": [
      "妖怪兽道",
      "人间之里",
      "博丽神社",
      "红魔馆",
      "迷途竹林"
    ],
    "type": "rare"
  },
  {
    "name": "森近霖之助",
    "money": [
      "250",
      "400"
    ],
    "favList": [
      "家常",
      "饱腹",
      "鲜",
      "流行·喜爱"
    ],
    "dissList": [
      "下酒",
      "重油",
      "猎奇",
      "流行·厌恶"
    ],
    "drinkList": [
      "啤酒",
      "烧酒"
    ],
    "distanceList": [
      "人间之里"
    ],
    "type": "rare"
  },
  {
    "name": "立空汐",
    "money": [
      "500",
      "800"
    ],
    "favList": [
      "昂贵",
      "肉",
      "下酒",
      "山珍",
      "力量涌现",
      "和风",
      "流行·厌恶"
    ],
    "dissList": [
      "素",
      "清淡",
      "流行·喜爱"
    ],
    "drinkList": [
      "高酒精",
      "可加冰",
      "可加热"
    ],
    "distanceList": [
      "妖怪兽道",
      "博丽神社",
      "红魔馆",
      "迷途竹林",
      "妖怪之山"
    ],
    "type": "rare"
  },
  {
    "name": "时焉侑",
    "money": [
      "1300",
      "1800"
    ],
    "favList": [
      "下酒",
      "传说",
      "文化底蕴",
      "特产",
      "西式",
      "中华"
    ],
    "dissList": [
      "水产",
      "饱腹",
      "重油"
    ],
    "drinkList": [
      "中酒精",
      "可加冰",
      "西洋酒",
      "鸡尾酒"
    ],
    "distanceList": [
      "人间之里",
      "博丽神社"
    ],
    "type": "rare"
  },
  {
    "name": "蕾米莉亚",
    "money": [],
    "favList": [
      "高级",
      "甜",
      "生",
      "西式"
    ],
    "dissList": [],
    "drinkList": [
      "西洋酒",
      "古典",
      "水果",
      "甘"
    ],
    "distanceList": [
      "红魔馆"
    ],
    "type": "rare"
  },
  {
    "name": "魂魄妖梦",
    "money": [
      "300",
      "400"
    ],
    "favList": [
      "家常",
      "清淡",
      "鲜",
      "力量涌现"
    ],
    "dissList": [
      "重油",
      "猎奇"
    ],
    "drinkList": [
      "无酒精",
      "可加热",
      "水果"
    ],
    "distanceList": [
      "妖怪兽道",
      "人间之里",
      "博丽神社",
      "迷途竹林"
    ],
    "type": "rare"
  },
  {
    "name": "饕餮尤魔",
    "money": [
      "9999",
      "9999"
    ],
    "favList": [
      "肉",
      "饱腹",
      "大份",
      "高级",
      "传说",
      "鲜",
      "生",
      "不可思议",
      "力量涌现"
    ],
    "dissList": [],
    "drinkList": [
      "高酒精",
      "烧酒",
      "直饮",
      "辛"
    ],
    "distanceList": [
      "妖怪之山",
      "妖怪兽道",
      "博丽神社",
      "红魔馆",
      "迷途竹林",
      "魔法森林",
      "旧地狱",
      "地灵殿"
    ],
    "type": "rare"
  },
  {
    "name": "西行寺幽幽子",
    "money": [
      "1300",
      "1800"
    ],
    "favList": [
      "肉",
      "水产",
      "饱腹",
      "大份",
      "高级",
      "传说",
      "和风",
      "中华"
    ],
    "dissList": [
      "素",
      "清淡",
      "小巧"
    ],
    "drinkList": [
      "高酒精",
      "可加冰",
      "鸡尾酒"
    ],
    "distanceList": [
      "博丽神社",
      "红魔馆",
      "迷途竹林"
    ],
    "type": "rare"
  },
  {
    "name": "古明地恋",
    "money": [
      "800",
      "1200"
    ],
    "favList": [
      "甜",
      "咸",
      "生",
      "梦幻",
      "猎奇",
      "不可思议",
      "流行·厌恶"
    ],
    "dissList": [],
    "drinkList": [
      "高酒精",
      "烧酒",
      "气泡",
      "苦"
    ],
    "distanceList": [
      "地灵殿",
      "妖怪兽道",
      "人间之里",
      "博丽神社",
      "红魔馆",
      "迷途竹林",
      "魔法森林",
      "妖怪之山",
      "旧地狱"
    ],
    "type": "rare"
  }
]
export const normalList = [
  {
    "name": "妖怪兔",
    "distanceList": [
      "妖怪兽道",
      "红魔馆",
      "迷途竹林",
      "魔法森林",
      "妖怪之山",
      "地灵殿"
    ],
    "favList": [
      "招牌",
      "果味",
      "凉爽",
      "家常",
      "咸",
      "鲜",
      "甜",
      "力量涌现",
      "流行·喜爱"
    ],
    "drinkList": [
      "无酒精"
    ],
    "type": "normal"
  },
  {
    "name": "妖怪猫",
    "distanceList": [
      "妖怪兽道",
      "博丽神社",
      "红魔馆",
      "迷途竹林",
      "魔法森林",
      "妖怪之山",
      "地灵殿"
    ],
    "favList": [
      "招牌",
      "肉",
      "凉爽",
      "海味",
      "中华",
      "流行·喜爱"
    ],
    "drinkList": [
      "可加冰",
      "啤酒",
      "苦"
    ],
    "type": "normal"
  },
  {
    "name": "妖怪狸",
    "distanceList": [
      "妖怪兽道",
      "博丽神社",
      "红魔馆",
      "迷途竹林",
      "魔法森林",
      "妖怪之山",
      "命莲寺"
    ],
    "favList": [
      "招牌",
      "肉",
      "重油",
      "咸",
      "饱腹",
      "山珍",
      "流行·喜爱"
    ],
    "drinkList": [
      "甘",
      "辛"
    ],
    "type": "normal"
  },
  {
    "name": "妖怪狐",
    "distanceList": [
      "妖怪兽道",
      "红魔馆",
      "迷途竹林",
      "妖怪之山",
      "旧地狱"
    ],
    "favList": [
      "招牌",
      "肉",
      "和风",
      "中华",
      "小巧",
      "流行·喜爱"
    ],
    "drinkList": [
      "直饮"
    ],
    "type": "normal"
  },
  {
    "name": "蟒蛇精",
    "distanceList": [
      "妖怪兽道",
      "旧地狱",
      "妖怪之山"
    ],
    "favList": [
      "肉",
      "下酒",
      "山珍",
      "力量涌现",
      "流行·喜爱"
    ],
    "drinkList": [
      "烧酒",
      "清酒"
    ],
    "type": "normal"
  },
  {
    "name": "人类小孩",
    "distanceList": [
      "人间之里",
      "博丽神社",
      "命莲寺",
      "神灵庙"
    ],
    "favList": [
      "招牌",
      "肉",
      "家常",
      "饱腹",
      "中华",
      "咸",
      "甜",
      "凉爽",
      "流行·喜爱"
    ],
    "drinkList": [
      "无酒精"
    ],
    "type": "normal"
  },
  {
    "name": "人类男性",
    "distanceList": [
      "人间之里",
      "命莲寺",
      "神灵庙"
    ],
    "favList": [
      "肉",
      "下酒",
      "和风",
      "咸",
      "鲜",
      "灼热",
      "文化底蕴",
      "流行·喜爱"
    ],
    "drinkList": [
      "可加热",
      "烧酒"
    ],
    "type": "normal"
  },
  {
    "name": "人类女性",
    "distanceList": [
      "人间之里",
      "博丽神社"
    ],
    "favList": [
      "招牌",
      "水产",
      "高级",
      "咸",
      "鲜",
      "凉爽",
      "流行·喜爱"
    ],
    "drinkList": [
      "可加冰"
    ],
    "type": "normal"
  },
  {
    "name": "人类长者",
    "distanceList": [
      "人间之里",
      "博丽神社",
      "神灵庙"
    ],
    "favList": [
      "招牌",
      "高级",
      "适合拍照",
      "灼热",
      "流行·喜爱"
    ],
    "drinkList": [
      "低酒精"
    ],
    "type": "normal"
  },
  {
    "name": "左卫门",
    "distanceList": [
      "人间之里",
      "博丽神社"
    ],
    "favList": [
      "生",
      "猎奇",
      "力量涌现",
      "高级",
      "流行·喜爱"
    ],
    "drinkList": [
      "高酒精"
    ],
    "type": "normal"
  },
  {
    "name": "座敷童子",
    "distanceList": [
      "博丽神社"
    ],
    "favList": [
      "招牌",
      "凉爽",
      "和风",
      "山珍",
      "生",
      "甜",
      "流行·喜爱"
    ],
    "drinkList": [
      "无酒精",
      "低酒精"
    ],
    "type": "normal"
  },
  {
    "name": "河童",
    "distanceList": [
      "博丽神社",
      "红魔馆",
      "魔法森林",
      "妖怪之山"
    ],
    "favList": [
      "招牌",
      "大份",
      "高级",
      "小巧",
      "海味",
      "灼热",
      "猎奇",
      "流行·喜爱"
    ],
    "drinkList": [
      "甘"
    ],
    "type": "normal"
  },
  {
    "name": "地精",
    "distanceList": [
      "？？？？？"
    ],
    "favList": [
      "凉爽",
      "高级",
      "重油",
      "山珍",
      "灼热",
      "力量涌现",
      "流行·喜爱"
    ],
    "drinkList": [
      "清酒",
      "西洋酒"
    ],
    "type": "normal"
  },
  {
    "name": "鸦天狗",
    "distanceList": [
      "博丽神社",
      "红魔馆",
      "迷途竹林",
      "妖怪之山"
    ],
    "favList": [
      "招牌",
      "适合拍照",
      "菌类",
      "高级",
      "流行·喜爱"
    ],
    "drinkList": [
      "烧酒",
      "清酒"
    ],
    "type": "normal"
  },
  {
    "name": "妖精",
    "distanceList": [
      "红魔馆",
      "迷途竹林",
      "魔法森林"
    ],
    "favList": [
      "甜",
      "梦幻",
      "适合拍照",
      "果味",
      "特产",
      "菌类",
      "鲜",
      "流行·喜爱"
    ],
    "drinkList": [
      "气泡",
      "直饮",
      "水果",
      "甘"
    ],
    "type": "normal"
  },
  {
    "name": "白狼天狗",
    "distanceList": [
      "妖怪之山"
    ],
    "favList": [
      "肉",
      "重油",
      "饱腹",
      "山珍",
      "鲜",
      "生",
      "咸",
      "招牌",
      "特产",
      "流行·喜爱"
    ],
    "drinkList": [
      "中酒精",
      "高酒精",
      "烧酒",
      "清酒"
    ],
    "type": "normal"
  },
  {
    "name": "山姥",
    "distanceList": [
      "妖怪之山"
    ],
    "favList": [
      "肉",
      "家常",
      "高级",
      "饱腹",
      "鲜",
      "力量涌现",
      "猎奇",
      "流行·喜爱"
    ],
    "drinkList": [
      "高酒精",
      "直饮",
      "古典",
      "烧酒"
    ],
    "type": "normal"
  },
  {
    "name": "山童",
    "distanceList": [
      "妖怪之山"
    ],
    "favList": [
      "大份",
      "高级",
      "小巧",
      "山珍",
      "灼热",
      "猎奇",
      "招牌",
      "流行·喜爱"
    ],
    "drinkList": [
      "苦",
      "中酒精"
    ],
    "type": "normal"
  },
  {
    "name": "魔法使",
    "distanceList": [
      "魔法森林"
    ],
    "favList": [
      "素",
      "家常",
      "高级",
      "传说",
      "清淡",
      "西式",
      "鲜",
      "适合拍照",
      "凉爽",
      "流行·喜爱"
    ],
    "drinkList": [
      "可加热",
      "西洋酒",
      "鸡尾酒",
      "提神"
    ],
    "type": "normal"
  },
  {
    "name": "森之妖精",
    "distanceList": [
      "魔法森林"
    ],
    "favList": [
      "凉爽",
      "小巧",
      "甜",
      "梦幻",
      "招牌",
      "家常",
      "和风",
      "中华",
      "鲜",
      "招牌",
      "流行·喜爱"
    ],
    "drinkList": [
      "无酒精",
      "低酒精",
      "清酒",
      "甘",
      "水果"
    ],
    "type": "normal"
  },
  {
    "name": "迷之人形",
    "distanceList": [
      "魔法森林"
    ],
    "favList": [
      "家常",
      "咸",
      "生",
      "猎奇",
      "适合拍照",
      "菌类",
      "小巧",
      "梦幻",
      "流行·喜爱"
    ],
    "drinkList": [
      "气泡",
      "苦",
      "提神",
      "水果"
    ],
    "type": "normal"
  },
  {
    "name": "土蜘蛛",
    "distanceList": [
      "旧地狱"
    ],
    "favList": [
      "肉",
      "重油",
      "山珍",
      "饱腹",
      "鲜",
      "甜",
      "生",
      "大份",
      "猎奇",
      "流行·喜爱"
    ],
    "drinkList": [
      "中酒精",
      "可加冰",
      "利口酒",
      "直饮",
      "甘",
      "苦",
      "现代"
    ],
    "type": "normal"
  },
  {
    "name": "鬼",
    "distanceList": [
      "旧地狱"
    ],
    "favList": [
      "肉",
      "高级",
      "传说",
      "下酒",
      "鲜",
      "力量涌现",
      "燃起来了",
      "特产",
      "流行·喜爱"
    ],
    "drinkList": [
      "中酒精",
      "高酒精",
      "烧酒",
      "直饮"
    ],
    "type": "normal"
  },
  {
    "name": "骨女",
    "distanceList": [
      "旧地狱"
    ],
    "favList": [
      "素",
      "清淡",
      "生",
      "鲜",
      "凉爽",
      "猎奇",
      "菌类",
      "酸",
      "流行·喜爱"
    ],
    "drinkList": [
      "低酒精",
      "可加热",
      "啤酒",
      "水果",
      "苦"
    ],
    "type": "normal"
  },
  {
    "name": "地狱鸦",
    "distanceList": [
      "地灵殿"
    ],
    "favList": [
      "肉",
      "家常",
      "山珍",
      "海味",
      "咸",
      "酸",
      "小巧",
      "燃起来了",
      "流行·喜爱"
    ],
    "drinkList": [
      "中酒精",
      "可加热",
      "啤酒",
      "辛",
      "苦"
    ],
    "type": "normal"
  },
  {
    "name": "姑获鸟",
    "distanceList": [
      "地灵殿"
    ],
    "favList": [
      "水产",
      "家常",
      "清淡",
      "鲜",
      "酸",
      "猎奇",
      "文化底蕴",
      "流行·喜爱"
    ],
    "drinkList": [
      "低酒精",
      "烧酒",
      "苦",
      "可加热"
    ],
    "type": "normal"
  },
  {
    "name": "豹女",
    "distanceList": [
      "地灵殿"
    ],
    "favList": [
      "肉",
      "山珍",
      "海味",
      "重油",
      "高级",
      "生",
      "灼热",
      "特产",
      "流行·喜爱"
    ],
    "drinkList": [
      "中酒精",
      "高酒精",
      "直饮",
      "辛"
    ],
    "type": "normal"
  },
  {
    "name": "僧侣",
    "distanceList": [
      "命莲寺"
    ],
    "favList": [
      "肉",
      "家常",
      "下酒",
      "力量涌现",
      "山珍流行·喜爱"
    ],
    "drinkList": [
      "中酒精",
      "高酒精",
      "古典",
      "可加热",
      "烧酒"
    ],
    "type": "normal"
  },
  {
    "name": "妖怪鼠",
    "distanceList": [
      "命莲寺"
    ],
    "favList": [
      "大份",
      "果味",
      "家常",
      "高级",
      "梦幻",
      "流行·喜爱"
    ],
    "drinkList": [
      "鸡尾酒",
      "水果",
      "甘",
      "现代",
      "利口酒"
    ],
    "type": "normal"
  },
  {
    "name": "八尺大人",
    "distanceList": [
      "命莲寺"
    ],
    "favList": [
      "凉爽",
      "鲜",
      "西式",
      "和风",
      "适合拍照",
      "流行·喜爱"
    ],
    "drinkList": [
      "低酒精",
      "可加冰",
      "西洋酒",
      "利口酒",
      "鸡尾酒"
    ],
    "type": "normal"
  },
  {
    "name": "道士",
    "distanceList": [
      "神灵庙"
    ],
    "favList": [
      "山珍",
      "家常",
      "小巧",
      "清淡",
      "特产",
      "招牌",
      "流行·喜爱"
    ],
    "drinkList": [
      "低酒精",
      "现代",
      "提神",
      "苦"
    ],
    "type": "normal"
  },
  {
    "name": "僵尸",
    "distanceList": [
      "神灵庙"
    ],
    "favList": [
      "全部"
    ],
    "drinkList": [
      "全部"
    ],
    "type": "normal"
  },
  {
    "name": "仙人",
    "distanceList": [
      "神灵庙"
    ],
    "favList": [
      "小巧",
      "果味",
      "素",
      "清淡",
      "高级",
      "梦幻",
      "流行·喜爱"
    ],
    "drinkList": [
      "低酒精",
      "气泡",
      "甘",
      "水果",
      "清酒",
      "古典"
    ],
    "type": "normal"
  }
]
export const dishList = [
  {
    "name": "海鲜味噌汤",
    "cook": "煮锅",
    "price": "8",
    "useList": [
      "海苔"
    ],
    "props": [
      "实惠",
      "素",
      "家常",
      "汤羹"
    ],
    "invalidList": "重油",
    "time": "3.6",
    "unlock": "【初始】",
    "remark": "居酒屋常见的快手汤羹，来历不明却随处可见的海带在幻想乡出现之初，有人好奇水煮了一下，结果意外地发现有种异样的鲜味，从此便在幻想乡流行开了。"
  },
  {
    "name": "煮豆腐",
    "cook": "煮锅",
    "price": "22",
    "useList": [
      "豆腐"
    ],
    "props": [
      "素",
      "家常",
      "清淡"
    ],
    "invalidList": "4.2",
    "time": "【主等级】\n4级解锁",
    "unlock": "常见的家常菜，但也讲究烧制的火候，才能将豆腐的鲜嫩口感得到最大展现。"
  },
  {
    "name": "猪肉盖浇饭",
    "cook": "煮锅",
    "price": "20",
    "useList": [
      "猪肉"
    ],
    "props": [
      "肉",
      "家常",
      "饱腹"
    ],
    "invalidList": "4.2",
    "time": "【主等级】\n8级解锁",
    "unlock": "常见的家常菜，看上去颗颗饭粒饱满，淋上的香酱与猪肉的口感融为一体，令人口感倍增。"
  },
  {
    "name": "豚骨拉面",
    "cook": "煮锅",
    "price": "60",
    "useList": [
      "猪肉",
      "鸡蛋",
      "海苔"
    ],
    "props": [
      "肉",
      "家常",
      "饱腹",
      "咸"
    ],
    "invalidList": "4.8",
    "time": "【主等级】\n14级解锁",
    "unlock": "用猪肉和蔬菜经过长时间熬制出来的高汤，堪称整碗拉面的精髓和灵魂所在。香浓醇厚的豚骨汤底配上香弹可口的拉面，饱腹之余也让舌尖得到最大的满足。"
  },
  {
    "name": "力量汤",
    "cook": "煮锅",
    "price": "34",
    "useList": [
      "海苔",
      "野猪肉"
    ],
    "props": [
      "肉",
      "山珍",
      "灼热",
      "力量涌现",
      "汤羹"
    ],
    "invalidList": [
      "小巧",
      "凉爽"
    ],
    "time": "7.2",
    "unlock": "【羁绊】\n橙3级",
    "remark": "荤素搭配的美味汤羹，使用了野猪肉和海带㷛煮而成，能最快捷地补充身体所需能量。"
  },
  {
    "name": "豆腐味噌",
    "cook": "煮锅",
    "price": "21",
    "useList": [
      "豆腐"
    ],
    "props": [
      "素",
      "家常",
      "清淡",
      "和风",
      "汤羹"
    ],
    "invalidList": "重油",
    "time": "4.2",
    "unlock": "【羁绊】\n阿求1级",
    "remark": "居酒屋常见的快手汤羹，使用了豆腐来提鲜，最简单又最原始的美味。"
  },
  {
    "name": "豆腐锅",
    "cook": "煮锅",
    "price": "19",
    "useList": [
      "豆腐"
    ],
    "props": [
      "实惠",
      "素",
      "清淡",
      "和风",
      "灼热"
    ],
    "invalidList": "3",
    "time": "【羁绊】\n华扇1级",
    "unlock": "由豆腐炖煮而成的烩锅，滑嫩的口感再加上其本身具有的较高营养价值，使这道平价料理成为居酒屋最常见的烩锅。"
  },
  {
    "name": "牛肉盖浇饭",
    "cook": "煮锅",
    "price": "20",
    "useList": [
      "牛肉"
    ],
    "props": [
      "肉",
      "家常",
      "饱腹"
    ],
    "invalidList": "4.2",
    "time": "【羁绊】\n华扇2级",
    "unlock": "常见的家常菜，看上去颗颗饭粒饱满，淋上的香酱与牛肉的口感融为一体，令人口味倍增。"
  },
  {
    "name": "白雪",
    "cook": "煮锅",
    "price": "98",
    "useList": [
      "河豚",
      "八目鳗",
      "海苔"
    ],
    "props": [
      "昂贵",
      "肉",
      "水产",
      "高级",
      "和风",
      "文化底蕴"
    ],
    "invalidList": "7.2",
    "time": "【羁绊】\n慧音3级",
    "unlock": "使用鲜美的八目鳗与河豚，在佐以海胆炖煮而成的高级烩锅，由于煮的过程中会飘出纯白的泡沫而得名，是非常高级的家庭料理。"
  },
  {
    "name": "野味加农",
    "cook": "煮锅",
    "price": "66",
    "useList": [
      "土豆",
      "南瓜",
      "黑毛猪肉"
    ],
    "props": [
      "昂贵",
      "肉",
      "重油",
      "饱腹",
      "山珍",
      "灼热"
    ],
    "invalidList": "4.8",
    "time": "【羁绊】\n华扇3级",
    "unlock": "用农家蔬菜佐以优质黑毛猪肉炖煮的烩锅，口感饱满，香浓却不油腻，是农家人最高级的大菜。"
  },
  {
    "name": "桃花羹",
    "cook": "煮锅",
    "price": "55",
    "useList": [
      "桃子",
      "露水",
      "冰块"
    ],
    "props": [
      "素",
      "甜",
      "适合拍照",
      "凉爽",
      "果味",
      "汤羹"
    ],
    "invalidList": "4.2",
    "time": "【羁绊】\n天子2级",
    "unlock": "来自天上的配方，采摘新鲜的桃花，配以清晨的甘露水煮而成，不仅芳香清甜，而且具有祛病美容的神奇功效。"
  },
  {
    "name": "杂炊",
    "cook": "煮锅",
    "price": "40",
    "useList": [
      "海苔",
      "豆腐",
      "鳟鱼"
    ],
    "props": [
      "肉",
      "家常",
      "鲜",
      "灼热"
    ],
    "invalidList": "3",
    "time": "【羁绊】\n灵梦2级",
    "unlock": "使用一些边角料食材杂烩而成的烩锅，享受美味的同时还能避免浪费，可谓一举两得。"
  },
  {
    "name": "大奢宴",
    "cook": "煮锅",
    "price": "105",
    "useList": [
      "黑毛猪肉",
      "和牛",
      "河豚"
    ],
    "props": [
      "昂贵",
      "肉",
      "水产",
      "高级",
      "饱腹",
      "山珍"
    ],
    "invalidList": [
      "家常",
      "实惠"
    ],
    "time": "6",
    "unlock": "【羁绊】\n灵梦3级",
    "remark": "奢侈地选用了一系列高级食材炖煮成烩锅，通过火候的精妙控制，将食材之间的特点全部提炼了出来，肉质鲜嫩多汁，香滑入味，令人其味无穷。"
  },
  {
    "name": "白果萝卜排骨汤",
    "cook": "煮锅",
    "price": "65",
    "useList": [
      "白果",
      "猪肉",
      "萝卜"
    ],
    "props": [
      "昂贵",
      "肉",
      "中华",
      "灼热",
      "汤羹"
    ],
    "invalidList": "3.6",
    "time": "【羁绊】\n美铃2级",
    "unlock": "来自红美铃老家的㷛汤技巧，色香味俱全，益气补血。"
  },
  {
    "name": "真·海鲜味噌汤",
    "cook": "煮锅",
    "price": "55",
    "useList": [
      "三文鱼",
      "鳟鱼"
    ],
    "props": [
      "水产",
      "家常",
      "清淡",
      "汤羹"
    ],
    "invalidList": "4.8",
    "time": "【羁绊】\n琪露诺1级",
    "unlock": "选用新鲜鳟鱼与海带㷛煮而成的味增汤，浓浓的鲜味四处飘荡，鲜而不腥。"
  },
  {
    "name": "水煮鱼",
    "cook": "煮锅",
    "price": "68",
    "useList": [
      "鳟鱼",
      "辣椒"
    ],
    "props": [
      "昂贵",
      "水产",
      "中华",
      "灼热",
      "辣",
      "燃起来了"
    ],
    "invalidList": [
      "甜",
      "果味",
      "凉爽",
      "肉"
    ],
    "time": "4.8",
    "unlock": "【羁绊】\n妹红2级",
    "remark": "正宗的四川中华料理。鲜嫩肥美的鱼肉与犹如半天朱霞的辣椒一起翻滚，煮成了一道鱼香四溢，椒味袭人的绝味。"
  },
  {
    "name": "岩浆",
    "cook": "煮锅",
    "price": "125",
    "useList": [
      "和牛",
      "河豚",
      "松露",
      "牛肉"
    ],
    "props": [
      "昂贵",
      "肉",
      "水产",
      "高级",
      "饱腹",
      "灼热",
      "力量涌现",
      "菌类"
    ],
    "invalidList": "凉爽",
    "time": "4.8",
    "unlock": "【羁绊】\n妹红3级",
    "remark": "用高级牛肉和松露炖煮而成的烩锅，最初以麻辣为特色，因炖煮中冒出的气泡如岩浆而得名，款款而起的香味更是让人食指大动。改良后也增加了不辣的版本。"
  },
  {
    "name": "冷豆腐",
    "cook": "料理台",
    "price": "21",
    "useList": [
      "萝卜",
      "豆腐"
    ],
    "props": [
      "素",
      "家常",
      "清淡",
      "下酒",
      "小巧"
    ],
    "invalidList": "3",
    "time": "【初始】",
    "unlock": "夏天的消暑下酒菜，简单爽口。"
  },
  {
    "name": "饭团",
    "cook": "料理台",
    "price": "6",
    "useList": [
      "海苔"
    ],
    "props": [
      "实惠",
      "素",
      "家常",
      "饱腹",
      "和风"
    ],
    "invalidList": "3",
    "time": "【主等级】\n2级解锁",
    "unlock": "最普通的饭团，加点海带随便捏捏就可以了，超便捷的经典。"
  },
  {
    "name": "猩红恶魔蛋糕",
    "cook": "料理台",
    "price": "60",
    "useList": [
      "露水",
      "南瓜",
      "土豆",
      "蜂蜜"
    ],
    "props": [
      "西式",
      "甜",
      "适合拍照",
      "猎奇",
      "梦幻"
    ],
    "invalidList": "4.8",
    "time": "【商店】\n三妖精商店",
    "unlock": "以猩红恶魔1头上的帽子为原型制作的梦幻甜食，切开会有仿佛血液一般的甜美酱料流出，是「三妖精的蹦蹦跳跳讨伐大作战」世界传来的珍贵料理。"
  },
  {
    "name": "无意识妖怪慕斯",
    "cook": "料理台",
    "price": "60",
    "useList": [
      "豆腐",
      "蜂蜜",
      "洋葱",
      "黄油"
    ],
    "props": [
      "高级",
      "西式",
      "甜",
      "适合拍照",
      "梦幻"
    ],
    "invalidList": "4.8",
    "time": "【商店】\n三妖精商店",
    "unlock": "以无意识妖怪2的帽子为原型制作的深沉甜食，即使切开感受到的也是无尽的黑暗，但香醇程度令人流连忘返，是「三妖精的蹦蹦跳跳讨伐大作战」世界传来的珍贵料理。"
  },
  {
    "name": "秘制小鱼干",
    "cook": "料理台",
    "price": "30",
    "useList": [
      "鳟鱼"
    ],
    "props": [
      "水产",
      "咸",
      "鲜",
      "小巧"
    ],
    "invalidList": "4.8",
    "time": "【羁绊】\n橙1级",
    "unlock": "用秘制的香料将小鱼干腌制后晒干，酥脆想口的同时又易于保存，寻常人家都喜欢在家中保存一份。"
  },
  {
    "name": "蔬菜专辑",
    "cook": "料理台",
    "price": "56",
    "useList": [
      "土豆",
      "南瓜",
      "洋葱"
    ],
    "props": [
      "素",
      "清淡",
      "生",
      "凉爽"
    ],
    "invalidList": [
      "肉",
      "水产",
      "灼热"
    ],
    "time": "3",
    "unlock": "【羁绊】\n阿求2级",
    "remark": "用新鲜的蔬菜生拌而成的沙拉，口感清新，可以去除嘴里的油腻。不知为何被年轻的姑娘们奉为减肥圣餐。"
  },
  {
    "name": "炙猪肉饭团",
    "cook": "料理台",
    "price": "14",
    "useList": [
      "猪肉"
    ],
    "props": [
      "实惠",
      "肉",
      "家常",
      "饱腹",
      "和风"
    ],
    "invalidList": "3.6",
    "time": "【支线】\n人里：私塾盒饭供应解锁",
    "unlock": "常见的平价饭团，在饭团中放入烤制后的猪肉，为其增加了一份香浓的嚼劲。"
  },
  {
    "name": "樱落雪",
    "cook": "料理台",
    "price": "50",
    "useList": [
      "极上金枪鱼"
    ],
    "props": [
      "水产",
      "高级",
      "海味",
      "和风",
      "生",
      "适合拍照",
      "小巧"
    ],
    "invalidList": "重油",
    "time": "7.2",
    "unlock": "【羁绊】\n阿求3级",
    "remark": "高级寿司的一种，粉红色的高级生鱼片盖在白米饭上，就如樱花飘落在白雪上，有着不可思议的美感。"
  },
  {
    "name": "毛玉三色冰激凌",
    "cook": "料理台",
    "price": "75",
    "useList": [
      "露水",
      "蜂蜜",
      "豆腐",
      "鸡蛋"
    ],
    "props": [
      "昂贵",
      "西式",
      "甜",
      "适合拍照",
      "凉爽",
      "梦幻"
    ],
    "invalidList": "4.8",
    "time": "【商店】\n萌澄果商店，香霖堂",
    "unlock": "方形的三色毛玉冰淇淋，从颜色到口味上都非常惹人喜爱。去MC幻想乡旅游时，几乎是人手一份的招牌甜品。"
  },
  {
    "name": "毛玉熔岩豆腐",
    "cook": "料理台",
    "price": "85",
    "useList": [
      "豆腐",
      "牛肉",
      "洋葱",
      "辣椒"
    ],
    "props": [
      "昂贵",
      "素",
      "中华",
      "鲜",
      "适合拍照",
      "不可思议"
    ],
    "invalidList": "4.8",
    "time": "【商店】\n萌澄果商店，香霖堂",
    "unlock": "方形的火山毛玉造型，仿佛着了火的熔岩豆腐，是MC幻想乡非常著名的特色料理，受到喜欢舌苔刺激的人的追捧。"
  },
  {
    "name": "凉菜雕花",
    "cook": "料理台",
    "price": "20",
    "useList": [
      "萝卜"
    ],
    "props": [
      "素",
      "清淡",
      "适合拍照",
      "凉爽"
    ],
    "invalidList": [
      "肉",
      "灼热"
    ],
    "time": "3",
    "unlock": "【羁绊】\n天子1级",
    "remark": "将鲜果蔬菜雕刻成鲜花的模样，虽然材料简单，但却非常考验刀工。"
  },
  {
    "name": "温暖饭团",
    "cook": "料理台",
    "price": "30",
    "useList": [
      "洋葱",
      "鳟鱼"
    ],
    "props": [
      "水产",
      "素",
      "家常",
      "饱腹",
      "和风",
      "灼热"
    ],
    "invalidList": "4.8",
    "time": "【羁绊】\n灵梦1级",
    "unlock": "常见的平价饭团，内陷加入了鳟鱼和洋葱，融合了海鲜的细腻口感与洋葱的炽热，无论是营养还是口感都属上佳。"
  },
  {
    "name": "北极甜虾蜜桃色拉",
    "cook": "料理台",
    "price": "25",
    "useList": [
      "桃子",
      "虾",
      "冰块"
    ],
    "props": [
      "水产",
      "素",
      "清淡",
      "甜",
      "适合拍照",
      "不可思议",
      "果味"
    ],
    "invalidList": [
      "咸",
      "肉"
    ],
    "time": "6",
    "unlock": "【羁绊】\n天子3级",
    "remark": [
      "选用品质最好",
      "肉质最鲜的虾和桃子加工而成的高级料理，据说在外界只有在宴席上才有机会一见。"
    ]
  },
  {
    "name": "刺身拼盘",
    "cook": "料理台",
    "price": "88",
    "useList": [
      "三文鱼",
      "金枪鱼"
    ],
    "props": [
      "昂贵",
      "水产",
      "高级",
      "和风",
      "生",
      "适合拍照"
    ],
    "invalidList": "灼热",
    "time": "3",
    "unlock": "【羁绊】\n琪露诺2级",
    "remark": "作为和风料理的代表，将刺身级的三文鱼和金枪鱼鱼生配上芥末和酱油，引出鲜味的绝妙料理。"
  },
  {
    "name": "流水素面",
    "cook": "料理台",
    "price": "40",
    "useList": [
      "面粉",
      "竹子"
    ],
    "props": [
      "素",
      "清淡",
      "凉爽",
      "不可思议"
    ],
    "invalidList": "重油",
    "time": "4.2",
    "unlock": "【支线】\n竹林：料理上的一些疑惑",
    "remark": "比起好吃，流水素面更多的是好玩。"
  },
  {
    "name": "麻薯",
    "cook": "料理台",
    "price": "30",
    "useList": [
      "糯米"
    ],
    "props": [
      "和风",
      "甜",
      "小巧"
    ],
    "invalidList": [
      "肉",
      "水产",
      "咸",
      "鲜"
    ],
    "time": "4.2",
    "unlock": "【羁绊】\n帝1级",
    "remark": "最普通的糯米团子，大家都喜欢的和风甜食。"
  },
  {
    "name": "月之恋人",
    "cook": "料理台",
    "price": "66",
    "useList": [
      "黄油",
      "面粉",
      "鸡蛋",
      "月光草"
    ],
    "props": [
      "昂贵",
      "甜",
      "适合拍照",
      "小巧",
      "特产"
    ],
    "invalidList": [
      "肉",
      "水产",
      "素"
    ],
    "time": "6",
    "unlock": "【羁绊】\n辉夜2级",
    "remark": "外界似乎很流行使用□□恋人作为地区伴手礼，永远亭也不甘落后潮流，推出了自己的版本！"
  },
  {
    "name": "白桃生八桥",
    "cook": "料理台",
    "price": "55",
    "useList": [
      "糯米",
      "桃子"
    ],
    "props": [
      "和风",
      "甜",
      "果味"
    ],
    "invalidList": [
      "肉",
      "水产",
      "咸",
      "鲜"
    ],
    "time": "3",
    "unlock": "【羁绊】\n帝2级",
    "remark": "状似外界古筝的经典和果子，加入白桃内陷之后呈现淡粉色，非常诱人。"
  },
  {
    "name": "月光团子",
    "cook": "料理台",
    "price": "80",
    "useList": [
      "月光草",
      "糯米"
    ],
    "props": [
      "昂贵",
      "和风",
      "甜",
      "不可思议",
      "特产"
    ],
    "invalidList": [
      "肉",
      "鲜",
      "咸",
      "水产"
    ],
    "time": "4.8",
    "unlock": "【羁绊】\n帝3级",
    "remark": "永远亭特产改良的麻薯团子，加入了高级食材月光草，造型可爱的同时，还有“月光一样的口感”。"
  },
  {
    "name": "土豆可乐饼",
    "cook": "油锅",
    "price": "22",
    "useList": [
      "土豆"
    ],
    "props": [
      "素",
      "家常",
      "重油"
    ],
    "invalidList": "凉爽",
    "time": "3.6",
    "unlock": "【主等级】\n11级解锁",
    "remark": "主要由土豆制成的，外表酥脆内在绵软可口，在油炸类食品中有较高的人气。"
  },
  {
    "name": "香煎三文鱼",
    "cook": "油锅",
    "price": "58",
    "useList": [
      "三文鱼",
      "竹笋"
    ],
    "props": [
      "肉",
      "西式",
      "鲜"
    ],
    "invalidList": "6",
    "time": "【主等级】\n21级解锁",
    "unlock": "将整块带皮的三文鱼煎至外焦里嫩，配上鲜嫩的竹笋——不过外界这个菜谱一般是芦笋，这也算是幻想乡式的融合菜吧。"
  },
  {
    "name": "热松饼",
    "cook": "油锅",
    "price": "22",
    "useList": [
      "蜂蜜",
      "面粉",
      "鸡蛋"
    ],
    "props": [
      "饱腹",
      "西式",
      "甜"
    ],
    "invalidList": "5.4",
    "time": "【主等级】\n27级解锁",
    "unlock": "早餐的简单选择，将准备好的面糊煎熟，浇上蜂蜜就可以吃了。"
  },
  {
    "name": "竹笋炒肉",
    "cook": "油锅",
    "price": "25",
    "useList": [
      "竹笋",
      "猪肉"
    ],
    "props": [
      "肉",
      "家常",
      "下酒"
    ],
    "invalidList": "6",
    "time": "【主等级】\n33级解锁",
    "unlock": "最朴素的竹笋的吃法，由猪肉的油光引出的竹笋的鲜美。"
  },
  {
    "name": "臭豆腐",
    "cook": "油锅",
    "price": "24",
    "useList": [
      "豆腐",
      "辣椒"
    ],
    "props": [
      "素",
      "中华",
      "猎奇",
      "辣"
    ],
    "invalidList": [
      "甜",
      "果味"
    ],
    "time": "3",
    "unlock": "【羁绊】\n露米娅1级",
    "remark": "少见的黑色豆腐，散发着令人难以接近的味道——让人不禁怀疑：这真的可以吃吗？但是实际吃过的人表示根本停不下来。"
  },
  {
    "name": "炸八目鳗",
    "cook": "油锅",
    "price": "27",
    "useList": [
      "八目鳗"
    ],
    "props": [
      "水产",
      "重油",
      "招牌"
    ],
    "invalidList": "凉爽",
    "time": "4.2",
    "unlock": "【羁绊】\n露米娅2级",
    "remark": "本店招牌。长相怪异的八目鳗在喜欢尝鲜的幻想乡曾一度成为话题，油炸后爽滑酥嫩，深受大众喜爱。"
  },
  {
    "name": "香炸蝉蜕",
    "cook": "油锅",
    "price": "19",
    "useList": [
      "蝉蜕"
    ],
    "props": [
      "实惠",
      "重油",
      "猎奇"
    ],
    "invalidList": "4.8",
    "time": "【羁绊】\n莉格露2级",
    "unlock": "蝉科的昆虫黑蚱羽化后的蜕壳，可以入药，有利咽开音，明目退翳yì之效，香炸后口感酥脆，颇受欢迎。"
  },
  {
    "name": "油豆腐",
    "cook": "油锅",
    "price": "16",
    "useList": [
      "豆腐"
    ],
    "props": [
      "实惠",
      "素",
      "家常",
      "重油",
      "和风"
    ],
    "invalidList": "4.2",
    "time": "【羁绊】\n慧音1级",
    "unlock": "常见的家常菜，传说中是稻荷神的狐狸使者最喜欢的食物。"
  },
  {
    "name": "炸猪肉排",
    "cook": "油锅",
    "price": "25",
    "useList": [
      "猪肉"
    ],
    "props": [
      "肉",
      "家常",
      "重油",
      "饱腹"
    ],
    "invalidList": "4.2",
    "time": "【羁绊】\n萃香1级",
    "unlock": "常见的家常菜，以猪肉为主要材料，裹以面粉一炸，邻居家的孩子都馋哭了。"
  },
  {
    "name": "炒肉丝",
    "cook": "油锅",
    "price": "15",
    "useList": [
      "猪肉"
    ],
    "props": [
      "实惠",
      "肉",
      "家常",
      "重油",
      "下酒",
      "中华"
    ],
    "invalidList": "4.8",
    "time": "【支线】\n神社：力量涌现的食物解锁",
    "unlock": "以猪肉作为主要食材制作而成的家常菜，口味偏重。"
  },
  {
    "name": "红烧鳗鱼",
    "cook": "油锅",
    "price": "42",
    "useList": [
      "八目鳗",
      "洋葱"
    ],
    "props": [
      "水产",
      "素",
      "重油",
      "鲜",
      "招牌"
    ],
    "invalidList": "4.8",
    "time": "【羁绊】\n美铃1级",
    "unlock": "本店招牌。将鳗鱼用特殊酱料进行烧制后肉汁四溢，光闻着香味便让人垂涎不已。"
  },
  {
    "name": "黄油牛排",
    "cook": "油锅",
    "price": "60",
    "useList": [
      "和牛",
      "黄油"
    ],
    "props": [
      "肉",
      "重油",
      "饱腹",
      "西式"
    ],
    "invalidList": [
      "甜",
      "凉爽"
    ],
    "time": "4.2",
    "unlock": "【主线】\n红魔馆推进主线获得",
    "remark": "简单而复杂，根据火候和食材的选择，呈现出不同感觉到基础西餐。顺带一提红魔馆的那位指的应该还是蕾米莉亚·斯卡雷特喜欢的是三分熟。"
  },
  {
    "name": "班尼迪克蛋",
    "cook": "油锅",
    "price": "35",
    "useList": [
      "鸡蛋",
      "竹笋",
      "黄油"
    ],
    "props": [
      "饱腹",
      "西式",
      "生",
      "小巧"
    ],
    "invalidList": [
      "甜",
      "果味"
    ],
    "time": "4.2",
    "unlock": "【羁绊】\n帕秋莉1级",
    "remark": "流黄的水波蛋和大口的碳水，是早午餐的常见选择。"
  },
  {
    "name": "华光玉煎包",
    "cook": "油锅",
    "price": "128",
    "useList": [
      "蘑菇",
      "黑毛猪肉"
    ],
    "props": [
      "昂贵",
      "肉",
      "高级",
      "传说",
      "中华",
      "菌类",
      "梦幻"
    ],
    "invalidList": "4.8",
    "time": "【羁绊】\n美铃3级",
    "unlock": "散发着七彩的气场的高级生煎包。据说有些生煎原教旨主义者尖锐地反对加入猪肉以外食材的做法。"
  },
  {
    "name": "惠灵顿牛排",
    "cook": "油锅",
    "price": "150",
    "useList": [
      "和牛",
      "面粉",
      "鸡蛋",
      "黄油",
      "松露"
    ],
    "props": [
      "昂贵",
      "肉",
      "高级",
      "传说",
      "山珍",
      "西式"
    ],
    "invalidList": [
      "甜",
      "凉爽"
    ],
    "time": "8.4",
    "unlock": "【羁绊】\n帕秋莉3级",
    "remark": "将牛排和松露这两种鲜美的食材调味后包裹在酥皮中进行烘焙，让黄油酥皮的香味和牛排蘑菇的鲜美充分融合的极致菜肴。工序繁复，在外界是出了名的难做。"
  },
  {
    "name": "麻婆豆腐",
    "cook": "油锅",
    "price": "32",
    "useList": [
      "豆腐",
      "猪肉",
      "辣椒"
    ],
    "props": [
      "素",
      "中华",
      "灼热",
      "辣"
    ],
    "invalidList": [
      "甜",
      "果味",
      "凉爽"
    ],
    "time": "3.6",
    "unlock": "【羁绊】\n妹红1级",
    "remark": "在日本很有名的中华料理。使用独特的豆腐烹饪技巧烹制而成的辛辣料理，用它来拌饭吃可是会上瘾的哦～"
  },
  {
    "name": "司康饼",
    "cook": "蒸锅",
    "price": "8",
    "useList": [
      "黄油",
      "面粉"
    ],
    "props": [
      "实惠",
      "饱腹",
      "西式"
    ],
    "invalidList": "4.2",
    "time": "【主等级】\n18级解锁",
    "unlock": "英式下午茶的常客，外酥内软。一般蘸着果酱或者奶油一起吃。"
  },
  {
    "name": "奶油炖菜",
    "cook": "蒸锅",
    "price": "20",
    "useList": [
      "蘑菇",
      "洋葱",
      "黄油"
    ],
    "props": [
      "素",
      "西式",
      "菌类",
      "汤羹"
    ],
    "invalidList": "5.4",
    "time": "【主等级】\n24级解锁",
    "unlock": "制作家常奶油浓汤，制作方法简单，无论是蘸面包还是当做炖菜来吃都是非常不错的料理。"
  },
  {
    "name": "露水煮蛋",
    "cook": "蒸锅",
    "price": "18",
    "useList": [
      "露水",
      "鸡蛋"
    ],
    "props": [
      "实惠",
      "清淡",
      "生"
    ],
    "invalidList": [
      "肉",
      "水产",
      "重油"
    ],
    "time": "1.8",
    "unlock": "【羁绊】\n莉格露1级",
    "remark": "采集了清晨的露珠煮成的蛋，比一般的水煮蛋多出了一种甘甜的味道，为了保持鲜嫩只煮到半熟，蛋黄水嫩得似乎稍加晃动就会流出来。"
  },
  {
    "name": "幻昙花糕",
    "cook": "蒸锅",
    "price": "78",
    "useList": [
      "幻昙华",
      "露水"
    ],
    "props": [
      "昂贵",
      "高级",
      "传说",
      "甜",
      "适合拍照",
      "梦幻"
    ],
    "invalidList": [
      "肉",
      "水产"
    ],
    "time": "4.2",
    "unlock": "【羁绊】\n莉格露3级",
    "remark": "用上古时期便存在的奇迹之花制作的糕点，不仅甜而不腻，食后更是齿颊留香，据说能勾起人心中最想怀念的回忆。"
  },
  {
    "name": "诗礼银杏",
    "cook": "蒸锅",
    "price": "60",
    "useList": [
      "白果",
      "蜂蜜"
    ],
    "props": [
      "素",
      "中华",
      "甜",
      "文化底蕴"
    ],
    "invalidList": "咸",
    "time": "4.8",
    "unlock": "【羁绊】\n慧音2级",
    "remark": "以选用孔庙“诗礼堂”前银杏树所结果实烹制而得名，清香甜美，柔韧筋道，可解酒止咳。"
  },
  {
    "name": "赛熊掌",
    "cook": "蒸锅",
    "price": "70",
    "useList": [
      "黑毛猪肉",
      "河豚",
      "竹笋"
    ],
    "props": [
      "昂贵",
      "肉",
      "水产",
      "高级",
      "山珍",
      "鲜",
      "力量涌现",
      "不可思议"
    ],
    "invalidList": "7.2",
    "time": "【羁绊】\n露米娅3级",
    "unlock": "黑不溜秋的怪异美食之首！香飘万里，让人回味无穷。因为打不过熊，没法直接用熊掌做3，但是比真正的熊掌还要鲜美百倍。"
  },
  {
    "name": "意式烩饭",
    "cook": "蒸锅",
    "price": "70",
    "useList": [
      "洋葱",
      "竹笋",
      "蘑菇",
      "黄油"
    ],
    "props": [
      "昂贵",
      "饱腹",
      "西式",
      "鲜",
      "菌类"
    ],
    "invalidList": "甜",
    "time": "3.6",
    "unlock": "【羁绊】\n帕秋莉2级",
    "remark": "将食材炒熟之后倒入生米，充分混合米粒和食材香味的外界某个半岛的做法。"
  },
  {
    "name": "猪鹿蝶",
    "cook": "蒸锅",
    "price": "78",
    "useList": [
      "野猪肉",
      "鹿肉",
      "月光草"
    ],
    "props": [
      "昂贵",
      "肉",
      "高级",
      "文化底蕴"
    ],
    "invalidList": "4.8",
    "time": "【羁绊】\n琪露诺3级",
    "unlock": "脱胎于花礼的猪鹿蝶牌型，将猪肉和鹿肉清炖，佐以花朵引出食材本身鲜味的精致料理。"
  },
  {
    "name": "竹取姬",
    "cook": "蒸锅",
    "price": "65",
    "useList": [
      "竹子",
      "竹笋",
      "松露",
      "黑毛猪肉",
      "白果"
    ],
    "props": [
      "昂贵",
      "肉",
      "高级",
      "传说",
      "和风",
      "适合拍照",
      "文化底蕴",
      "特产"
    ],
    "invalidList": "7.2",
    "time": "【主线】\n竹林推进主线获得",
    "unlock": "在永远亭就地取材，使用新鲜的食材和米饭一起塞进竹筒中蒸熟。饭被竹子的清香充分浸润后，中和了山猪肉带来的油腻。"
  },
  {
    "name": "竹筒蒸蛋",
    "cook": "蒸锅",
    "price": "40",
    "useList": [
      "竹子",
      "鸡蛋",
      "海苔",
      "蘑菇"
    ],
    "props": [
      "家常",
      "清淡",
      "菌类"
    ],
    "invalidList": "3.6",
    "time": "【羁绊】\n辉夜1级",
    "unlock": "竹子作为容器蒸出来的茶碗蒸，别有一番风味。"
  },
  {
    "name": "烤八目鳗",
    "cook": "烤架",
    "price": "22",
    "useList": [
      "八目鳗"
    ],
    "props": [
      "水产",
      "招牌",
      "烧烤"
    ],
    "invalidList": [
      "肉",
      "素"
    ],
    "time": "4.2",
    "unlock": "【初始】",
    "remark": "本店招牌。为了打破红灯笼店就是烤鸟肉店的成见，特意选择了对夜盲症有奇效的八目鳗，据说在过去还被视作珍宝。"
  },
  {
    "name": "烤蘑菇",
    "cook": "烤架",
    "price": "18",
    "useList": [
      "蘑菇"
    ],
    "props": [
      "实惠",
      "素",
      "咸",
      "灼热",
      "菌类",
      "烧烤"
    ],
    "invalidList": "3.6",
    "time": "【支线】\n兽道：年纪大了解锁",
    "unlock": [
      "采用蘑菇为原料，经过腌渍",
      "裹粉",
      "油炸，虽然是素食，但味道和肉不相上下。"
    ]
  },
  {
    "name": "猪肉鳟鱼熏",
    "cook": "烤架",
    "price": "26",
    "useList": [
      "猪肉",
      "鳟鱼"
    ],
    "props": [
      "肉",
      "水产",
      "家常",
      "烧烤"
    ],
    "invalidList": "4.2",
    "time": "【羁绊】\n橙2级",
    "unlock": "把猪肉鳟鱼放在一起熏制而成，是简单好吃的肉食料理，也比较能保存。"
  },
  {
    "name": "能量串",
    "cook": "烤架",
    "price": "50",
    "useList": [
      "牛肉",
      "洋葱",
      "南瓜"
    ],
    "props": [
      "肉",
      "饱腹",
      "烧烤"
    ],
    "invalidList": "7.2",
    "time": "【羁绊】\n萃香2级",
    "unlock": [
      "牛肉搭配洋葱",
      "南瓜烤成的串串。巧妙地利用了洋葱的刺激与南瓜的甜味去除肉质的油腻，食之更加清爽。"
    ]
  },
  {
    "name": "二天一流",
    "cook": "烤架",
    "price": "90",
    "useList": [
      "黑毛猪肉",
      "野猪肉"
    ],
    "props": [
      "昂贵",
      "肉",
      "高级",
      "山珍",
      "文化底蕴",
      "烧烤",
      "燃起来了"
    ],
    "invalidList": "家常",
    "time": "10.8",
    "unlock": "【羁绊】\n萃香3级",
    "remark": "传说中与鬼立下赌约并获胜的人类剑士所创下的烤串流派，特别使用了野性十足的肉类烧制而成，食之有种冲天的气魄，让人惊叹不已。"
  },
  {
    "name": "蜜汁叉烧",
    "cook": "烤架",
    "price": "70",
    "useList": [
      "猪肉",
      "蜂蜜"
    ],
    "props": [
      "昂贵",
      "肉",
      "重油",
      "中华",
      "甜",
      "不可思议"
    ],
    "invalidList": "4.2",
    "time": "【支线】\n红魔馆：美铃的家乡菜解锁",
    "unlock": "来自红美铃老家的特殊做法，制作工序有点繁复，但是口感独一无二，令人难忘。"
  },
  {
    "name": "不死鸟",
    "cook": "烤架",
    "price": "65",
    "useList": [
      "面粉",
      "蜂蜜",
      "土豆",
      "萝卜",
      "洋葱"
    ],
    "props": [
      "昂贵",
      "高级",
      "传说",
      "西式",
      "适合拍照",
      "烧烤",
      "燃起来了"
    ],
    "invalidList": "7.2",
    "time": "【主线】\n竹林推进主线获得",
    "unlock": "用面粉烘焙出烤火鸡的形状，在表面刷上蜂蜜，肚子里塞满食材，进行充分的烘烤。出炉的假烤鸡有着香脆的外皮和多汁的肉馅。"
  },
  {
    "name": "蓬莱玉枝",
    "cook": "烤架",
    "price": "125",
    "useList": [
      "和牛",
      "三文鱼",
      "猪肉",
      "鹿肉",
      "竹子"
    ],
    "props": [
      "昂贵",
      "肉",
      "高级",
      "传说",
      "文化底蕴",
      "烧烤"
    ],
    "invalidList": "7.8",
    "time": "【羁绊】\n辉夜3级",
    "unlock": "简单地说就是使用竹签串起各种高级肉类，一口吃个饱的料理。但是在辉夜小姐的胁迫下，成为了高级的冠名料理。"
  },
  {
    "name": "水饺",
    "cook": "煮锅",
    "price": "30",
    "useList": [
      "面粉"
    ],
    "props": [
      "素",
      "家常",
      "中华",
      "文化底蕴"
    ],
    "invalidList": "3",
    "time": "2022元旦剧情",
    "unlock": "在海的另一边，红美铃小姐的家乡的著名的食谱，用面粉制作且来的筋道的面皮，在此之中将任意喜欢的食材往里面包入，再往沸腾的热的水那里放入且煮熟，就往超级美味的食物这个给成为了，只要将外表给看的话是朴素无华，内里把世间的宝藏给包着。"
  },
  {
    "name": "汤圆",
    "cook": "煮锅",
    "price": "30",
    "useList": [
      "糯米"
    ],
    "props": [
      "素",
      "家常",
      "中华",
      "文化底蕴"
    ],
    "invalidList": "3",
    "time": "2022元旦剧情",
    "unlock": "在海的另一边，红美铃小姐的家乡的著名的食谱，用糯米揉且成的小的团，在此之中将甜的食材给包入，再往沸腾的热的水那里放入且煮熟，就往超级甜又可口的小吃成为，只要将外表给看的话是朴素无华，内里把世间的甜蜜给包着。"
  },
  {
    "name": "蘑菇肉片",
    "cook": "油锅",
    "price": "20",
    "useList": [
      "蘑菇",
      "猪肉"
    ],
    "props": [
      "肉",
      "家常",
      "重油",
      "菌类"
    ],
    "invalidList": "3.6",
    "time": "【DLC1】【羁绊】魔理沙1级",
    "unlock": "蘑菇和肉给切片之后，往锅的里面混入且一起炒，非常基本的家庭料理的一个"
  },
  {
    "name": "大阪烧",
    "cook": "油锅",
    "price": "24",
    "useList": [
      "面粉",
      "鸡蛋",
      "萝卜"
    ],
    "props": [
      "和风",
      "招牌",
      "适合拍照",
      "小巧"
    ],
    "invalidList": "3.6",
    "time": "【DLC1】【羁绊】早苗1级",
    "unlock": "听说的为根据，面糊和各种各样的食材给使用且混合之后在铁板烧制而成的，又脆又香又丰富，万变和平价的特征为因被所有人喜欢涨了。\n"
  }
]
export const wineList = [
  {
    "name": "绿茶",
    "price": "1",
    "props": [
      "无酒精"
    ],
    "unlock": "【初始】",
    "remark": "最普通的饮料，给一滴酒都不能沾的弱小妖怪准备的。"
  },
  {
    "name": "水獭祭",
    "price": "130",
    "props": [
      "中酒精",
      "可加冰",
      "可加热",
      "清酒",
      "直饮"
    ],
    "unlock": "【妖怪兽道】\n采集",
    "remark": "鬼杰组的战利品之一，因为水獭灵把敌组的战利品摆在地上的样子仿佛祭典，于是随便取的名字。实际上好像是相当高级的纯米大吟酿。"
  },
  {
    "name": "雀酒",
    "price": "50",
    "props": [
      "中酒精",
      "可加冰",
      "可加热",
      "清酒",
      "辛"
    ],
    "unlock": "【妖怪兽道】\n采集",
    "remark": "传说中由麻雀酿的酒。将米粒藏入截断的竹中，当竹中有水时，日经月累便成佳酿。据说喝了此酒会舞无休止，是带着“诅咒”的美味呢。"
  },
  {
    "name": "果味High Ball",
    "price": "12",
    "props": [
      "低酒精",
      "可加冰",
      "西洋酒",
      "鸡尾酒",
      "水果",
      "甘",
      "苦"
    ],
    "unlock": "【妖怪兽道】\n购买",
    "remark": "居酒屋常见的，使用威士忌和果汁，苏打勾兑的简单调酒，降低了酒精度之后成为了谁都可以享受的饮料。"
  },
  {
    "name": "果味SOUR",
    "price": "12",
    "props": [
      "低酒精",
      "可加冰",
      "烧酒",
      "鸡尾酒",
      "水果",
      "甘",
      "苦"
    ],
    "unlock": "【妖怪兽道】\n购买",
    "remark": "居酒屋常见的，使用烧酒和果汁，苏打勾兑的简单调酒，比起HighBall更加有日式风格。"
  },
  {
    "name": "淇",
    "price": "18",
    "props": [
      "低酒精",
      "可加冰",
      "清酒",
      "鸡尾酒",
      "气泡",
      "甘",
      "辛",
      "苦"
    ],
    "unlock": "【妖怪兽道/人间之里】\n购买",
    "remark": "在加入了大量的苏打后，这种起泡清酒酸甜的口感，以及较低的酒精度，使其很受女性的欢迎；可以说是清酒的香槟版本。"
  },
  {
    "name": "梅酒",
    "price": "32",
    "props": [
      "中酒精",
      "可加冰",
      "可加热",
      "利口酒",
      "水果"
    ],
    "unlock": "【人间之里】\n购买",
    "remark": "人间之里的人类自酿的梅子酒，因为喝起来很甜，所以经常有不了解的生物被它的后劲儿击倒。"
  },
  {
    "name": "超ZUN啤酒",
    "price": "18",
    "props": [
      "低酒精",
      "可加冰",
      "啤酒",
      "苦"
    ],
    "unlock": "【人间之里】\n购买",
    "remark": "某位和幻想乡很有渊源的大人物作为副业的产品，虽然是出于兴趣而研制的啤酒，但意外地十分有人气。"
  },
  {
    "name": "日月星",
    "price": "34",
    "props": [
      "中酒精",
      "可加冰",
      "可加热",
      "清酒",
      "直饮"
    ],
    "unlock": "【人间之里】\n购买",
    "remark": "纯米酒，有着妖精的祝福。度数不高，口感柔顺，价格平易近人，是居酒屋受欢迎的选择。"
  },
  {
    "name": "牛奶",
    "price": "16",
    "props": [
      "无酒精",
      "直饮"
    ],
    "unlock": "【人间之里】\n购买",
    "remark": "温润纯白的饮品，无论小孩还是大人都适合饮用，好处多到说不完。"
  },
  {
    "name": "红柚果汁",
    "price": "24",
    "props": [
      "无酒精",
      "水果"
    ],
    "unlock": "【人间之里】\n购买",
    "remark": "据说是来自外界的人气饮料，用红色柚子这种水果榨汁，尤其是盛夏饮用，健康祛暑，让人回甘无穷。"
  },
  {
    "name": "波子汽水",
    "price": "30",
    "props": [
      "无酒精",
      "气泡",
      "现代"
    ],
    "unlock": "【人间之里】\n购买",
    "remark": "瓶口有弹珠的设计，只要向下按压将弹珠打入汽水内，引起二氧化碳的剧烈反应。此时将瓶中沸腾又冰冷的气泡一饮而尽的话，你会在胃中感受到整个夏天。"
  },
  {
    "name": "风祝",
    "price": "130",
    "props": [
      "中酒精",
      "可加冰",
      "鸡尾酒",
      "现代",
      "甘"
    ],
    "unlock": "【博丽神社】\n祈愿",
    "remark": "轻松愉快的餐后酒，薄荷和奶油为主的口感。比起酒精饮料更像甜品。\n\"好像是守矢的巫女从外面带过来的配方，堂而皇之地冠了自己的名字!说起来那家伙在外界能喝酒吗?啊，这玩意儿也完全不像酒就是了，怪不得她会喜欢，啧。“\n——不愿透露姓名的巫女"
  },
  {
    "name": "天狗踊",
    "price": "70",
    "props": [
      "高酒精",
      "可加冰",
      "可加热",
      "清酒",
      "直饮"
    ],
    "unlock": "【博丽神社】\n购买",
    "remark": "传说连天狗喝了也会开心地跳舞的美味清酒，在妖怪之山开一次店就可以验证了吧。不同于其他无色的清酒，带有淡淡的琥珀色。"
  },
  {
    "name": "神之麦",
    "price": "45",
    "props": [
      "中酒精",
      "可加冰",
      "可加热",
      "烧酒",
      "直饮"
    ],
    "unlock": "【博丽神社】\n购买",
    "remark": "使用妖怪之山上被秋天的神明们所庇佑的大麦所酿造的大麦烧酒。"
  },
  {
    "name": "猩红恶魔",
    "price": "45",
    "props": [
      "低酒精",
      "可加冰",
      "鸡尾酒"
    ],
    "unlock": "【博丽神社】\n购买",
    "remark": [
      "由伏特加",
      "番茄汁",
      "柠檬片",
      "芹菜根混合调制，甜",
      "酸",
      "苦",
      "辣四味俱全。因血红的颜色让人联想到某洋馆的吸血鬼，故得此名。"
    ]
  },
  {
    "name": "晓",
    "price": "400",
    "props": [
      "高酒精",
      "可加冰",
      "西洋酒",
      "直饮"
    ],
    "unlock": "【博丽神社】\n购买",
    "remark": "针对幻想乡居民口味改良的威士忌，在保留威士忌独有的气味的同时也有着顺滑的口感。"
  },
  {
    "name": "阿芙加朵",
    "price": "35",
    "props": [
      "无酒精",
      "可加冰",
      "提神",
      "甘",
      "苦"
    ],
    "unlock": "【红魔馆】\n购买",
    "remark": "将冰淇淋融化在咖啡中的做法，对于怕苦又需要咖啡提神的人来说是再好不过的饮料。\n\"我只是需要提神，并不是怕苦。\"\n——帕秋莉"
  },
  {
    "name": "红魔馆红茶",
    "price": "25",
    "props": [
      "无酒精",
      "可加热",
      "提神",
      "水果"
    ],
    "unlock": "【红魔馆】\n购买",
    "remark": "使用柠檬，佛手柑，和女仆长精心挑选的红茶品种烘焙出带有独特香味的红茶饮料，为了扩张红魔馆的威严，非常普通地以红魔馆命名。"
  },
  {
    "name": "红雾",
    "price": "75",
    "props": [
      "中酒精",
      "可加热",
      "西洋酒"
    ],
    "unlock": "【红魔馆】\n购买",
    "remark": "洋馆的女仆特制的红葡萄酒，酒体丰满，因为好像不是正常的时间下酿造出来的，总有一种雾气般的朦胧感。"
  },
  {
    "name": "尼格罗尼",
    "price": "100",
    "props": [
      "中酒精",
      "可加冰",
      "西洋酒",
      "鸡尾酒",
      "水果",
      "苦"
    ],
    "unlock": "【红魔馆】\n购买",
    "remark": "微苦的橙味为主，香气扑鼻，入口柔顺。最近非常流行。\n\"听说现世很流行，大小姐派我去学，结果受不了苦味让我加大橙子和味美思的剂量，最后完全变成橙汁糖浆了…\"\n——不愿透露姓名的女仆长"
  },
  {
    "name": "教父",
    "price": "180",
    "props": [
      "高酒精",
      "可加冰",
      "西洋酒",
      "鸡尾酒",
      "古典",
      "苦"
    ],
    "unlock": "【红魔馆】\n购买",
    "remark": "浓烈的北方威士忌和杏仁利口酒混合，非常古典的调酒。口感也相当硬汉，普通的妖怪应付不来。\n\"大小姐听说凶猛的妖怪喜欢喝这种，派我去学，喝完都快哭出了还要强作威严地说好喝.\"\n——不愿透露姓名的女仆长"
  },
  {
    "name": "月面火箭",
    "price": "45",
    "props": [
      "无酒精",
      "可加冰",
      "现代",
      "气泡"
    ],
    "unlock": "【迷途竹林】\n采集",
    "remark": "使用月之都先进技术制作的高级气泡水，迸发的口感有如火箭一般，只需要加一片柠檬就是完美的饮品。"
  },
  {
    "name": "十四夜",
    "price": "440",
    "props": [
      "中酒精",
      "可加冰",
      "可加热",
      "清酒",
      "古典",
      "甘"
    ],
    "unlock": "【迷途竹林】\n购买",
    "remark": "比起十五夜的月亮是满月，也许更想留下十四夜时期待的心情。以这样的感觉酿造的高级清酒，也许只有它才配得上迷途竹林所见到的月亮吧。"
  },
  {
    "name": "冬酿",
    "price": "60",
    "props": [
      "低酒精",
      "可加冰",
      "可加热",
      "古典",
      "甘"
    ],
    "unlock": "【迷途竹林】\n购买",
    "remark": "来自某个古国的习俗，在冬至日酿造的酒，色泽金黄，清甜甘冽，加上桂花的香气，无论冰着喝还是热着喝都非常可口。"
  },
  {
    "name": "玉露茶",
    "price": "50",
    "props": [
      "无酒精",
      "可加热",
      "古典"
    ],
    "unlock": "【其它】4",
    "remark": "几乎是日本茶中最高级的茶叶，需要用较低的水温来冲泡，甘醇飘香，口感独特。"
  },
  {
    "name": "火鼠裘",
    "price": "420",
    "props": [
      "高酒精",
      "可加热",
      "烧酒",
      "辛"
    ],
    "unlock": "【其它】",
    "remark": "如果不使用火鼠裘来承装也许就会烧起来的烈酒，几乎无人能承受其辣度的超级辣口烈酒。"
  },
  {
    "name": "冰山毛玉冻柠",
    "price": "45",
    "props": [
      "无酒精",
      "可加冰",
      "气泡",
      "提神",
      "水果",
      "直饮",
      "甘"
    ],
    "unlock": "【其它】",
    "remark": "仿佛是融化在可口的冰沙中的毛玉，佐以冻柠口味，在炎热的夏季，不知拯救了多少人命，去MC幻想乡旅游过的客人这样评价:没喝过冰山毛玉冻柠，MC幻想乡等于白去。"
  },
  {
    "name": "“大冰棍儿！”",
    "price": "35",
    "props": [
      "无酒精",
      "提神",
      "现代",
      "甘"
    ],
    "unlock": "【联动】5\n【妖怪兽道】\n购买",
    "remark": [
      "简单又富有重量感的大冰块，有梦幻的甜蜜和薄荷的调味，夏天解暑",
      "让所有人满血复活神奇冰品！是「三妖精的蹦蹦跳跳讨伐大作」战世界传来的珍贵饮品。"
    ]
  },
  {
    "name": "大吟酿",
    "price": "210",
    "props": [
      "中酒精",
      "清酒",
      "古典",
      "可加冰",
      "水果",
      "直饮",
      "甘"
    ],
    "unlock": "【妖怪之山(DLC1)】\n购买",
    "remark": "最高级的清酒，口感极佳而且有水果的香味。必须避光，在太阳的照射下颜色会迅速变深。"
  },
  {
    "name": "咖啡(DLC1)",
    "price": "62",
    "props": [
      "无酒精",
      "苦",
      "现代",
      "可加热",
      "可加冰",
      "提神"
    ],
    "unlock": "【魔法森林】\n购买",
    "remark": "用现代磨制工艺将稀少的咖啡豆磨成粉末制成的饮品，能够奇妙的提升精神和集中力，是脑力劳动者不可或缺的神奇饮料。"
  },
  {
    "name": "古法奶油冰沙(DLC1)",
    "price": "42",
    "props": [
      "无酒精",
      "甘",
      "可加冰",
      "古典"
    ],
    "unlock": "【妖怪之山】\n购买",
    "remark": [
      "河童们窖藏的天然冰块，和牛乳",
      "糖等配料一起在铁通里打碎，加速搅拌得到的产物，是古法制造的冰激凌。虽然现世已经不再用这种传统方法制作，但在幻想乡作为特色依旧很受欢迎。"
    ]
  },
  {
    "name": "妖精雨露(DLC1)",
    "price": "80",
    "props": [
      "无酒精",
      "甘",
      "可加冰"
    ],
    "unlock": "【魔法森林】\n购买",
    "remark": [
      "妖精们采集露水",
      "和花蜜混合的甘甜饮料。由于妖精们会忘记自己的劳动产品，所以常被动物或者人类采走。传说可以治愈百病甚至起死回生，但似乎是谣言。"
    ]
  },
  {
    "name": "普通健身茶(DLC1)",
    "price": "210",
    "props": [
      "中酒精",
      "苦",
      "气泡",
      "利口酒"
    ],
    "unlock": "【魔法森林】\n购买",
    "remark": "魔女研制的药茶，据说瘦身功效拔群。标签上写着“喝掉我”，虽然有点可疑但它神奇的丰富味道着实令人惊叹。"
  },
  {
    "name": "鬼杀(DLC2)",
    "price": "320",
    "props": [
      "高酒精",
      "可加冰",
      "烧酒",
      "辛",
      "古典"
    ],
    "unlock": "【旧地狱】\n购买",
    "remark": "传说一杯就能让酒量无底洞一般的贵族醉生梦死的传说之酒......但我见到的是......鬼明明都当作凉白开来喝的？！传说一点都不靠谱啊。"
  },
  {
    "name": "气保健(DLC2)",
    "price": "45",
    "props": [
      "无酒精",
      "甘",
      "直饮",
      "提神"
    ],
    "unlock": "【地灵殿】\n购买",
    "remark": [
      "河童贩卖的外面世界某种提神功能性饮料的山寨品，据说提取了主要成分",
      "换个名字谁都可以制作......但这样真的没问题吗？"
    ]
  },
  {
    "name": "古明地冰激凌(DLC2)",
    "price": "35",
    "props": [
      "无酒精",
      "甘",
      "水果",
      "现代"
    ],
    "unlock": "【地灵殿】\n购买",
    "remark": "地灵殿的限定纪念甜品！以地灵殿的觉妖怪姐妹为原型设计的可爱甜筒，在地底妖怪中有很大的人气。"
  },
  {
    "name": "杨枝甘露(DLC3)",
    "price": "50",
    "props": [
      "无酒精",
      "可加冰",
      "水果"
    ],
    "unlock": "【命莲寺】\n购买",
    "remark": "命莲寺特产。传说观音菩萨右手持杨枝，左手持盛有甘露的净瓶，用杨柳枝洒下甘露会带来好运。许多慕名而来的信徒都会饮上一杯。"
  },
  {
    "name": "麒麟(DLC3)",
    "price": "180",
    "props": [
      "啤酒",
      "中酒精",
      "直饮"
    ],
    "unlock": "【道场】\n购买",
    "remark": "道士们采用外界的技术，只提取第一道麦汁酿造的啤酒，因此没有一般啤酒的涩味，口感更纯更顺。\n"
  }
]
