// 修改此处可永久修改工具的数据，请谨慎修改
export const rareList = [
  {
    "name": "莉格露",
    "distanceList": [
      "妖怪兽道",
      "魔法森林",
      "太阳花田"
    ],
    "money": "200－400",
    "favList": [
      "肉",
      "甜",
      "生",
      "猎奇"
    ],
    "drinkList": [
      "低酒精",
      "可加冰"
    ],
    "dissList": [
      "素",
      "清淡",
      "凉爽"
    ],
    "type": "rare"
  },
  {
    "name": "橙",
    "distanceList": [
      "妖怪兽道"
    ],
    "money": "400－600",
    "favList": [
      "肉",
      "水产",
      "重油",
      "甜",
      "烧烤",
      "流行·喜爱"
    ],
    "drinkList": [
      "水果",
      "辛"
    ],
    "dissList": [
      "素",
      "猎奇",
      "灼热",
      "流行·厌恶"
    ],
    "type": "rare"
  },
  {
    "name": "露米娅",
    "distanceList": [
      "妖怪兽道",
      "魔法森林"
    ],
    "money": "150－350",
    "favList": [
      "招牌",
      "肉",
      "饱腹",
      "生",
      "猎奇",
      "流行·喜爱"
    ],
    "drinkList": [
      "气泡",
      "苦"
    ],
    "dissList": [
      "昂贵",
      "下酒",
      "流行·厌恶"
    ],
    "type": "rare"
  },
  {
    "name": "稗田阿求",
    "distanceList": [
      "人间之里",
      "命莲寺"
    ],
    "money": "500－800",
    "favList": [
      "清淡",
      "高级",
      "甜",
      "文化底蕴",
      "汤羹",
      "和风",
      "流行·喜爱"
    ],
    "drinkList": [
      "可加热",
      "清酒"
    ],
    "dissList": [
      "重油",
      "咸",
      "灼热",
      "流行·厌恶"
    ],
    "type": "rare"
  },
  {
    "name": "茨木华扇",
    "distanceList": [
      "人间之里",
      "旧地狱",
      "神灵庙"
    ],
    "money": "400－600",
    "favList": [
      "家常",
      "下酒",
      "文化底蕴",
      "和风"
    ],
    "drinkList": [
      "中酒精",
      "古典",
      "直饮"
    ],
    "dissList": [
      "实惠",
      "辣",
      "生"
    ],
    "type": "rare"
  },
  {
    "name": "上白泽慧音",
    "distanceList": [
      "人间之里",
      "魔法森林",
      "命莲寺"
    ],
    "money": "400－800",
    "favList": [
      "家常",
      "素",
      "清淡",
      "文化底蕴",
      "和风",
      "中华",
      "流行·喜爱"
    ],
    "drinkList": [
      "清酒",
      "烧酒",
      "利口酒"
    ],
    "dissList": [
      "重油",
      "大份",
      "咸",
      "流行·厌恶"
    ],
    "type": "rare"
  },
  {
    "name": "森近霖之助",
    "distanceList": [
      "人间之里",
      "太阳花田"
    ],
    "money": "250－400",
    "favList": [
      "家常",
      "饱腹",
      "鲜",
      "流行·喜爱"
    ],
    "drinkList": [
      "啤酒",
      "烧酒"
    ],
    "dissList": [
      "下酒",
      "重油",
      "猎奇",
      "流行·厌恶"
    ],
    "type": "rare"
  },
  {
    "name": "伊吹萃香",
    "distanceList": [
      "博丽神社",
      "妖怪之山",
      "辉针城"
    ],
    "money": "600－800",
    "favList": [
      "肉",
      "下酒",
      "小巧",
      "力量涌现",
      "和风",
      "流行·喜爱"
    ],
    "drinkList": [
      "高酒精",
      "直饮"
    ],
    "dissList": [
      "重油",
      "流行·厌恶"
    ],
    "type": "rare"
  },
  {
    "name": "比那名居天子",
    "distanceList": [
      "博丽神社",
      "妖怪之山",
      "旧地狱",
      "神灵庙",
      "太阳花田"
    ],
    "money": "2000－3000",
    "favList": [
      "昂贵",
      "素",
      "清淡",
      "传说",
      "甜",
      "果味",
      "适合拍照",
      "流行·厌恶"
    ],
    "drinkList": [
      "高酒精",
      "鸡尾酒"
    ],
    "dissList": [
      "家常",
      "肉",
      "重油",
      "流行·喜爱"
    ],
    "type": "rare"
  },
  {
    "name": "博丽灵梦",
    "distanceList": [
      "博丽神社",
      "妖怪兽道",
      "人间之里",
      "魔法森林",
      "妖怪之山"
    ],
    "money": "150－300",
    "favList": [
      "实惠",
      "饱腹",
      "高级",
      "甜",
      "不可思议",
      "流行·喜爱"
    ],
    "drinkList": [
      "无酒精",
      "低酒精",
      "可加热"
    ],
    "dissList": [
      "昂贵",
      "下酒",
      "流行·厌恶"
    ],
    "type": "rare"
  },
  {
    "name": "琪露诺",
    "distanceList": [
      "红魔馆",
      "妖怪之山"
    ],
    "money": "100－200",
    "favList": [
      "甜",
      "凉爽",
      "猎奇",
      "适合拍照",
      "流行·厌恶"
    ],
    "drinkList": [
      "可加冰",
      "水果",
      "甘"
    ],
    "dissList": [
      "昂贵",
      "下酒",
      "文化底蕴",
      "流行·喜爱"
    ],
    "type": "rare"
  },
  {
    "name": "红美铃",
    "distanceList": [
      "红魔馆"
    ],
    "money": "200－400",
    "favList": [
      "肉",
      "饱腹",
      "力量涌现",
      "中华",
      "流行·喜爱"
    ],
    "drinkList": [
      "可加热",
      "古典",
      "提神"
    ],
    "dissList": [
      "果味",
      "猎奇",
      "西式",
      "流行·厌恶"
    ],
    "type": "rare"
  },
  {
    "name": "帕秋莉",
    "distanceList": [
      "红魔馆",
      "魔法森林",
      "地灵殿"
    ],
    "money": "600－1000",
    "favList": [
      "高级",
      "甜",
      "梦幻",
      "适合拍照",
      "西式"
    ],
    "drinkList": [
      "利口酒",
      "鸡尾酒",
      "气泡"
    ],
    "dissList": [
      "咸",
      "生",
      "猎奇",
      "灼热"
    ],
    "type": "rare"
  },
  {
    "name": "藤原妹红",
    "distanceList": [
      "迷途竹林",
      "妖怪兽道"
    ],
    "money": "300－600",
    "favList": [
      "辣",
      "果味",
      "灼热",
      "燃起来了",
      "烧烤"
    ],
    "drinkList": [
      "烧酒",
      "苦",
      "辛"
    ],
    "dissList": [
      "昂贵",
      "高级",
      "不可思议"
    ],
    "type": "rare"
  },
  {
    "name": "因幡帝",
    "distanceList": [
      "迷途竹林"
    ],
    "money": "200－400",
    "favList": [
      "小巧",
      "传说",
      "甜",
      "凉爽",
      "梦幻",
      "流行·喜爱"
    ],
    "drinkList": [
      "无酒精",
      "水果",
      "甘"
    ],
    "dissList": [
      "重油",
      "山珍",
      "猎奇",
      "流行·厌恶"
    ],
    "type": "rare"
  },
  {
    "name": "蓬莱山辉夜",
    "distanceList": [
      "迷途竹林",
      "辉针城"
    ],
    "money": "1000－1500",
    "favList": [
      "传说",
      "不可思议",
      "文化底蕴",
      "和风",
      "流行·喜爱"
    ],
    "drinkList": [
      "清酒",
      "古典",
      "现代"
    ],
    "dissList": [
      "招牌",
      "大份",
      "猎奇",
      "流行·厌恶"
    ],
    "type": "rare"
  },
  {
    "name": "魂魄妖梦",
    "distanceList": [
      "妖怪兽道",
      "人间之里",
      "博丽神社",
      "迷途竹林"
    ],
    "money": "300－400",
    "favList": [
      "家常",
      "清淡",
      "鲜",
      "力量涌现"
    ],
    "drinkList": [
      "无酒精",
      "可加热",
      "水果"
    ],
    "dissList": [
      "重油",
      "猎奇",
      "咸"
    ],
    "type": "rare"
  },
  {
    "name": "西行寺幽幽子",
    "distanceList": [
      "博丽神社",
      "红魔馆",
      "迷途竹林",
      "神灵庙"
    ],
    "money": "1500－2000",
    "favList": [
      "肉",
      "水产",
      "饱腹",
      "大份",
      "高级",
      "传说",
      "和风",
      "中华"
    ],
    "drinkList": [
      "高酒精",
      "可加冰",
      "鸡尾酒"
    ],
    "dissList": [
      "素",
      "清淡",
      "小巧"
    ],
    "type": "rare"
  },
  {
    "name": "冴月麟",
    "distanceList": [
      "妖怪兽道",
      "人间之里",
      "博丽神社",
      "红魔馆",
      "迷途竹林"
    ],
    "money": "400－600",
    "favList": [
      "家常",
      "水产",
      "辣",
      "中华",
      "流行·喜爱"
    ],
    "drinkList": [
      "无酒精",
      "气泡",
      "甘"
    ],
    "dissList": [
      "下酒",
      "重油",
      "生"
    ],
    "type": "rare"
  },
  {
    "name": "立空汐",
    "distanceList": [
      "妖怪兽道",
      "博丽神社",
      "红魔馆",
      "迷途竹林",
      "妖怪之山"
    ],
    "money": "500－800",
    "favList": [
      "昂贵",
      "肉",
      "下酒",
      "山珍",
      "力量涌现",
      "和风",
      "流行·厌恶"
    ],
    "drinkList": [
      "高酒精",
      "可加冰",
      "可加热"
    ],
    "dissList": [
      "素",
      "清淡",
      "流行·喜爱"
    ],
    "type": "rare"
  },
  {
    "name": "时焉侑",
    "distanceList": [
      "人间之里",
      "博丽神社"
    ],
    "money": "1300－1800",
    "favList": [
      "下酒",
      "传说",
      "文化底蕴",
      "特产",
      "西式",
      "中华"
    ],
    "drinkList": [
      "中酒精",
      "可加冰",
      "西洋酒",
      "鸡尾酒"
    ],
    "dissList": [
      "水产",
      "饱腹",
      "重油"
    ],
    "type": "rare"
  },
  {
    "name": "蹦蹦跳跳的三妖精",
    "distanceList": [
      "妖怪兽道",
      "人间之里",
      "博丽神社",
      "红魔馆",
      "迷途竹林",
      "妖怪之山"
    ],
    "money": "300－400",
    "favList": [
      "家常",
      "小巧",
      "甜",
      "凉爽",
      "梦幻",
      "菌类",
      "流行·喜爱"
    ],
    "drinkList": [
      "无酒精",
      "水果",
      "甘",
      "苦"
    ],
    "dissList": [
      "生",
      "猎奇",
      "灼热",
      "流行·厌恶"
    ],
    "type": "rare"
  },
  {
    "name": "萌澄果",
    "distanceList": [
      "妖怪兽道",
      "人间之里",
      "博丽神社",
      "红魔馆",
      "迷途竹林",
      "魔法森林",
      "妖怪之山",
      "命莲寺",
      "神灵庙",
      "太阳花田",
      "辉针城"
    ],
    "money": "1200－1600",
    "favList": [
      "肉",
      "水产",
      "甜",
      "梦幻",
      "流行·喜爱"
    ],
    "drinkList": [
      "可加冰",
      "水果",
      "甘",
      "辛"
    ],
    "dissList": [
      "猎奇",
      "灼热",
      "流行·厌恶"
    ],
    "type": "rare"
  },
  {
    "name": "雾雨魔理沙",
    "distanceList": [
      "魔法森林",
      "妖怪兽道",
      "人间之里",
      "博丽神社",
      "红魔馆",
      "迷途竹林",
      "妖怪之山",
      "旧地狱",
      "地灵殿",
      "命莲寺",
      "神灵庙",
      "太阳花田",
      "辉针城"
    ],
    "money": "3000－5000",
    "favList": [
      "重油",
      "传说",
      "灼热",
      "菌类",
      "和风",
      "流行·喜爱"
    ],
    "drinkList": [
      "低酒精",
      "可加冰"
    ],
    "dissList": [
      "猎奇",
      "流行·厌恶"
    ],
    "type": "rare"
  },
  {
    "name": "爱丽丝",
    "distanceList": [
      "魔法森林",
      "太阳花田"
    ],
    "money": "500－800",
    "favList": [
      "家常",
      "高级",
      "甜",
      "文化底蕴",
      "西式"
    ],
    "drinkList": [
      "低酒精",
      "西洋酒",
      "现代"
    ],
    "dissList": [
      "肉",
      "饱腹",
      "重油",
      "猎奇"
    ],
    "type": "rare"
  },
  {
    "name": "矢田寺成美",
    "distanceList": [
      "魔法森林",
      "命莲寺"
    ],
    "money": "300－600",
    "favList": [
      "清淡",
      "山珍",
      "文化底蕴",
      "特产",
      "和风"
    ],
    "drinkList": [
      "低酒精",
      "中酒精",
      "可加冰",
      "古典",
      "直饮"
    ],
    "dissList": [
      "饱腹",
      "重油"
    ],
    "type": "rare"
  },
  {
    "name": "犬走椛",
    "distanceList": [
      "妖怪之山"
    ],
    "money": "300－400",
    "favList": [
      "肉",
      "下酒",
      "重油",
      "大份",
      "山珍"
    ],
    "drinkList": [
      "中酒精",
      "高酒精",
      "直饮"
    ],
    "dissList": [
      "素",
      "清淡",
      "猎奇"
    ],
    "type": "rare"
  },
  {
    "name": "河城荷取",
    "distanceList": [
      "妖怪之山"
    ],
    "money": "400－500",
    "favList": [
      "招牌",
      "水产",
      "下酒",
      "高级",
      "咸",
      "猎奇"
    ],
    "drinkList": [
      "中酒精",
      "高酒精",
      "清酒",
      "直饮"
    ],
    "dissList": [
      "素",
      "山珍",
      "文化底蕴"
    ],
    "type": "rare"
  },
  {
    "name": "东风谷早苗",
    "distanceList": [
      "妖怪之山",
      "魔法森林",
      "命莲寺",
      "神灵庙"
    ],
    "money": "400－600",
    "favList": [
      "家常",
      "甜",
      "梦幻",
      "适合拍照",
      "和风",
      "流行·喜爱"
    ],
    "drinkList": [
      "无酒精",
      "低酒精",
      "清酒",
      "现代",
      "气泡",
      "水果",
      "直饮",
      "甘",
      "苦"
    ],
    "dissList": [
      "重油",
      "生",
      "猎奇",
      "灼热"
    ],
    "type": "rare"
  },
  {
    "name": "黑谷山女",
    "distanceList": [
      "旧地狱",
      "妖怪兽道",
      "红魔馆",
      "魔法森林",
      "妖怪之山"
    ],
    "money": "250－400",
    "favList": [
      "甜",
      "鲜",
      "生",
      "猎奇",
      "适合拍照",
      "流行·喜爱"
    ],
    "drinkList": [
      "低酒精",
      "中酒精",
      "啤酒",
      "甘"
    ],
    "dissList": [
      "重油",
      "咸",
      "灼热"
    ],
    "type": "rare"
  },
  {
    "name": "水桥帕露西",
    "distanceList": [
      "旧地狱"
    ],
    "money": "300－400",
    "favList": [
      "肉",
      "酸",
      "辣",
      "咸",
      "鲜",
      "果味",
      "流行·厌恶"
    ],
    "drinkList": [
      "无酒精",
      "可加热",
      "直饮",
      "苦",
      "辛"
    ],
    "dissList": [
      "甜",
      "流行·喜爱"
    ],
    "type": "rare"
  },
  {
    "name": "星熊勇仪",
    "distanceList": [
      "旧地狱",
      "博丽神社",
      "妖怪之山",
      "地灵殿"
    ],
    "money": "600－1000",
    "favList": [
      "招牌",
      "下酒",
      "大份",
      "传说",
      "力量涌现",
      "燃起来了",
      "和风",
      "流行·喜爱"
    ],
    "drinkList": [
      "高酒精",
      "啤酒",
      "清酒",
      "古典"
    ],
    "dissList": [
      "素",
      "小巧",
      "猎奇"
    ],
    "type": "rare"
  },
  {
    "name": "火焰猫燐",
    "distanceList": [
      "地灵殿",
      "人间之里",
      "博丽神社",
      "妖怪之山",
      "旧地狱",
      "命莲寺",
      "神灵庙"
    ],
    "money": "500－700",
    "favList": [
      "水产",
      "甜",
      "鲜",
      "海味",
      "梦幻",
      "猎奇",
      "流行·喜爱"
    ],
    "drinkList": [
      "低酒精",
      "清酒",
      "水果"
    ],
    "dissList": [
      "生",
      "灼热"
    ],
    "type": "rare"
  },
  {
    "name": "古明地觉",
    "distanceList": [
      "地灵殿",
      "人间之里",
      "博丽神社",
      "红魔馆",
      "迷途竹林",
      "魔法森林"
    ],
    "money": "500－600",
    "favList": [
      "家常",
      "小巧",
      "甜",
      "梦幻",
      "力量涌现",
      "特产"
    ],
    "drinkList": [
      "无酒精",
      "气泡",
      "提神",
      "苦"
    ],
    "dissList": [
      "肉",
      "大份",
      "山珍",
      "猎奇",
      "灼热"
    ],
    "type": "rare"
  },
  {
    "name": "灵乌路空",
    "distanceList": [
      "地灵殿",
      "妖怪之山"
    ],
    "money": "500－800",
    "favList": [
      "肉",
      "重油",
      "辣",
      "咸",
      "灼热",
      "力量涌现"
    ],
    "drinkList": [
      "中酒精",
      "可加热",
      "鸡尾酒"
    ],
    "dissList": [
      "清淡",
      "菌类"
    ],
    "type": "rare"
  },
  {
    "name": "多多良小伞",
    "distanceList": [
      "命莲寺",
      "辉针城"
    ],
    "money": "150－300",
    "favList": [
      "家常",
      "饱腹",
      "甜",
      "猎奇",
      "不可思议",
      "力量涌现",
      "适合拍照",
      "流行·喜爱"
    ],
    "drinkList": [
      "中酒精",
      "可加冰",
      "古典",
      "水果"
    ],
    "dissList": [
      "辣",
      "灼热",
      "汤羹"
    ],
    "type": "rare"
  },
  {
    "name": "封兽鵺",
    "distanceList": [
      "命莲寺",
      "辉针城"
    ],
    "money": "300－500",
    "favList": [
      "招牌",
      "肉",
      "鲜",
      "生",
      "猎奇",
      "不可思议",
      "适合拍照",
      "特产",
      "流行·厌恶"
    ],
    "drinkList": [
      "可加热",
      "烧酒",
      "古典",
      "直饮"
    ],
    "dissList": [
      "酸",
      "西式",
      "流行·喜爱"
    ],
    "type": "rare"
  },
  {
    "name": "村纱水蜜",
    "distanceList": [
      "命莲寺"
    ],
    "money": "400－600",
    "favList": [
      "肉",
      "饱腹",
      "高级",
      "咸",
      "鲜",
      "力量涌现",
      "特产"
    ],
    "drinkList": [
      "高酒精",
      "可加冰",
      "西洋酒",
      "辛"
    ],
    "dissList": [
      "素",
      "小巧",
      "酸",
      "猎奇"
    ],
    "type": "rare"
  },
  {
    "name": "苏我屠自古",
    "distanceList": [
      "神灵庙"
    ],
    "money": "500－600",
    "favList": [
      "招牌",
      "家常",
      "饱腹",
      "重油",
      "力量涌现",
      "烧烤",
      "和风"
    ],
    "drinkList": [
      "高酒精",
      "啤酒",
      "烧酒",
      "苦"
    ],
    "dissList": [
      "甜",
      "凉爽"
    ],
    "type": "rare"
  },
  {
    "name": "物部布都",
    "distanceList": [
      "神灵庙"
    ],
    "money": "600－900",
    "favList": [
      "清淡",
      "高级",
      "传说",
      "山珍",
      "燃起来了",
      "和风",
      "流行·喜爱"
    ],
    "drinkList": [
      "中酒精",
      "可加热",
      "气泡",
      "直饮"
    ],
    "dissList": [
      "生",
      "西式",
      "流行·厌恶"
    ],
    "type": "rare"
  },
  {
    "name": "霍青娥",
    "distanceList": [
      "神灵庙"
    ],
    "money": "400－900",
    "favList": [
      "素",
      "小巧",
      "传说",
      "甜",
      "不可思议",
      "特产",
      "中华",
      "流行·喜爱"
    ],
    "drinkList": [
      "低酒精",
      "清酒",
      "现代",
      "水果"
    ],
    "dissList": [
      "饱腹",
      "重油"
    ],
    "type": "rare"
  },
  {
    "name": "二岩猯藏",
    "distanceList": [
      "妖怪兽道",
      "人间之里",
      "博丽神社",
      "命莲寺",
      "神灵庙"
    ],
    "money": "1000－1200",
    "favList": [
      "家常",
      "肉",
      "水产",
      "下酒",
      "传说",
      "果味",
      "和风",
      "流行·喜爱"
    ],
    "drinkList": [
      "高酒精",
      "可加热",
      "烧酒",
      "古典"
    ],
    "dissList": [
      "辣",
      "灼热"
    ],
    "type": "rare"
  },
  {
    "name": "梅蒂欣",
    "distanceList": [
      "太阳花田"
    ],
    "money": "200－400",
    "favList": [
      "招牌",
      "小巧",
      "甜",
      "毒",
      "凉爽",
      "梦幻",
      "适合拍照",
      "菌类"
    ],
    "drinkList": [
      "无酒精",
      "水果",
      "甘",
      "苦"
    ],
    "dissList": "文化底蕴",
    "type": "rare"
  },
  {
    "name": "射命丸文",
    "distanceList": [
      "太阳花田",
      "妖怪兽道",
      "人间之里",
      "博丽神社",
      "红魔馆",
      "迷途竹林",
      "魔法森林",
      "妖怪之山",
      "旧地狱",
      "地灵殿",
      "命莲寺",
      "神灵庙",
      "辉针城"
    ],
    "money": "500－600",
    "favList": [
      "招牌",
      "家常",
      "肉",
      "下酒",
      "适合拍照",
      "和风",
      "流行·喜爱"
    ],
    "drinkList": [
      "高酒精",
      "可加冰",
      "烧酒",
      "提神"
    ],
    "dissList": [
      "西式",
      "流行·厌恶"
    ],
    "type": "rare"
  },
  {
    "name": "风见幽香",
    "distanceList": [
      "太阳花田"
    ],
    "money": "1200－1800",
    "favList": [
      "清淡",
      "高级",
      "传说",
      "梦幻",
      "不可思议",
      "特产",
      "西式",
      "流行·喜爱"
    ],
    "drinkList": [
      "利口酒",
      "西洋酒",
      "鸡尾酒",
      "现代"
    ],
    "dissList": [
      "饱腹",
      "咸",
      "灼热",
      "和风"
    ],
    "type": "rare"
  },
  {
    "name": "少名针妙丸",
    "distanceList": [
      "辉针城"
    ],
    "money": "600－1200",
    "favList": [
      "小巧",
      "传说",
      "甜",
      "燃起来了",
      "适合拍照",
      "文化底蕴",
      "和风",
      "流行·喜爱"
    ],
    "drinkList": [
      "低酒精",
      "可加热",
      "古典",
      "气泡"
    ],
    "dissList": [
      "大份",
      "西式"
    ],
    "type": "rare"
  },
  {
    "name": "今泉影狼",
    "distanceList": [
      "辉针城",
      "迷途竹林"
    ],
    "money": "300－600",
    "favList": [
      "家常",
      "肉",
      "山珍",
      "凉爽",
      "适合拍照",
      "和风",
      "流行·喜爱"
    ],
    "drinkList": [
      "中酒精",
      "可加冰",
      "清酒",
      "直饮"
    ],
    "dissList": "灼热",
    "type": "rare"
  },
  {
    "name": "鬼人正邪",
    "distanceList": [
      "辉针城"
    ],
    "money": "300－600",
    "favList": [
      "下酒",
      "重油",
      "猎奇",
      "灼热",
      "不可思议",
      "力量涌现",
      "燃起来了",
      "流行·厌恶"
    ],
    "drinkList": [
      "中酒精",
      "烧酒",
      "直饮",
      "辛"
    ],
    "dissList": [
      "高级",
      "流行·喜爱"
    ],
    "type": "rare"
  },
  {
    "name": "蕾米莉亚",
    "distanceList": [
      "博丽神社",
      "红魔馆"
    ],
    "money": "4950－5000",
    "favList": [
      "高级",
      "传说",
      "甜",
      "生",
      "西式",
      "流行·喜爱"
    ],
    "drinkList": [
      "高酒精",
      "西洋酒",
      "古典",
      "水果",
      "甘"
    ],
    "dissList": [
      "实惠",
      "酸",
      "辣",
      "咸"
    ],
    "type": "rare"
  }
]
export const normalList = [
  {
    "name": "妖怪兔",
    "distanceList": [
      "妖怪兽道",
      "红魔馆",
      "迷途竹林",
      "魔法森林",
      "妖怪之山",
      "地灵殿"
    ],
    "favList": [
      "招牌",
      "家常",
      "甜",
      "咸",
      "鲜",
      "果味",
      "凉爽",
      "力量涌现",
      "流行·喜爱"
    ],
    "drinkList": [
      "无酒精"
    ],
    "type": "normal"
  },
  {
    "name": "妖怪猫",
    "distanceList": [
      "妖怪兽道",
      "博丽神社",
      "红魔馆",
      "迷途竹林",
      "魔法森林",
      "妖怪之山",
      "地灵殿"
    ],
    "favList": [
      "招牌",
      "肉",
      "海味",
      "凉爽",
      "中华",
      "流行·喜爱"
    ],
    "drinkList": [
      "可加冰",
      "啤酒",
      "苦"
    ],
    "type": "normal"
  },
  {
    "name": "妖怪狸",
    "distanceList": [
      "妖怪兽道",
      "博丽神社",
      "红魔馆",
      "迷途竹林",
      "魔法森林",
      "妖怪之山",
      "命莲寺"
    ],
    "favList": [
      "招牌",
      "肉",
      "饱腹",
      "重油",
      "咸",
      "山珍",
      "流行·喜爱"
    ],
    "drinkList": [
      "甘",
      "辛"
    ],
    "type": "normal"
  },
  {
    "name": "妖怪狐",
    "distanceList": [
      "妖怪兽道",
      "红魔馆",
      "迷途竹林",
      "妖怪之山",
      "旧地狱"
    ],
    "favList": [
      "招牌",
      "肉",
      "小巧",
      "和风",
      "中华",
      "流行·喜爱"
    ],
    "drinkList": [
      "直饮"
    ],
    "type": "normal"
  },
  {
    "name": "蟒蛇精",
    "distanceList": [
      "妖怪兽道",
      "妖怪之山",
      "旧地狱"
    ],
    "favList": [
      "肉",
      "下酒",
      "山珍",
      "力量涌现",
      "流行·喜爱"
    ],
    "drinkList": [
      "清酒",
      "烧酒"
    ],
    "type": "normal"
  },
  {
    "name": "人类小孩",
    "distanceList": [
      "人间之里"
    ],
    "favList": [
      "招牌",
      "家常",
      "肉",
      "饱腹",
      "甜",
      "咸",
      "凉爽",
      "中华",
      "流行·喜爱"
    ],
    "drinkList": [
      "无酒精"
    ],
    "type": "normal"
  },
  {
    "name": "人类男性",
    "distanceList": [
      "人间之里",
      "命莲寺",
      "神灵庙"
    ],
    "favList": [
      "肉",
      "下酒",
      "咸",
      "鲜",
      "灼热",
      "文化底蕴",
      "和风",
      "流行·喜爱"
    ],
    "drinkList": [
      "可加热",
      "烧酒"
    ],
    "type": "normal"
  },
  {
    "name": "人类女性",
    "distanceList": [
      "人间之里",
      "博丽神社",
      "命莲寺",
      "神灵庙"
    ],
    "favList": [
      "招牌",
      "水产",
      "高级",
      "咸",
      "鲜",
      "凉爽",
      "流行·喜爱"
    ],
    "drinkList": [
      "可加冰"
    ],
    "type": "normal"
  },
  {
    "name": "人类长者",
    "distanceList": [
      "人间之里",
      "博丽神社",
      "神灵庙"
    ],
    "favList": [
      "招牌",
      "高级",
      "灼热",
      "适合拍照",
      "流行·喜爱"
    ],
    "drinkList": [
      "低酒精"
    ],
    "type": "normal"
  },
  {
    "name": "左卫门",
    "distanceList": [
      "人间之里",
      "博丽神社"
    ],
    "favList": [
      "高级",
      "生",
      "猎奇",
      "力量涌现",
      "流行·喜爱"
    ],
    "drinkList": [
      "高酒精"
    ],
    "type": "normal"
  },
  {
    "name": "座敷童子",
    "distanceList": [
      "博丽神社"
    ],
    "favList": [
      "招牌",
      "甜",
      "生",
      "山珍",
      "凉爽",
      "和风",
      "流行·喜爱"
    ],
    "drinkList": [
      "无酒精",
      "低酒精"
    ],
    "type": "normal"
  },
  {
    "name": "河童",
    "distanceList": [
      "博丽神社",
      "红魔馆",
      "魔法森林",
      "妖怪之山"
    ],
    "favList": [
      "招牌",
      "大份",
      "小巧",
      "高级",
      "海味",
      "猎奇",
      "灼热",
      "流行·喜爱"
    ],
    "drinkList": [
      "甘"
    ],
    "type": "normal"
  },
  {
    "name": "鸦天狗",
    "distanceList": [
      "博丽神社",
      "红魔馆",
      "迷途竹林",
      "妖怪之山"
    ],
    "favList": [
      "招牌",
      "高级",
      "适合拍照",
      "菌类",
      "流行·喜爱"
    ],
    "drinkList": [
      "清酒",
      "烧酒"
    ],
    "type": "normal"
  },
  {
    "name": "妖精",
    "distanceList": [
      "红魔馆",
      "迷途竹林",
      "魔法森林"
    ],
    "favList": [
      "甜",
      "鲜",
      "果味",
      "梦幻",
      "适合拍照",
      "菌类",
      "特产",
      "流行·喜爱"
    ],
    "drinkList": [
      "气泡",
      "水果",
      "直饮",
      "甘"
    ],
    "type": "normal"
  },
  {
    "name": "地精",
    "distanceList": [
      "爱丽丝奖励符卡召唤"
    ],
    "favList": [
      "重油",
      "高级",
      "山珍",
      "凉爽",
      "灼热",
      "力量涌现",
      "流行·喜爱"
    ],
    "drinkList": [
      "清酒",
      "西洋酒"
    ],
    "type": "normal"
  },
  {
    "name": "魔法使",
    "distanceList": [
      "魔法森林"
    ],
    "favList": [
      "家常",
      "素",
      "清淡",
      "高级",
      "传说",
      "鲜",
      "凉爽",
      "适合拍照",
      "西式",
      "流行·喜爱"
    ],
    "drinkList": [
      "可加热",
      "西洋酒",
      "鸡尾酒",
      "提神"
    ],
    "type": "normal"
  },
  {
    "name": "森之妖精",
    "distanceList": [
      "魔法森林"
    ],
    "favList": [
      "招牌",
      "家常",
      "小巧",
      "甜",
      "鲜",
      "凉爽",
      "梦幻",
      "和风",
      "中华",
      "流行·喜爱"
    ],
    "drinkList": [
      "无酒精",
      "低酒精",
      "清酒",
      "水果",
      "甘"
    ],
    "type": "normal"
  },
  {
    "name": "谜之人形",
    "distanceList": [
      "魔法森林"
    ],
    "favList": [
      "家常",
      "小巧",
      "咸",
      "生",
      "梦幻",
      "猎奇",
      "适合拍照",
      "菌类",
      "流行·喜爱"
    ],
    "drinkList": [
      "气泡",
      "水果",
      "提神",
      "苦"
    ],
    "type": "normal"
  },
  {
    "name": "山姥",
    "distanceList": [
      "妖怪之山"
    ],
    "favList": [
      "家常",
      "肉",
      "饱腹",
      "高级",
      "鲜",
      "猎奇",
      "力量涌现",
      "流行·喜爱"
    ],
    "drinkList": [
      "高酒精",
      "烧酒",
      "古典",
      "直饮"
    ],
    "type": "normal"
  },
  {
    "name": "山童",
    "distanceList": [
      "妖怪之山"
    ],
    "favList": [
      "招牌",
      "大份",
      "小巧",
      "高级",
      "山珍",
      "猎奇",
      "灼热",
      "流行·喜爱"
    ],
    "drinkList": [
      "中酒精",
      "苦"
    ],
    "type": "normal"
  },
  {
    "name": "白狼天狗",
    "distanceList": [
      "妖怪之山"
    ],
    "favList": [
      "招牌",
      "肉",
      "饱腹",
      "重油",
      "咸",
      "鲜",
      "生",
      "山珍",
      "特产",
      "流行·喜爱"
    ],
    "drinkList": [
      "中酒精",
      "高酒精",
      "清酒",
      "烧酒"
    ],
    "type": "normal"
  },
  {
    "name": "土蜘蛛",
    "distanceList": [
      "旧地狱"
    ],
    "favList": [
      "肉",
      "饱腹",
      "重油",
      "大份",
      "甜",
      "鲜",
      "生",
      "山珍",
      "猎奇",
      "流行·喜爱"
    ],
    "drinkList": [
      "中酒精",
      "可加冰",
      "利口酒",
      "现代",
      "直饮",
      "甘",
      "苦"
    ],
    "type": "normal"
  },
  {
    "name": "鬼",
    "distanceList": [
      "旧地狱"
    ],
    "favList": [
      "肉",
      "下酒",
      "高级",
      "传说",
      "鲜",
      "力量涌现",
      "燃起来了",
      "特产",
      "流行·喜爱"
    ],
    "drinkList": [
      "中酒精",
      "高酒精",
      "烧酒",
      "直饮"
    ],
    "type": "normal"
  },
  {
    "name": "骨女",
    "distanceList": [
      "旧地狱"
    ],
    "favList": [
      "素",
      "清淡",
      "酸",
      "鲜",
      "生",
      "凉爽",
      "猎奇",
      "菌类",
      "流行·喜爱"
    ],
    "drinkList": [
      "低酒精",
      "可加热",
      "啤酒",
      "水果",
      "苦"
    ],
    "type": "normal"
  },
  {
    "name": "地狱鸦",
    "distanceList": [
      "地灵殿"
    ],
    "favList": [
      "家常",
      "肉",
      "小巧",
      "酸",
      "咸",
      "山珍",
      "海味",
      "燃起来了",
      "流行·喜爱"
    ],
    "drinkList": [
      "中酒精",
      "可加热",
      "啤酒",
      "苦",
      "辛"
    ],
    "type": "normal"
  },
  {
    "name": "姑获鸟",
    "distanceList": [
      "地灵殿"
    ],
    "favList": [
      "家常",
      "水产",
      "清淡",
      "酸",
      "鲜",
      "猎奇",
      "文化底蕴",
      "流行·喜爱"
    ],
    "drinkList": [
      "低酒精",
      "可加热",
      "烧酒",
      "苦"
    ],
    "type": "normal"
  },
  {
    "name": "豹女",
    "distanceList": [
      "地灵殿"
    ],
    "favList": [
      "肉",
      "重油",
      "高级",
      "生",
      "山珍",
      "海味",
      "灼热",
      "特产",
      "流行·喜爱"
    ],
    "drinkList": [
      "中酒精",
      "高酒精",
      "直饮",
      "辛"
    ],
    "type": "normal"
  },
  {
    "name": "僧侣",
    "distanceList": [
      "命莲寺"
    ],
    "favList": [
      "家常",
      "肉",
      "下酒",
      "山珍",
      "力量涌现",
      "流行·喜爱"
    ],
    "drinkList": [
      "中酒精",
      "高酒精",
      "可加热",
      "烧酒",
      "古典"
    ],
    "type": "normal"
  },
  {
    "name": "妖怪鼠",
    "distanceList": [
      "命莲寺"
    ],
    "favList": [
      "家常",
      "大份",
      "高级",
      "果味",
      "梦幻",
      "流行·喜爱"
    ],
    "drinkList": [
      "利口酒",
      "鸡尾酒",
      "现代",
      "水果",
      "甘"
    ],
    "type": "normal"
  },
  {
    "name": "八尺大人",
    "distanceList": [
      "命莲寺"
    ],
    "favList": [
      "鲜",
      "凉爽",
      "适合拍照",
      "和风",
      "西式",
      "流行·喜爱"
    ],
    "drinkList": [
      "低酒精",
      "可加冰",
      "利口酒",
      "西洋酒",
      "鸡尾酒"
    ],
    "type": "normal"
  },
  {
    "name": "道士",
    "distanceList": [
      "神灵庙"
    ],
    "favList": [
      "招牌",
      "家常",
      "清淡",
      "小巧",
      "山珍",
      "特产",
      "流行·喜爱"
    ],
    "drinkList": [
      "低酒精",
      "现代",
      "提神",
      "苦"
    ],
    "type": "normal"
  },
  {
    "name": "僵尸",
    "distanceList": [
      "神灵庙"
    ],
    "favList": [
      "全部"
    ],
    "drinkList": [
      "全部"
    ],
    "type": "normal"
  },
  {
    "name": "仙人",
    "distanceList": [
      "神灵庙"
    ],
    "favList": [
      "素",
      "清淡",
      "小巧",
      "高级",
      "果味",
      "梦幻",
      "流行·喜爱"
    ],
    "drinkList": [
      "低酒精",
      "清酒",
      "古典",
      "气泡",
      "水果",
      "甘"
    ],
    "type": "normal"
  },
  {
    "name": "铃兰花精",
    "distanceList": [
      "太阳花田"
    ],
    "favList": [
      "下酒",
      "小巧",
      "生",
      "毒",
      "梦幻",
      "流行·喜爱"
    ],
    "drinkList": [
      "中酒精",
      "气泡",
      "直饮",
      "辛"
    ],
    "type": "normal"
  },
  {
    "name": "太阳花精",
    "distanceList": [
      "太阳花田"
    ],
    "favList": [
      "甜",
      "鲜",
      "不可思议",
      "力量涌现",
      "特产",
      "流行·喜爱"
    ],
    "drinkList": [
      "利口酒",
      "气泡",
      "水果",
      "甘"
    ],
    "type": "normal"
  },
  {
    "name": "玫瑰花精",
    "distanceList": [
      "太阳花田"
    ],
    "favList": [
      "招牌",
      "小巧",
      "高级",
      "适合拍照",
      "西式",
      "流行·喜爱"
    ],
    "drinkList": [
      "低酒精",
      "鸡尾酒",
      "现代",
      "甘"
    ],
    "type": "normal"
  },
  {
    "name": "影女",
    "distanceList": [
      "太阳花田"
    ],
    "favList": [
      "家常",
      "生",
      "凉爽",
      "猎奇",
      "不可思议",
      "和风",
      "流行·喜爱"
    ],
    "drinkList": [
      "高酒精",
      "可加冰",
      "古典",
      "提神",
      "苦"
    ],
    "type": "normal"
  },
  {
    "name": "小人族",
    "distanceList": [
      "辉针城"
    ],
    "favList": [
      "小巧",
      "传说",
      "梦幻",
      "力量涌现",
      "燃起来了",
      "和风",
      "流行·喜爱"
    ],
    "drinkList": [
      "可加冰",
      "可加热",
      "啤酒",
      "古典",
      "甘"
    ],
    "type": "normal"
  },
  {
    "name": "不良少年",
    "distanceList": [
      "辉针城"
    ],
    "favList": [
      "家常",
      "饱腹",
      "下酒",
      "力量涌现",
      "和风",
      "流行·喜爱"
    ],
    "drinkList": [
      "高酒精",
      "可加热",
      "啤酒",
      "烧酒",
      "提神",
      "苦"
    ],
    "type": "normal"
  },
  {
    "name": "不良少女",
    "distanceList": [
      "辉针城"
    ],
    "favList": [
      "家常",
      "高级",
      "灼热",
      "适合拍照",
      "和风",
      "流行·喜爱"
    ],
    "drinkList": [
      "中酒精",
      "啤酒",
      "现代",
      "气泡",
      "水果"
    ],
    "type": "normal"
  },
  {
    "name": "玩具兵",
    "distanceList": [
      "辉针城"
    ],
    "favList": [
      "招牌",
      "海味",
      "凉爽",
      "不可思议",
      "西式",
      "流行·喜爱"
    ],
    "drinkList": [
      "利口酒",
      "西洋酒",
      "现代",
      "直饮"
    ],
    "type": "normal"
  }
]
export const dishList = [
  {
    "name": "黑暗物质",
    "cook": "任意",
    "price": "1",
    "useList": "黑暗物质",
    "props": [
      "黑暗物质"
    ],
    "invalidList": "任意",
    "time": "任意"
  },
  {
    "name": "饭团",
    "cook": "料理台",
    "price": "6",
    "useList": [
      "实惠",
      "家常",
      "素",
      "饱腹",
      "和风"
    ],
    "props": [
      "实惠",
      "家常",
      "素",
      "饱腹",
      "和风"
    ],
    "invalidList": "海苔",
    "time": "3"
  },
  {
    "name": "海鲜味噌汤",
    "cook": "煮锅",
    "price": "8",
    "useList": [
      "实惠",
      "家常",
      "素",
      "汤羹"
    ],
    "props": [
      "实惠",
      "家常",
      "素",
      "汤羹"
    ],
    "invalidList": "海苔",
    "time": "重油"
  },
  {
    "name": "司康饼",
    "cook": "蒸锅",
    "price": "8",
    "useList": [
      "实惠",
      "饱腹",
      "西式"
    ],
    "props": [
      "实惠",
      "饱腹",
      "西式"
    ],
    "invalidList": [
      "黄油",
      "面粉"
    ],
    "time": "4.2"
  },
  {
    "name": "炙猪肉饭团",
    "cook": "料理台",
    "price": "14",
    "useList": [
      "实惠",
      "家常",
      "肉",
      "饱腹",
      "和风"
    ],
    "props": [
      "实惠",
      "家常",
      "肉",
      "饱腹",
      "和风"
    ],
    "invalidList": "猪肉",
    "time": "3.6"
  },
  {
    "name": "炒肉丝",
    "cook": "油锅",
    "price": "15",
    "useList": [
      "实惠",
      "家常",
      "肉",
      "下酒",
      "重油",
      "中华"
    ],
    "props": [
      "实惠",
      "家常",
      "肉",
      "下酒",
      "重油",
      "中华"
    ],
    "invalidList": "猪肉",
    "time": "4.8"
  },
  {
    "name": "油豆腐",
    "cook": "油锅",
    "price": "16",
    "useList": [
      "实惠",
      "家常",
      "素",
      "重油",
      "和风"
    ],
    "props": [
      "实惠",
      "家常",
      "素",
      "重油",
      "和风"
    ],
    "invalidList": "豆腐",
    "time": "4.2"
  },
  {
    "name": "露水煮蛋",
    "cook": "蒸锅",
    "price": "18",
    "useList": [
      "实惠",
      "清淡",
      "生"
    ],
    "props": [
      "实惠",
      "清淡",
      "生"
    ],
    "invalidList": [
      "鸡蛋",
      "露水"
    ],
    "time": [
      "肉",
      "水产",
      "重油"
    ]
  },
  {
    "name": "烤蘑菇",
    "cook": "烤架",
    "price": "18",
    "useList": [
      "实惠",
      "素",
      "咸",
      "灼热",
      "菌类",
      "烧烤"
    ],
    "props": [
      "实惠",
      "素",
      "咸",
      "灼热",
      "菌类",
      "烧烤"
    ],
    "invalidList": "蘑菇",
    "time": "3.6"
  },
  {
    "name": "豆腐锅",
    "cook": "煮锅",
    "price": "19",
    "useList": [
      "实惠",
      "素",
      "清淡",
      "灼热",
      "和风"
    ],
    "props": [
      "实惠",
      "素",
      "清淡",
      "灼热",
      "和风"
    ],
    "invalidList": "豆腐",
    "time": "3"
  },
  {
    "name": "香炸蝉蜕",
    "cook": "油锅",
    "price": "19",
    "useList": [
      "实惠",
      "重油",
      "猎奇"
    ],
    "props": [
      "实惠",
      "重油",
      "猎奇"
    ],
    "invalidList": "蝉蜕",
    "time": "4.8"
  },
  {
    "name": "猪肉盖浇饭",
    "cook": "煮锅",
    "price": "20",
    "useList": [
      "家常",
      "肉",
      "饱腹"
    ],
    "props": [
      "家常",
      "肉",
      "饱腹"
    ],
    "invalidList": "猪肉",
    "time": "4.2"
  },
  {
    "name": "牛肉盖浇饭",
    "cook": "煮锅",
    "price": "20",
    "useList": [
      "家常",
      "肉",
      "饱腹"
    ],
    "props": [
      "家常",
      "肉",
      "饱腹"
    ],
    "invalidList": "牛肉",
    "time": "4.2"
  },
  {
    "name": "奶油炖菜",
    "cook": "蒸锅",
    "price": "20",
    "useList": [
      "素",
      "菌类",
      "汤羹",
      "西式"
    ],
    "props": [
      "素",
      "菌类",
      "汤羹",
      "西式"
    ],
    "invalidList": [
      "洋葱",
      "蘑菇",
      "黄油"
    ],
    "time": "5.4"
  },
  {
    "name": "月饼",
    "cook": "蒸锅",
    "price": "20",
    "useList": [
      "饱腹",
      "小巧",
      "甜",
      "不可思议",
      "文化底蕴",
      "中华"
    ],
    "props": [
      "饱腹",
      "小巧",
      "甜",
      "不可思议",
      "文化底蕴",
      "中华"
    ],
    "invalidList": [
      "蜂蜜",
      "面粉",
      "糯米",
      "月光草"
    ],
    "time": "6"
  },
  {
    "name": "凉菜雕花",
    "cook": "料理台",
    "price": "20",
    "useList": [
      "素",
      "清淡",
      "凉爽",
      "适合拍照"
    ],
    "props": [
      "素",
      "清淡",
      "凉爽",
      "适合拍照"
    ],
    "invalidList": "萝卜",
    "time": [
      "肉",
      "灼热"
    ]
  },
  {
    "name": "豆腐味噌",
    "cook": "煮锅",
    "price": "21",
    "useList": [
      "家常",
      "素",
      "清淡",
      "汤羹",
      "和风"
    ],
    "props": [
      "家常",
      "素",
      "清淡",
      "汤羹",
      "和风"
    ],
    "invalidList": "豆腐",
    "time": "重油"
  },
  {
    "name": "冷豆腐",
    "cook": "料理台",
    "price": "21",
    "useList": [
      "家常",
      "素",
      "下酒",
      "清淡",
      "小巧"
    ],
    "props": [
      "家常",
      "素",
      "下酒",
      "清淡",
      "小巧"
    ],
    "invalidList": [
      "豆腐",
      "萝卜"
    ],
    "time": "3"
  },
  {
    "name": "煮豆腐",
    "cook": "煮锅",
    "price": "22",
    "useList": [
      "家常",
      "素",
      "清淡"
    ],
    "props": [
      "家常",
      "素",
      "清淡"
    ],
    "invalidList": "豆腐",
    "time": "4.2"
  },
  {
    "name": "土豆可乐饼",
    "cook": "油锅",
    "price": "22",
    "useList": [
      "家常",
      "素",
      "重油"
    ],
    "props": [
      "家常",
      "素",
      "重油"
    ],
    "invalidList": "土豆",
    "time": "凉爽"
  },
  {
    "name": "热松饼",
    "cook": "油锅",
    "price": "22",
    "useList": [
      "饱腹",
      "甜",
      "西式"
    ],
    "props": [
      "饱腹",
      "甜",
      "西式"
    ],
    "invalidList": [
      "鸡蛋",
      "蜂蜜",
      "面粉"
    ],
    "time": "5.4"
  },
  {
    "name": "烤八目鳗",
    "cook": "烤架",
    "price": "22",
    "useList": [
      "招牌",
      "水产",
      "烧烤"
    ],
    "props": [
      "招牌",
      "水产",
      "烧烤"
    ],
    "invalidList": "八目鳗",
    "time": [
      "肉",
      "素"
    ]
  },
  {
    "name": "臭豆腐",
    "cook": "油锅",
    "price": "24",
    "useList": [
      "素",
      "辣",
      "猎奇",
      "中华"
    ],
    "props": [
      "素",
      "辣",
      "猎奇",
      "中华"
    ],
    "invalidList": [
      "豆腐",
      "辣椒"
    ],
    "time": [
      "甜",
      "果味"
    ]
  },
  {
    "name": "炸猪肉排",
    "cook": "油锅",
    "price": "25",
    "useList": [
      "家常",
      "肉",
      "饱腹",
      "重油"
    ],
    "props": [
      "家常",
      "肉",
      "饱腹",
      "重油"
    ],
    "invalidList": "猪肉",
    "time": "4.2"
  },
  {
    "name": "竹笋炒肉",
    "cook": "油锅",
    "price": "25",
    "useList": [
      "家常",
      "肉",
      "下酒"
    ],
    "props": [
      "家常",
      "肉",
      "下酒"
    ],
    "invalidList": [
      "猪肉",
      "竹笋"
    ],
    "time": "6"
  },
  {
    "name": "北极甜虾蜜桃色拉",
    "cook": "料理台",
    "price": "25",
    "useList": [
      "素",
      "水产",
      "清淡",
      "甜",
      "果味",
      "不可思议",
      "适合拍照"
    ],
    "props": [
      "素",
      "水产",
      "清淡",
      "甜",
      "果味",
      "不可思议",
      "适合拍照"
    ],
    "invalidList": [
      "虾",
      "桃子",
      "冰块"
    ],
    "time": [
      "肉",
      "咸"
    ]
  },
  {
    "name": "猪肉鳟鱼熏",
    "cook": "烤架",
    "price": "26",
    "useList": [
      "家常",
      "肉",
      "水产",
      "烧烤"
    ],
    "props": [
      "家常",
      "肉",
      "水产",
      "烧烤"
    ],
    "invalidList": [
      "鳟鱼",
      "猪肉"
    ],
    "time": "4.2"
  },
  {
    "name": "炸八目鳗",
    "cook": "油锅",
    "price": "27",
    "useList": [
      "招牌",
      "水产",
      "重油"
    ],
    "props": [
      "招牌",
      "水产",
      "重油"
    ],
    "invalidList": "八目鳗",
    "time": "凉爽"
  },
  {
    "name": "麻薯",
    "cook": "料理台",
    "price": "30",
    "useList": [
      "小巧",
      "甜",
      "和风"
    ],
    "props": [
      "小巧",
      "甜",
      "和风"
    ],
    "invalidList": "糯米",
    "time": [
      "肉",
      "水产",
      "咸",
      "鲜"
    ]
  },
  {
    "name": "温暖饭团",
    "cook": "料理台",
    "price": "30",
    "useList": [
      "家常",
      "素",
      "水产",
      "饱腹",
      "灼热",
      "和风"
    ],
    "props": [
      "家常",
      "素",
      "水产",
      "饱腹",
      "灼热",
      "和风"
    ],
    "invalidList": [
      "鳟鱼",
      "洋葱"
    ],
    "time": "4.8"
  },
  {
    "name": "秘制小鱼干",
    "cook": "料理台",
    "price": "30",
    "useList": [
      "水产",
      "小巧",
      "咸",
      "鲜"
    ],
    "props": [
      "水产",
      "小巧",
      "咸",
      "鲜"
    ],
    "invalidList": "鳟鱼",
    "time": "4.8"
  },
  {
    "name": "麻婆豆腐",
    "cook": "油锅",
    "price": "32",
    "useList": [
      "素",
      "辣",
      "灼热",
      "中华"
    ],
    "props": [
      "素",
      "辣",
      "灼热",
      "中华"
    ],
    "invalidList": [
      "猪肉",
      "豆腐",
      "辣椒"
    ],
    "time": [
      "甜",
      "果味",
      "凉爽"
    ]
  },
  {
    "name": "力量汤",
    "cook": "煮锅",
    "price": "34",
    "useList": [
      "肉",
      "山珍",
      "灼热",
      "力量涌现",
      "汤羹"
    ],
    "props": [
      "肉",
      "山珍",
      "灼热",
      "力量涌现",
      "汤羹"
    ],
    "invalidList": [
      "野猪肉",
      "海苔"
    ],
    "time": [
      "小巧",
      "凉爽"
    ]
  },
  {
    "name": "汤圆",
    "cook": "煮锅",
    "price": "35",
    "useList": [
      "家常",
      "素",
      "文化底蕴",
      "中华"
    ],
    "props": [
      "家常",
      "素",
      "文化底蕴",
      "中华"
    ],
    "invalidList": "糯米",
    "time": "3"
  },
  {
    "name": "水饺",
    "cook": "煮锅",
    "price": "35",
    "useList": [
      "家常",
      "素",
      "文化底蕴",
      "中华"
    ],
    "props": [
      "家常",
      "素",
      "文化底蕴",
      "中华"
    ],
    "invalidList": "面粉",
    "time": "3"
  },
  {
    "name": "班尼迪克蛋",
    "cook": "油锅",
    "price": "35",
    "useList": [
      "饱腹",
      "小巧",
      "生",
      "西式"
    ],
    "props": [
      "饱腹",
      "小巧",
      "生",
      "西式"
    ],
    "invalidList": [
      "竹笋",
      "鸡蛋",
      "黄油",
      "面粉"
    ],
    "time": [
      "甜",
      "果味"
    ]
  },
  {
    "name": "杂炊",
    "cook": "煮锅",
    "price": "40",
    "useList": [
      "家常",
      "肉",
      "鲜",
      "灼热"
    ],
    "props": [
      "家常",
      "肉",
      "鲜",
      "灼热"
    ],
    "invalidList": [
      "鳟鱼",
      "豆腐",
      "海苔"
    ],
    "time": "3"
  },
  {
    "name": "竹筒蒸蛋",
    "cook": "蒸锅",
    "price": "40",
    "useList": [
      "家常",
      "清淡",
      "菌类"
    ],
    "props": [
      "家常",
      "清淡",
      "菌类"
    ],
    "invalidList": [
      "海苔",
      "蘑菇",
      "鸡蛋",
      "竹子"
    ],
    "time": "3.6"
  },
  {
    "name": "流水素面",
    "cook": "料理台",
    "price": "40",
    "useList": [
      "素",
      "清淡",
      "凉爽",
      "不可思议"
    ],
    "props": [
      "素",
      "清淡",
      "凉爽",
      "不可思议"
    ],
    "invalidList": [
      "面粉",
      "竹子"
    ],
    "time": "重油"
  },
  {
    "name": "红烧鳗鱼",
    "cook": "油锅",
    "price": "42",
    "useList": [
      "招牌",
      "素",
      "水产",
      "重油",
      "鲜"
    ],
    "props": [
      "招牌",
      "素",
      "水产",
      "重油",
      "鲜"
    ],
    "invalidList": [
      "八目鳗",
      "洋葱"
    ],
    "time": "4.8"
  },
  {
    "name": "樱落雪",
    "cook": "料理台",
    "price": "50",
    "useList": [
      "水产",
      "小巧",
      "高级",
      "生",
      "海味",
      "适合拍照",
      "和风"
    ],
    "props": [
      "水产",
      "小巧",
      "高级",
      "生",
      "海味",
      "适合拍照",
      "和风"
    ],
    "invalidList": "极上金枪鱼",
    "time": "重油"
  },
  {
    "name": "能量串",
    "cook": "烤架",
    "price": "50",
    "useList": [
      "肉",
      "饱腹",
      "烧烤"
    ],
    "props": [
      "肉",
      "饱腹",
      "烧烤"
    ],
    "invalidList": [
      "牛肉",
      "洋葱",
      "南瓜"
    ],
    "time": "7.2"
  },
  {
    "name": "桃花羹",
    "cook": "煮锅",
    "price": "55",
    "useList": [
      "素",
      "甜",
      "果味",
      "凉爽",
      "适合拍照",
      "汤羹"
    ],
    "props": [
      "素",
      "甜",
      "果味",
      "凉爽",
      "适合拍照",
      "汤羹"
    ],
    "invalidList": [
      "桃子",
      "露水",
      "冰块"
    ],
    "time": "4.2"
  },
  {
    "name": "真·海鲜味噌汤",
    "cook": "煮锅",
    "price": "55",
    "useList": [
      "家常",
      "水产",
      "清淡",
      "汤羹"
    ],
    "props": [
      "家常",
      "水产",
      "清淡",
      "汤羹"
    ],
    "invalidList": [
      "鳟鱼",
      "三文鱼"
    ],
    "time": "4.8"
  },
  {
    "name": "白桃生八桥",
    "cook": "料理台",
    "price": "55",
    "useList": [
      "甜",
      "果味",
      "和风"
    ],
    "props": [
      "甜",
      "果味",
      "和风"
    ],
    "invalidList": [
      "桃子",
      "糯米"
    ],
    "time": [
      "肉",
      "水产",
      "咸",
      "鲜"
    ]
  },
  {
    "name": "蔬菜专辑",
    "cook": "料理台",
    "price": "56",
    "useList": [
      "素",
      "清淡",
      "生",
      "凉爽"
    ],
    "props": [
      "素",
      "清淡",
      "生",
      "凉爽"
    ],
    "invalidList": [
      "土豆",
      "洋葱",
      "南瓜"
    ],
    "time": [
      "肉",
      "水产",
      "灼热"
    ]
  },
  {
    "name": "香煎三文鱼",
    "cook": "油锅",
    "price": "58",
    "useList": [
      "肉",
      "鲜",
      "西式"
    ],
    "props": [
      "肉",
      "鲜",
      "西式"
    ],
    "invalidList": [
      "三文鱼",
      "竹笋"
    ],
    "time": "6"
  },
  {
    "name": "豚骨拉面",
    "cook": "煮锅",
    "price": "60",
    "useList": [
      "家常",
      "肉",
      "饱腹",
      "咸"
    ],
    "props": [
      "家常",
      "肉",
      "饱腹",
      "咸"
    ],
    "invalidList": [
      "猪肉",
      "海苔",
      "鸡蛋"
    ],
    "time": "4.8"
  },
  {
    "name": "诗礼银杏",
    "cook": "蒸锅",
    "price": "60",
    "useList": [
      "素",
      "甜",
      "文化底蕴",
      "中华"
    ],
    "props": [
      "素",
      "甜",
      "文化底蕴",
      "中华"
    ],
    "invalidList": [
      "白果",
      "蜂蜜"
    ],
    "time": "咸"
  },
  {
    "name": "黄油牛排",
    "cook": "油锅",
    "price": "60",
    "useList": [
      "肉",
      "饱腹",
      "重油",
      "西式"
    ],
    "props": [
      "肉",
      "饱腹",
      "重油",
      "西式"
    ],
    "invalidList": [
      "和牛",
      "黄油"
    ],
    "time": [
      "甜",
      "凉爽"
    ]
  },
  {
    "name": "猩红恶魔蛋糕",
    "cook": "料理台",
    "price": "60",
    "useList": [
      "甜",
      "梦幻",
      "猎奇",
      "适合拍照",
      "西式"
    ],
    "props": [
      "甜",
      "梦幻",
      "猎奇",
      "适合拍照",
      "西式"
    ],
    "invalidList": [
      "土豆",
      "南瓜",
      "蜂蜜",
      "露水"
    ],
    "time": "4.8"
  },
  {
    "name": "无意识妖怪慕斯",
    "cook": "料理台",
    "price": "60",
    "useList": [
      "高级",
      "甜",
      "梦幻",
      "适合拍照",
      "西式"
    ],
    "props": [
      "高级",
      "甜",
      "梦幻",
      "适合拍照",
      "西式"
    ],
    "invalidList": [
      "豆腐",
      "洋葱",
      "蜂蜜",
      "黄油"
    ],
    "time": "4.8"
  },
  {
    "name": "白果萝卜排骨汤",
    "cook": "煮锅",
    "price": "65",
    "useList": [
      "昂贵",
      "肉",
      "灼热",
      "汤羹",
      "中华"
    ],
    "props": [
      "昂贵",
      "肉",
      "灼热",
      "汤羹",
      "中华"
    ],
    "invalidList": [
      "猪肉",
      "萝卜",
      "白果"
    ],
    "time": "3.6"
  },
  {
    "name": "竹取姬",
    "cook": "蒸锅",
    "price": "65",
    "useList": [
      "昂贵",
      "肉",
      "高级",
      "传说",
      "适合拍照",
      "文化底蕴",
      "特产",
      "和风"
    ],
    "props": [
      "昂贵",
      "肉",
      "高级",
      "传说",
      "适合拍照",
      "文化底蕴",
      "特产",
      "和风"
    ],
    "invalidList": [
      "黑毛猪肉",
      "松露",
      "竹笋",
      "白果",
      "竹子"
    ],
    "time": "7.2"
  },
  {
    "name": "不死鸟",
    "cook": "烤架",
    "price": "65",
    "useList": [
      "昂贵",
      "高级",
      "传说",
      "燃起来了",
      "适合拍照",
      "烧烤",
      "西式"
    ],
    "props": [
      "昂贵",
      "高级",
      "传说",
      "燃起来了",
      "适合拍照",
      "烧烤",
      "西式"
    ],
    "invalidList": [
      "土豆",
      "洋葱",
      "萝卜",
      "蜂蜜",
      "面粉"
    ],
    "time": "7.2"
  },
  {
    "name": "野味加农",
    "cook": "煮锅",
    "price": "66",
    "useList": [
      "昂贵",
      "肉",
      "饱腹",
      "重油",
      "山珍",
      "灼热"
    ],
    "props": [
      "昂贵",
      "肉",
      "饱腹",
      "重油",
      "山珍",
      "灼热"
    ],
    "invalidList": [
      "黑毛猪肉",
      "土豆",
      "南瓜"
    ],
    "time": "4.8"
  },
  {
    "name": "月之恋人",
    "cook": "料理台",
    "price": "66",
    "useList": [
      "昂贵",
      "小巧",
      "甜",
      "适合拍照",
      "特产"
    ],
    "props": [
      "昂贵",
      "小巧",
      "甜",
      "适合拍照",
      "特产"
    ],
    "invalidList": [
      "鸡蛋",
      "黄油",
      "面粉",
      "月光草"
    ],
    "time": [
      "肉",
      "素",
      "水产"
    ]
  },
  {
    "name": "水煮鱼",
    "cook": "煮锅",
    "price": "68",
    "useList": [
      "昂贵",
      "水产",
      "辣",
      "灼热",
      "燃起来了",
      "中华"
    ],
    "props": [
      "昂贵",
      "水产",
      "辣",
      "灼热",
      "燃起来了",
      "中华"
    ],
    "invalidList": [
      "鳟鱼",
      "辣椒"
    ],
    "time": [
      "肉",
      "甜",
      "果味",
      "凉爽"
    ]
  },
  {
    "name": "意式烩饭",
    "cook": "蒸锅",
    "price": "70",
    "useList": [
      "昂贵",
      "饱腹",
      "鲜",
      "菌类",
      "西式"
    ],
    "props": [
      "昂贵",
      "饱腹",
      "鲜",
      "菌类",
      "西式"
    ],
    "invalidList": [
      "洋葱",
      "蘑菇",
      "竹笋",
      "黄油"
    ],
    "time": "甜"
  },
  {
    "name": "赛熊掌",
    "cook": "蒸锅",
    "price": "70",
    "useList": [
      "昂贵",
      "肉",
      "水产",
      "高级",
      "鲜",
      "山珍",
      "不可思议",
      "力量涌现"
    ],
    "props": [
      "昂贵",
      "肉",
      "水产",
      "高级",
      "鲜",
      "山珍",
      "不可思议",
      "力量涌现"
    ],
    "invalidList": [
      "河豚",
      "黑毛猪肉",
      "竹笋"
    ],
    "time": "7.2"
  },
  {
    "name": "蜜汁叉烧",
    "cook": "烤架",
    "price": "70",
    "useList": [
      "昂贵",
      "肉",
      "重油",
      "甜",
      "不可思议",
      "中华"
    ],
    "props": [
      "昂贵",
      "肉",
      "重油",
      "甜",
      "不可思议",
      "中华"
    ],
    "invalidList": [
      "猪肉",
      "蜂蜜"
    ],
    "time": "4.2"
  },
  {
    "name": "毛玉三色冰激凌",
    "cook": "料理台",
    "price": "75",
    "useList": [
      "昂贵",
      "甜",
      "凉爽",
      "梦幻",
      "适合拍照",
      "西式"
    ],
    "props": [
      "昂贵",
      "甜",
      "凉爽",
      "梦幻",
      "适合拍照",
      "西式"
    ],
    "invalidList": [
      "豆腐",
      "鸡蛋",
      "蜂蜜",
      "露水"
    ],
    "time": "4.8"
  },
  {
    "name": "幻昙花糕",
    "cook": "蒸锅",
    "price": "78",
    "useList": [
      "昂贵",
      "高级",
      "传说",
      "甜",
      "梦幻",
      "适合拍照"
    ],
    "props": [
      "昂贵",
      "高级",
      "传说",
      "甜",
      "梦幻",
      "适合拍照"
    ],
    "invalidList": [
      "幻昙华",
      "露水"
    ],
    "time": [
      "肉",
      "水产"
    ]
  },
  {
    "name": "猪鹿蝶",
    "cook": "蒸锅",
    "price": "78",
    "useList": [
      "昂贵",
      "肉",
      "高级",
      "适合拍照",
      "文化底蕴"
    ],
    "props": [
      "昂贵",
      "肉",
      "高级",
      "适合拍照",
      "文化底蕴"
    ],
    "invalidList": [
      "鹿肉",
      "野猪肉",
      "月光草"
    ],
    "time": "4.8"
  },
  {
    "name": "月光团子",
    "cook": "料理台",
    "price": "80",
    "useList": [
      "昂贵",
      "甜",
      "不可思议",
      "特产",
      "和风"
    ],
    "props": [
      "昂贵",
      "甜",
      "不可思议",
      "特产",
      "和风"
    ],
    "invalidList": [
      "糯米",
      "月光草"
    ],
    "time": [
      "肉",
      "水产",
      "咸",
      "鲜"
    ]
  },
  {
    "name": "毛玉熔岩豆腐",
    "cook": "料理台",
    "price": "85",
    "useList": [
      "昂贵",
      "素",
      "鲜",
      "不可思议",
      "适合拍照",
      "中华"
    ],
    "props": [
      "昂贵",
      "素",
      "鲜",
      "不可思议",
      "适合拍照",
      "中华"
    ],
    "invalidList": [
      "牛肉",
      "豆腐",
      "洋葱",
      "辣椒"
    ],
    "time": "4.8"
  },
  {
    "name": "刺身拼盘",
    "cook": "料理台",
    "price": "88",
    "useList": [
      "昂贵",
      "水产",
      "高级",
      "生",
      "适合拍照",
      "和风"
    ],
    "props": [
      "昂贵",
      "水产",
      "高级",
      "生",
      "适合拍照",
      "和风"
    ],
    "invalidList": [
      "三文鱼",
      "金枪鱼"
    ],
    "time": "灼热"
  },
  {
    "name": "二天一流",
    "cook": "烤架",
    "price": "90",
    "useList": [
      "昂贵",
      "肉",
      "高级",
      "山珍",
      "燃起来了",
      "文化底蕴",
      "烧烤"
    ],
    "props": [
      "昂贵",
      "肉",
      "高级",
      "山珍",
      "燃起来了",
      "文化底蕴",
      "烧烤"
    ],
    "invalidList": [
      "野猪肉",
      "黑毛猪肉"
    ],
    "time": "家常"
  },
  {
    "name": "白雪",
    "cook": "煮锅",
    "price": "98",
    "useList": [
      "昂贵",
      "肉",
      "水产",
      "高级",
      "文化底蕴",
      "和风"
    ],
    "props": [
      "昂贵",
      "肉",
      "水产",
      "高级",
      "文化底蕴",
      "和风"
    ],
    "invalidList": [
      "八目鳗",
      "河豚",
      "海苔"
    ],
    "time": "7.2"
  },
  {
    "name": "大奢宴",
    "cook": "煮锅",
    "price": "105",
    "useList": [
      "昂贵",
      "肉",
      "水产",
      "饱腹",
      "高级",
      "山珍"
    ],
    "props": [
      "昂贵",
      "肉",
      "水产",
      "饱腹",
      "高级",
      "山珍"
    ],
    "invalidList": [
      "河豚",
      "黑毛猪肉",
      "和牛"
    ],
    "time": [
      "实惠",
      "家常"
    ]
  },
  {
    "name": "岩浆",
    "cook": "煮锅",
    "price": "125",
    "useList": [
      "昂贵",
      "肉",
      "水产",
      "饱腹",
      "高级",
      "灼热",
      "力量涌现",
      "菌类"
    ],
    "props": [
      "昂贵",
      "肉",
      "水产",
      "饱腹",
      "高级",
      "灼热",
      "力量涌现",
      "菌类"
    ],
    "invalidList": [
      "河豚",
      "牛肉",
      "和牛",
      "松露"
    ],
    "time": "凉爽"
  },
  {
    "name": "蓬莱玉枝",
    "cook": "烤架",
    "price": "125",
    "useList": [
      "昂贵",
      "肉",
      "高级",
      "传说",
      "文化底蕴",
      "烧烤"
    ],
    "props": [
      "昂贵",
      "肉",
      "高级",
      "传说",
      "文化底蕴",
      "烧烤"
    ],
    "invalidList": [
      "三文鱼",
      "猪肉",
      "鹿肉",
      "和牛",
      "竹子"
    ],
    "time": "7.8"
  },
  {
    "name": "华光玉煎包",
    "cook": "油锅",
    "price": "128",
    "useList": [
      "昂贵",
      "肉",
      "高级",
      "传说",
      "梦幻",
      "菌类",
      "中华"
    ],
    "props": [
      "昂贵",
      "肉",
      "高级",
      "传说",
      "梦幻",
      "菌类",
      "中华"
    ],
    "invalidList": [
      "黑毛猪肉",
      "蘑菇"
    ],
    "time": "4.8"
  },
  {
    "name": "惠灵顿牛排",
    "cook": "油锅",
    "price": "150",
    "useList": [
      "昂贵",
      "肉",
      "高级",
      "传说",
      "山珍",
      "西式"
    ],
    "props": [
      "昂贵",
      "肉",
      "高级",
      "传说",
      "山珍",
      "西式"
    ],
    "invalidList": [
      "和牛",
      "松露",
      "鸡蛋",
      "黄油",
      "面粉"
    ],
    "time": [
      "甜",
      "凉爽"
    ]
  },
  {
    "name": "腌黄瓜",
    "cook": "料理台",
    "price": "16",
    "useList": [
      "实惠",
      "素",
      "下酒",
      "小巧",
      "咸"
    ],
    "props": [
      "实惠",
      "素",
      "下酒",
      "小巧",
      "咸"
    ],
    "invalidList": [
      "黄瓜",
      "黑盐"
    ],
    "time": "3.6"
  },
  {
    "name": "蘑菇肉片",
    "cook": "油锅",
    "price": "20",
    "useList": [
      "家常",
      "肉",
      "重油",
      "菌类"
    ],
    "props": [
      "家常",
      "肉",
      "重油",
      "菌类"
    ],
    "invalidList": [
      "猪肉",
      "蘑菇"
    ],
    "time": "3.6"
  },
  {
    "name": "炸虾天妇罗",
    "cook": "油锅",
    "price": "22",
    "useList": [
      "下酒",
      "重油"
    ],
    "props": [
      "下酒",
      "重油"
    ],
    "invalidList": [
      "虾",
      "面粉"
    ],
    "time": "清淡"
  },
  {
    "name": "大阪烧",
    "cook": "油锅",
    "price": "24",
    "useList": [
      "招牌",
      "小巧",
      "适合拍照",
      "和风"
    ],
    "props": [
      "招牌",
      "小巧",
      "适合拍照",
      "和风"
    ],
    "invalidList": [
      "萝卜",
      "鸡蛋",
      "面粉"
    ],
    "time": "3.6"
  },
  {
    "name": "奶香蘑菇汤",
    "cook": "煮锅",
    "price": "28",
    "useList": [
      "家常",
      "适合拍照",
      "菌类"
    ],
    "props": [
      "家常",
      "适合拍照",
      "菌类"
    ],
    "invalidList": [
      "土豆",
      "蘑菇",
      "奶油"
    ],
    "time": "4.8"
  },
  {
    "name": "手握寿司",
    "cook": "料理台",
    "price": "28",
    "useList": [
      "水产",
      "清淡",
      "鲜",
      "生",
      "文化底蕴",
      "和风"
    ],
    "props": [
      "水产",
      "清淡",
      "鲜",
      "生",
      "文化底蕴",
      "和风"
    ],
    "invalidList": [
      "三文鱼",
      "金枪鱼"
    ],
    "time": "3.6"
  },
  {
    "name": "章鱼烧",
    "cook": "油锅",
    "price": "36",
    "useList": [
      "招牌",
      "水产",
      "饱腹",
      "小巧",
      "适合拍照"
    ],
    "props": [
      "招牌",
      "水产",
      "饱腹",
      "小巧",
      "适合拍照"
    ],
    "invalidList": [
      "海苔",
      "面粉",
      "章鱼"
    ],
    "time": "4.8"
  },
  {
    "name": "黄金酥鱼饼",
    "cook": "油锅",
    "price": "40",
    "useList": [
      "水产",
      "下酒",
      "重油",
      "力量涌现"
    ],
    "props": [
      "水产",
      "下酒",
      "重油",
      "力量涌现"
    ],
    "invalidList": [
      "鳟鱼",
      "蜂蜜",
      "面粉"
    ],
    "time": "5.4"
  },
  {
    "name": "南瓜虾盅",
    "cook": "蒸锅",
    "price": "55",
    "useList": [
      "水产",
      "饱腹",
      "清淡",
      "甜",
      "鲜",
      "适合拍照",
      "特产"
    ],
    "props": [
      "水产",
      "饱腹",
      "清淡",
      "甜",
      "鲜",
      "适合拍照",
      "特产"
    ],
    "invalidList": [
      "虾",
      "豆腐",
      "南瓜"
    ],
    "time": "5.4"
  },
  {
    "name": "普通小蛋糕",
    "cook": "蒸锅",
    "price": "56",
    "useList": [
      "高级",
      "甜",
      "果味",
      "适合拍照",
      "文化底蕴"
    ],
    "props": [
      "高级",
      "甜",
      "果味",
      "适合拍照",
      "文化底蕴"
    ],
    "invalidList": [
      "鸡蛋",
      "葡萄",
      "奶油"
    ],
    "time": "4.8"
  },
  {
    "name": "秘制鲜菌煲",
    "cook": "煮锅",
    "price": "62",
    "useList": [
      "昂贵",
      "鲜",
      "菌类",
      "特产",
      "和风"
    ],
    "props": [
      "昂贵",
      "鲜",
      "菌类",
      "特产",
      "和风"
    ],
    "invalidList": [
      "蘑菇",
      "松露",
      "露水"
    ],
    "time": "5.4"
  },
  {
    "name": "奶油焗蟹",
    "cook": "油锅",
    "price": "88",
    "useList": [
      "昂贵",
      "招牌",
      "下酒",
      "高级",
      "鲜",
      "海味",
      "适合拍照"
    ],
    "props": [
      "昂贵",
      "招牌",
      "下酒",
      "高级",
      "鲜",
      "海味",
      "适合拍照"
    ],
    "invalidList": [
      "螃蟹",
      "奶油"
    ],
    "time": "7.2"
  },
  {
    "name": "七色羊羹",
    "cook": "蒸锅",
    "price": "92",
    "useList": [
      "昂贵",
      "高级",
      "甜",
      "果味",
      "梦幻",
      "不可思议",
      "适合拍照",
      "文化底蕴"
    ],
    "props": [
      "昂贵",
      "高级",
      "甜",
      "果味",
      "梦幻",
      "不可思议",
      "适合拍照",
      "文化底蕴"
    ],
    "invalidList": [
      "海苔",
      "幻昙华",
      "露水",
      "葡萄"
    ],
    "time": "4.8"
  },
  {
    "name": "海胆刺身",
    "cook": "料理台",
    "price": "108",
    "useList": [
      "昂贵",
      "小巧",
      "高级",
      "甜",
      "海味",
      "不可思议",
      "适合拍照",
      "特产"
    ],
    "props": [
      "昂贵",
      "小巧",
      "高级",
      "甜",
      "海味",
      "不可思议",
      "适合拍照",
      "特产"
    ],
    "invalidList": [
      "露水",
      "海胆"
    ],
    "time": "4.8"
  },
  {
    "name": "蘑女的舞踏烩",
    "cook": "煮锅",
    "price": "112",
    "useList": [
      "昂贵",
      "水产",
      "重油",
      "辣",
      "咸",
      "鲜",
      "灼热",
      "适合拍照",
      "菌类"
    ],
    "props": [
      "昂贵",
      "水产",
      "重油",
      "辣",
      "咸",
      "鲜",
      "灼热",
      "适合拍照",
      "菌类"
    ],
    "invalidList": [
      "虾",
      "蘑菇",
      "辣椒",
      "章鱼"
    ],
    "time": "8.4"
  },
  {
    "name": "全肉盛宴",
    "cook": "烤架",
    "price": "115",
    "useList": [
      "昂贵",
      "肉",
      "下酒",
      "大份",
      "高级",
      "咸",
      "山珍",
      "灼热",
      "适合拍照"
    ],
    "props": [
      "昂贵",
      "肉",
      "下酒",
      "大份",
      "高级",
      "咸",
      "山珍",
      "灼热",
      "适合拍照"
    ],
    "invalidList": [
      "鹿肉",
      "野猪肉",
      "黑毛猪肉",
      "和牛"
    ],
    "time": "8.4"
  },
  {
    "name": "拟尻子玉",
    "cook": "煮锅",
    "price": "120",
    "useList": [
      "昂贵",
      "下酒",
      "小巧",
      "传说",
      "梦幻",
      "猎奇",
      "灼热"
    ],
    "props": [
      "昂贵",
      "下酒",
      "小巧",
      "传说",
      "梦幻",
      "猎奇",
      "灼热"
    ],
    "invalidList": [
      "鹿肉",
      "松露",
      "蝉蜕"
    ],
    "time": "7.2"
  },
  {
    "name": "幻想佛跳墙",
    "cook": "煮锅",
    "price": "160",
    "useList": [
      "昂贵",
      "肉",
      "水产",
      "高级",
      "传说",
      "山珍",
      "力量涌现",
      "适合拍照",
      "文化底蕴",
      "菌类",
      "特产",
      "中华"
    ],
    "props": [
      "昂贵",
      "肉",
      "水产",
      "高级",
      "传说",
      "山珍",
      "力量涌现",
      "适合拍照",
      "文化底蕴",
      "菌类",
      "特产",
      "中华"
    ],
    "invalidList": [
      "极上金枪鱼",
      "河豚",
      "黑毛猪肉",
      "和牛",
      "松露"
    ],
    "time": "10.8"
  },
  {
    "name": "丧气芝士条",
    "cook": "蒸锅",
    "price": "25",
    "useList": [
      "下酒",
      "咸",
      "鲜",
      "特产"
    ],
    "props": [
      "下酒",
      "咸",
      "鲜",
      "特产"
    ],
    "invalidList": [
      "白果",
      "白果",
      "芝士"
    ],
    "time": "3.6"
  },
  {
    "name": "芝士蛋",
    "cook": "油锅",
    "price": "26",
    "useList": [
      "重油",
      "咸",
      "鲜",
      "生"
    ],
    "props": [
      "重油",
      "咸",
      "鲜",
      "生"
    ],
    "invalidList": [
      "鸡蛋",
      "芝士"
    ],
    "time": "肉"
  },
  {
    "name": "猫饭",
    "cook": "料理台",
    "price": "26",
    "useList": [
      "水产",
      "小巧",
      "鲜"
    ],
    "props": [
      "水产",
      "小巧",
      "鲜"
    ],
    "invalidList": [
      "鳟鱼",
      "露水",
      "面粉"
    ],
    "time": "重油"
  },
  {
    "name": "狮子头",
    "cook": "煮锅",
    "price": "28",
    "useList": [
      "招牌",
      "肉",
      "下酒",
      "鲜",
      "特产"
    ],
    "props": [
      "招牌",
      "肉",
      "下酒",
      "鲜",
      "特产"
    ],
    "invalidList": "牛肉",
    "time": [
      "水产",
      "饱腹"
    ]
  },
  {
    "name": "樱花布丁",
    "cook": "蒸锅",
    "price": "32",
    "useList": [
      "小巧",
      "甜",
      "果味",
      "凉爽",
      "适合拍照",
      "特产"
    ],
    "props": [
      "小巧",
      "甜",
      "果味",
      "凉爽",
      "适合拍照",
      "特产"
    ],
    "invalidList": [
      "桃子",
      "蜂蜜"
    ],
    "time": [
      "重油",
      "咸"
    ]
  },
  {
    "name": "阴郁水果派",
    "cook": "料理台",
    "price": "36",
    "useList": [
      "酸",
      "咸",
      "鲜",
      "果味",
      "特产"
    ],
    "props": [
      "酸",
      "咸",
      "鲜",
      "果味",
      "特产"
    ],
    "invalidList": [
      "葡萄",
      "柠檬",
      "芝士"
    ],
    "time": "4.8"
  },
  {
    "name": "提神布丁",
    "cook": "蒸锅",
    "price": "42",
    "useList": [
      "小巧",
      "酸",
      "甜",
      "果味",
      "凉爽",
      "力量涌现"
    ],
    "props": [
      "小巧",
      "酸",
      "甜",
      "果味",
      "凉爽",
      "力量涌现"
    ],
    "invalidList": [
      "葡萄",
      "葡萄",
      "柠檬"
    ],
    "time": [
      "重油",
      "咸"
    ]
  },
  {
    "name": "脆旋风",
    "cook": "料理台",
    "price": "42",
    "useList": [
      "饱腹",
      "生",
      "猎奇",
      "特产"
    ],
    "props": [
      "饱腹",
      "生",
      "猎奇",
      "特产"
    ],
    "invalidList": [
      "蜂蜜",
      "蝉蜕",
      "面粉"
    ],
    "time": "重油"
  },
  {
    "name": "三文鱼天妇罗",
    "cook": "油锅",
    "price": "44",
    "useList": [
      "水产",
      "重油",
      "小巧",
      "高级",
      "鲜"
    ],
    "props": [
      "水产",
      "重油",
      "小巧",
      "高级",
      "鲜"
    ],
    "invalidList": [
      "三文鱼",
      "鸡蛋",
      "黄油",
      "面粉"
    ],
    "time": "4.8"
  },
  {
    "name": "巨人玉子烧",
    "cook": "油锅",
    "price": "60",
    "useList": [
      "饱腹",
      "高级",
      "甜",
      "力量涌现",
      "和风"
    ],
    "props": [
      "饱腹",
      "高级",
      "甜",
      "力量涌现",
      "和风"
    ],
    "invalidList": [
      "鸡蛋",
      "鸡蛋",
      "面粉",
      "面粉"
    ],
    "time": "下酒"
  },
  {
    "name": "一击☆必杀",
    "cook": "烤架",
    "price": "62",
    "useList": [
      "昂贵",
      "肉",
      "饱腹",
      "重油",
      "山珍",
      "力量涌现",
      "烧烤"
    ],
    "props": [
      "昂贵",
      "肉",
      "饱腹",
      "重油",
      "山珍",
      "力量涌现",
      "烧烤"
    ],
    "invalidList": [
      "鹿肉",
      "野猪肉",
      "洋葱"
    ],
    "time": "5.4"
  },
  {
    "name": "仰望天花板派",
    "cook": "蒸锅",
    "price": "66",
    "useList": [
      "昂贵",
      "招牌",
      "下酒",
      "海味",
      "猎奇",
      "适合拍照",
      "特产"
    ],
    "props": [
      "昂贵",
      "招牌",
      "下酒",
      "海味",
      "猎奇",
      "适合拍照",
      "特产"
    ],
    "invalidList": [
      "鳟鱼",
      "桃子",
      "面粉"
    ],
    "time": "肉"
  },
  {
    "name": "燃尽布丁",
    "cook": "蒸锅",
    "price": "73",
    "useList": [
      "昂贵",
      "招牌",
      "小巧",
      "酸",
      "甜",
      "果味",
      "凉爽",
      "梦幻",
      "力量涌现"
    ],
    "props": [
      "昂贵",
      "招牌",
      "小巧",
      "酸",
      "甜",
      "果味",
      "凉爽",
      "梦幻",
      "力量涌现"
    ],
    "invalidList": [
      "蜂蜜",
      "葡萄",
      "柠檬",
      "柠檬"
    ],
    "time": [
      "重油",
      "咸"
    ]
  },
  {
    "name": "绝叫关东煮",
    "cook": "煮锅",
    "price": "92",
    "useList": [
      "昂贵",
      "肉",
      "饱腹",
      "大份",
      "高级",
      "辣",
      "鲜",
      "灼热",
      "力量涌现",
      "特产"
    ],
    "props": [
      "昂贵",
      "肉",
      "饱腹",
      "大份",
      "高级",
      "辣",
      "鲜",
      "灼热",
      "力量涌现",
      "特产"
    ],
    "invalidList": [
      "牛肉",
      "豆腐",
      "萝卜",
      "辣椒",
      "辣椒"
    ],
    "time": "7.2"
  },
  {
    "name": "兜甲蒸糕",
    "cook": "蒸锅",
    "price": "105",
    "useList": [
      "昂贵",
      "招牌",
      "饱腹",
      "高级",
      "鲜",
      "生",
      "猎奇",
      "力量涌现",
      "适合拍照",
      "特产"
    ],
    "props": [
      "昂贵",
      "招牌",
      "饱腹",
      "高级",
      "鲜",
      "生",
      "猎奇",
      "力量涌现",
      "适合拍照",
      "特产"
    ],
    "invalidList": [
      "黑毛猪肉",
      "蜂蜜",
      "蝉蜕",
      "面粉"
    ],
    "time": "7.2"
  },
  {
    "name": "地狱激辛警告！",
    "cook": "油锅",
    "price": "108",
    "useList": [
      "昂贵",
      "肉",
      "重油",
      "辣",
      "咸",
      "猎奇",
      "灼热",
      "力量涌现",
      "适合拍照"
    ],
    "props": [
      "昂贵",
      "肉",
      "重油",
      "辣",
      "咸",
      "猎奇",
      "灼热",
      "力量涌现",
      "适合拍照"
    ],
    "invalidList": [
      "牛肉",
      "辣椒",
      "辣椒",
      "辣椒",
      "芝士"
    ],
    "time": [
      "素",
      "清淡"
    ]
  },
  {
    "name": "鱼跃龙门",
    "cook": "蒸锅",
    "price": "142",
    "useList": [
      "昂贵",
      "肉",
      "水产",
      "大份",
      "高级",
      "甜",
      "鲜",
      "海味",
      "梦幻",
      "文化底蕴",
      "菌类",
      "中华"
    ],
    "props": [
      "昂贵",
      "肉",
      "水产",
      "大份",
      "高级",
      "甜",
      "鲜",
      "海味",
      "梦幻",
      "文化底蕴",
      "菌类",
      "中华"
    ],
    "invalidList": [
      "极上金枪鱼",
      "鹿肉",
      "松露",
      "蜂蜜",
      "月光草"
    ],
    "time": "7.2"
  },
  {
    "name": "大江户船祭",
    "cook": "料理台",
    "price": "206",
    "useList": [
      "昂贵",
      "招牌",
      "水产",
      "下酒",
      "高级",
      "传说",
      "鲜",
      "生",
      "海味",
      "适合拍照",
      "文化底蕴",
      "和风"
    ],
    "props": [
      "昂贵",
      "招牌",
      "水产",
      "下酒",
      "高级",
      "传说",
      "鲜",
      "生",
      "海味",
      "适合拍照",
      "文化底蕴",
      "和风"
    ],
    "invalidList": [
      "鳟鱼",
      "三文鱼",
      "金枪鱼",
      "极上金枪鱼",
      "冰块"
    ],
    "time": "14.4"
  },
  {
    "name": "云山棉花糖",
    "cook": "油锅",
    "price": "20",
    "useList": [
      "甜",
      "果味",
      "不可思议",
      "特产"
    ],
    "props": [
      "甜",
      "果味",
      "不可思议",
      "特产"
    ],
    "invalidList": [
      "桃子",
      "蜂蜜"
    ],
    "time": [
      "肉",
      "咸"
    ]
  },
  {
    "name": "烤地瓜",
    "cook": "烤架",
    "price": "25",
    "useList": [
      "实惠",
      "家常",
      "饱腹",
      "甜"
    ],
    "props": [
      "实惠",
      "家常",
      "饱腹",
      "甜"
    ],
    "invalidList": "地瓜",
    "time": "下酒"
  },
  {
    "name": "比斯开湾饼干",
    "cook": "烤架",
    "price": "26",
    "useList": [
      "饱腹",
      "咸",
      "灼热"
    ],
    "props": [
      "饱腹",
      "咸",
      "灼热"
    ],
    "invalidList": [
      "面粉",
      "芝士"
    ],
    "time": "酸"
  },
  {
    "name": "拔丝地瓜",
    "cook": "油锅",
    "price": "30",
    "useList": [
      "家常",
      "素",
      "饱腹",
      "甜"
    ],
    "props": [
      "家常",
      "素",
      "饱腹",
      "甜"
    ],
    "invalidList": [
      "蜂蜜",
      "地瓜"
    ],
    "time": "生"
  },
  {
    "name": "蜜饯栗子",
    "cook": "料理台",
    "price": "30",
    "useList": [
      "小巧",
      "甜",
      "特产"
    ],
    "props": [
      "小巧",
      "甜",
      "特产"
    ],
    "invalidList": [
      "蜂蜜",
      "板栗"
    ],
    "time": "3.6"
  },
  {
    "name": "瘦马团子",
    "cook": "料理台",
    "price": "45",
    "useList": [
      "饱腹",
      "猎奇",
      "适合拍照",
      "文化底蕴"
    ],
    "props": [
      "饱腹",
      "猎奇",
      "适合拍照",
      "文化底蕴"
    ],
    "invalidList": [
      "糯米",
      "糯米"
    ],
    "time": "肉"
  },
  {
    "name": "松子糕",
    "cook": "蒸锅",
    "price": "46",
    "useList": [
      "清淡",
      "特产"
    ],
    "props": [
      "清淡",
      "特产"
    ],
    "invalidList": [
      "糯米",
      "松子"
    ],
    "time": "4.8"
  },
  {
    "name": "天师板栗焖菇",
    "cook": "煮锅",
    "price": "55",
    "useList": [
      "家常",
      "素",
      "菌类",
      "特产",
      "中华"
    ],
    "props": [
      "家常",
      "素",
      "菌类",
      "特产",
      "中华"
    ],
    "invalidList": [
      "蘑菇",
      "松露",
      "板栗"
    ],
    "time": "4.8"
  },
  {
    "name": "圣白莲子糕",
    "cook": "蒸锅",
    "price": "56",
    "useList": [
      "素",
      "清淡",
      "小巧",
      "适合拍照",
      "特产"
    ],
    "props": [
      "素",
      "清淡",
      "小巧",
      "适合拍照",
      "特产"
    ],
    "invalidList": [
      "白果",
      "黄油",
      "面粉",
      "莲子"
    ],
    "time": "辣"
  },
  {
    "name": "海盗熏肉",
    "cook": "烤架",
    "price": "58",
    "useList": [
      "肉",
      "大份",
      "传说",
      "力量涌现",
      "特产"
    ],
    "props": [
      "肉",
      "大份",
      "传说",
      "力量涌现",
      "特产"
    ],
    "invalidList": [
      "牛肉",
      "蜂蜜",
      "辣椒",
      "黑盐"
    ],
    "time": "酸"
  },
  {
    "name": "香煎双菇肉卷",
    "cook": "油锅",
    "price": "63",
    "useList": [
      "昂贵",
      "招牌",
      "家常",
      "肉",
      "下酒",
      "重油",
      "灼热",
      "菌类"
    ],
    "props": [
      "昂贵",
      "招牌",
      "家常",
      "肉",
      "下酒",
      "重油",
      "灼热",
      "菌类"
    ],
    "invalidList": [
      "猪肉",
      "蘑菇",
      "松露"
    ],
    "time": "凉爽"
  },
  {
    "name": "白鹿贞松",
    "cook": "蒸锅",
    "price": "72",
    "useList": [
      "昂贵",
      "肉",
      "高级",
      "山珍",
      "文化底蕴",
      "特产"
    ],
    "props": [
      "昂贵",
      "肉",
      "高级",
      "山珍",
      "文化底蕴",
      "特产"
    ],
    "invalidList": [
      "鹿肉",
      "白果",
      "松子"
    ],
    "time": "酸"
  },
  {
    "name": "什锦天妇罗",
    "cook": "油锅",
    "price": "72",
    "useList": [
      "昂贵",
      "招牌",
      "家常",
      "下酒",
      "重油",
      "力量涌现",
      "菌类",
      "和风"
    ],
    "props": [
      "昂贵",
      "招牌",
      "家常",
      "下酒",
      "重油",
      "力量涌现",
      "菌类",
      "和风"
    ],
    "invalidList": [
      "八目鳗",
      "黑毛猪肉",
      "松露",
      "月光草"
    ],
    "time": "4.2"
  },
  {
    "name": "惊吓！大冒险",
    "cook": "蒸锅",
    "price": "90",
    "useList": [
      "昂贵",
      "梦幻",
      "猎奇",
      "不可思议",
      "力量涌现",
      "适合拍照",
      "特产"
    ],
    "props": [
      "昂贵",
      "梦幻",
      "猎奇",
      "不可思议",
      "力量涌现",
      "适合拍照",
      "特产"
    ],
    "invalidList": [
      "蘑菇",
      "蜂蜜",
      "幻昙华",
      "奶油"
    ],
    "time": "家常"
  },
  {
    "name": "荷花鱼米盏",
    "cook": "蒸锅",
    "price": "94",
    "useList": [
      "昂贵",
      "水产",
      "清淡",
      "传说",
      "梦幻",
      "不可思议",
      "文化底蕴",
      "中华"
    ],
    "props": [
      "昂贵",
      "水产",
      "清淡",
      "传说",
      "梦幻",
      "不可思议",
      "文化底蕴",
      "中华"
    ],
    "invalidList": [
      "极上金枪鱼",
      "露水",
      "并蒂莲",
      "莲子"
    ],
    "time": "6.6"
  },
  {
    "name": "罗汉上素",
    "cook": "煮锅",
    "price": "97",
    "useList": [
      "昂贵",
      "素",
      "清淡",
      "高级",
      "鲜",
      "凉爽",
      "梦幻",
      "文化底蕴",
      "特产"
    ],
    "props": [
      "昂贵",
      "素",
      "清淡",
      "高级",
      "鲜",
      "凉爽",
      "梦幻",
      "文化底蕴",
      "特产"
    ],
    "invalidList": [
      "松露",
      "竹笋",
      "幻昙华",
      "莲子",
      "松子"
    ],
    "time": [
      "肉",
      "辣"
    ]
  },
  {
    "name": "幻想星莲船",
    "cook": "料理台",
    "price": "132",
    "useList": [
      "昂贵",
      "招牌",
      "高级",
      "鲜",
      "生",
      "凉爽",
      "梦幻",
      "不可思议",
      "适合拍照",
      "特产"
    ],
    "props": [
      "昂贵",
      "招牌",
      "高级",
      "鲜",
      "生",
      "凉爽",
      "梦幻",
      "不可思议",
      "适合拍照",
      "特产"
    ],
    "invalidList": [
      "金枪鱼",
      "南瓜",
      "月光草",
      "并蒂莲",
      "莲子"
    ],
    "time": "猎奇"
  },
  {
    "name": "太极八卦鱼肚",
    "cook": "煮锅",
    "price": "136",
    "useList": [
      "昂贵",
      "水产",
      "清淡",
      "高级",
      "鲜",
      "凉爽",
      "文化底蕴"
    ],
    "props": [
      "昂贵",
      "水产",
      "清淡",
      "高级",
      "鲜",
      "凉爽",
      "文化底蕴"
    ],
    "invalidList": [
      "极上金枪鱼",
      "萝卜",
      "蘑菇",
      "鸡蛋",
      "白果"
    ],
    "time": "8.4"
  },
  {
    "name": "绿野仙菇",
    "cook": "煮锅",
    "price": "24",
    "useList": [
      "清淡",
      "文化底蕴",
      "菌类",
      "特产"
    ],
    "props": [
      "清淡",
      "文化底蕴",
      "菌类",
      "特产"
    ],
    "invalidList": [
      "蘑菇",
      "香椿"
    ],
    "time": "3.6"
  },
  {
    "name": "炸番茄条",
    "cook": "油锅",
    "price": "26",
    "useList": [
      "小巧",
      "猎奇",
      "不可思议"
    ],
    "props": [
      "小巧",
      "猎奇",
      "不可思议"
    ],
    "invalidList": [
      "土豆",
      "西红柿"
    ],
    "time": "水产"
  },
  {
    "name": "红豆大福",
    "cook": "料理台",
    "price": "28",
    "useList": [
      "小巧",
      "甜",
      "和风"
    ],
    "props": [
      "小巧",
      "甜",
      "和风"
    ],
    "invalidList": [
      "糯米",
      "红豆"
    ],
    "time": "4.2"
  },
  {
    "name": "香椿煎饼",
    "cook": "油锅",
    "price": "30",
    "useList": [
      "招牌",
      "特产"
    ],
    "props": [
      "招牌",
      "特产"
    ],
    "invalidList": [
      "鸡蛋",
      "香椿"
    ],
    "time": "3.6"
  },
  {
    "name": "梅子茶泡饭",
    "cook": "煮锅",
    "price": "32",
    "useList": [
      "家常",
      "和风"
    ],
    "props": [
      "家常",
      "和风"
    ],
    "invalidList": [
      "海苔",
      "梅子"
    ],
    "time": "2.4"
  },
  {
    "name": "铜锣烧",
    "cook": "油锅",
    "price": "40",
    "useList": [
      "素",
      "甜",
      "特产",
      "和风"
    ],
    "props": [
      "素",
      "甜",
      "特产",
      "和风"
    ],
    "invalidList": [
      "鸡蛋",
      "面粉",
      "红豆"
    ],
    "time": "肉"
  },
  {
    "name": "石锅竹笋炖肉",
    "cook": "煮锅",
    "price": "42",
    "useList": [
      "家常",
      "肉",
      "饱腹"
    ],
    "props": [
      "家常",
      "肉",
      "饱腹"
    ],
    "invalidList": [
      "猪肉",
      "竹笋",
      "竹子"
    ],
    "time": "4.2"
  },
  {
    "name": "蜜桃红烧肉",
    "cook": "油锅",
    "price": "42",
    "useList": [
      "肉",
      "下酒",
      "果味",
      "不可思议"
    ],
    "props": [
      "肉",
      "下酒",
      "果味",
      "不可思议"
    ],
    "invalidList": [
      "猪肉",
      "桃子",
      "蜂蜜"
    ],
    "time": "4.8"
  },
  {
    "name": "毒瘴花园",
    "cook": "煮锅",
    "price": "58",
    "useList": [
      "招牌",
      "水产",
      "毒",
      "猎奇"
    ],
    "props": [
      "招牌",
      "水产",
      "毒",
      "猎奇"
    ],
    "invalidList": [
      "八目鳗",
      "河豚",
      "白果",
      "梅子"
    ],
    "time": "4.8"
  },
  {
    "name": "竹筒粉蒸肉",
    "cook": "蒸锅",
    "price": "72",
    "useList": [
      "昂贵",
      "家常",
      "肉",
      "山珍"
    ],
    "props": [
      "昂贵",
      "家常",
      "肉",
      "山珍"
    ],
    "invalidList": [
      "黑毛猪肉",
      "露水",
      "竹子"
    ],
    "time": "生"
  },
  {
    "name": "花鸟风月",
    "cook": "蒸锅",
    "price": "78",
    "useList": [
      "昂贵",
      "高级",
      "梦幻",
      "不可思议",
      "特产"
    ],
    "props": [
      "昂贵",
      "高级",
      "梦幻",
      "不可思议",
      "特产"
    ],
    "invalidList": [
      "月光草",
      "奶油",
      "鲜花"
    ],
    "time": [
      "重油",
      "灼热"
    ]
  },
  {
    "name": "小小的甜蜜「毒药」",
    "cook": "蒸锅",
    "price": "87",
    "useList": [
      "昂贵",
      "小巧",
      "高级",
      "甜",
      "梦幻",
      "适合拍照"
    ],
    "props": [
      "昂贵",
      "小巧",
      "高级",
      "甜",
      "梦幻",
      "适合拍照"
    ],
    "invalidList": [
      "白果",
      "幻昙华",
      "葡萄",
      "奶油"
    ],
    "time": "肉"
  },
  {
    "name": "翠竹迎春",
    "cook": "蒸锅",
    "price": "99",
    "useList": [
      "昂贵",
      "招牌",
      "高级",
      "山珍",
      "适合拍照",
      "文化底蕴"
    ],
    "props": [
      "昂贵",
      "招牌",
      "高级",
      "山珍",
      "适合拍照",
      "文化底蕴"
    ],
    "invalidList": [
      "鹿肉",
      "萝卜",
      "鸡蛋",
      "月光草",
      "黄瓜"
    ],
    "time": [
      "猎奇",
      "菌类"
    ]
  },
  {
    "name": "海胆蒸蛋",
    "cook": "蒸锅",
    "price": "112",
    "useList": [
      "昂贵",
      "鲜",
      "海味",
      "适合拍照"
    ],
    "props": [
      "昂贵",
      "鲜",
      "海味",
      "适合拍照"
    ],
    "invalidList": [
      "鸡蛋",
      "海胆"
    ],
    "time": "山珍"
  },
  {
    "name": "汉宫藏娇",
    "cook": "煮锅",
    "price": "115",
    "useList": [
      "昂贵",
      "水产",
      "高级",
      "传说",
      "猎奇",
      "文化底蕴",
      "汤羹",
      "中华"
    ],
    "props": [
      "昂贵",
      "水产",
      "高级",
      "传说",
      "猎奇",
      "文化底蕴",
      "汤羹",
      "中华"
    ],
    "invalidList": [
      "八目鳗",
      "豆腐",
      "露水",
      "竹子",
      "螃蟹"
    ],
    "time": "重油"
  },
  {
    "name": "逆转天地！",
    "cook": "料理台",
    "price": "124",
    "useList": [
      "昂贵",
      "山珍",
      "凉爽",
      "梦幻",
      "猎奇",
      "不可思议",
      "燃起来了",
      "菌类"
    ],
    "props": [
      "昂贵",
      "山珍",
      "凉爽",
      "梦幻",
      "猎奇",
      "不可思议",
      "燃起来了",
      "菌类"
    ],
    "invalidList": [
      "黑毛猪肉",
      "松露",
      "竹子",
      "梅子",
      "鲜花"
    ],
    "time": "7.2"
  },
  {
    "name": "幽梦",
    "cook": "蒸锅",
    "price": "133",
    "useList": [
      "昂贵",
      "清淡",
      "高级",
      "甜",
      "凉爽",
      "梦幻",
      "适合拍照",
      "西式"
    ],
    "props": [
      "昂贵",
      "清淡",
      "高级",
      "甜",
      "凉爽",
      "梦幻",
      "适合拍照",
      "西式"
    ],
    "invalidList": [
      "幻昙华",
      "露水",
      "月光草",
      "奶油",
      "鲜花"
    ],
    "time": [
      "肉",
      "水产",
      "下酒"
    ]
  },
  {
    "name": "幻想风靡",
    "cook": "烤架",
    "price": "185",
    "useList": [
      "昂贵",
      "招牌",
      "肉",
      "饱腹",
      "重油",
      "生",
      "力量涌现",
      "适合拍照"
    ],
    "props": [
      "昂贵",
      "招牌",
      "肉",
      "饱腹",
      "重油",
      "生",
      "力量涌现",
      "适合拍照"
    ],
    "invalidList": [
      "牛肉",
      "野猪肉",
      "洋葱",
      "松露",
      "西红柿"
    ],
    "time": [
      "清淡",
      "凉爽"
    ]
  }
]
export const wineList = [
  {
    "name": "绿茶",
    "price": "1",
    "props": [
      "无酒精"
    ],
    "unlock": "初始拥有                                                                                                                                                      "
  },
  {
    "name": "牛奶",
    "price": "16",
    "props": [
      "无酒精",
      "直饮"
    ],
    "unlock": "人间之里清兰屋处购买                                                                                                                                  "
  },
  {
    "name": "红柚果汁",
    "price": "24",
    "props": [
      "无酒精",
      "水果"
    ],
    "unlock": "人间之里清兰屋处购买                                                                                                                              "
  },
  {
    "name": "红魔馆红茶",
    "price": "25",
    "props": [
      "无酒精",
      "可加热",
      "水果",
      "提神"
    ],
    "unlock": "红魔馆小恶魔处购买                                                                                                                    "
  },
  {
    "name": "波子汽水",
    "price": "30",
    "props": [
      "无酒精",
      "现代",
      "气泡"
    ],
    "unlock": "人间之里铃瑚屋处购买                                                                                                                          "
  },
  {
    "name": "“大冰棍儿！”",
    "price": "35",
    "props": [
      "无酒精",
      "现代",
      "提神",
      "甘"
    ],
    "unlock": "妖怪兽道三妖精处购买                                                                                                                  "
  },
  {
    "name": "阿芙加朵",
    "price": "35",
    "props": [
      "无酒精",
      "可加冰",
      "提神",
      "甘",
      "苦"
    ],
    "unlock": "红魔馆小恶魔处购买                                                                                                                "
  },
  {
    "name": "冰山毛玉冻柠",
    "price": "45",
    "props": [
      "无酒精",
      "可加冰",
      "气泡",
      "水果",
      "提神",
      "直饮",
      "甘"
    ],
    "unlock": "妖怪兽道萌澄果处购买                                                                                              "
  },
  {
    "name": "月面火箭",
    "price": "45",
    "props": [
      "无酒精",
      "可加冰",
      "现代",
      "气泡"
    ],
    "unlock": [
      "迷途竹林西侧泉水处",
      "地灵殿西北侧游乐场处（概率）采集                                                                                  "
    ]
  },
  {
    "name": "玉露茶",
    "price": "50",
    "props": [
      "无酒精",
      "可加热",
      "古典"
    ],
    "unlock": "地灵殿西南侧酒水架处采集，博丽神社河童处（概率）购买                                                                                          "
  },
  {
    "name": "果味High Ball",
    "price": "12",
    "props": [
      "低酒精",
      "可加冰",
      "西洋酒",
      "鸡尾酒",
      "水果",
      "甘",
      "苦"
    ],
    "unlock": "妖怪兽道商人处购买                                                                                            "
  },
  {
    "name": "果味SOUR",
    "price": "12",
    "props": [
      "低酒精",
      "可加冰",
      "烧酒",
      "鸡尾酒",
      "水果",
      "甘",
      "苦"
    ],
    "unlock": "妖怪兽道商人处购买                                                                                                    "
  },
  {
    "name": "淇",
    "price": "18",
    "props": [
      "低酒精",
      "可加冰",
      "清酒",
      "鸡尾酒",
      "气泡",
      "甘",
      "苦",
      "辛"
    ],
    "unlock": [
      "妖怪兽道商人处",
      "人间之里酒屋处购买                                                                                        "
    ]
  },
  {
    "name": "超ZUN啤酒",
    "price": "18",
    "props": [
      "低酒精",
      "可加冰",
      "啤酒",
      "苦"
    ],
    "unlock": "人间之里酒屋处购买                                                                                                                    "
  },
  {
    "name": "猩红恶魔",
    "price": "45",
    "props": [
      "低酒精",
      "可加冰",
      "西洋酒",
      "鸡尾酒"
    ],
    "unlock": "博丽神社妖精女仆处购买                                                                                                            "
  },
  {
    "name": "冬酿",
    "price": "60",
    "props": [
      "低酒精",
      "可加冰",
      "可加热",
      "古典",
      "甘"
    ],
    "unlock": [
      "香霖堂处（概率）",
      "迷途竹林妖怪兔处",
      "旧地狱鬼商处",
      "神灵庙道士处",
      "太阳花田太阳花精处购买                                            "
    ]
  },
  {
    "name": "梅酒",
    "price": "32",
    "props": [
      "中酒精",
      "可加冰",
      "可加热",
      "利口酒",
      "水果"
    ],
    "unlock": "人间之里酒屋处购买                                                                                                            "
  },
  {
    "name": "日月星",
    "price": "34",
    "props": [
      "中酒精",
      "可加冰",
      "可加热",
      "清酒",
      "直饮"
    ],
    "unlock": "人间之里酒屋处购买                                                                                                                "
  },
  {
    "name": "神之麦",
    "price": "45",
    "props": [
      "中酒精",
      "可加冰",
      "可加热",
      "烧酒",
      "直饮"
    ],
    "unlock": [
      "博丽神社河童处",
      "神灵庙道士处购买                                                                                                  "
    ]
  },
  {
    "name": "雀酒",
    "price": "50",
    "props": [
      "中酒精",
      "可加冰",
      "可加热",
      "清酒",
      "辛"
    ],
    "unlock": [
      "妖怪兽道东南侧路灯附近",
      "太阳花田南侧银杏树附近采集                                                                                "
    ]
  },
  {
    "name": "红雾",
    "price": "75",
    "props": [
      "中酒精",
      "可加热",
      "西洋酒"
    ],
    "unlock": [
      "红魔馆小恶魔处",
      "辉针城不良少年处购买                                                                                                          "
    ]
  },
  {
    "name": "尼格罗尼",
    "price": "100",
    "props": [
      "中酒精",
      "可加冰",
      "西洋酒",
      "鸡尾酒",
      "水果",
      "苦"
    ],
    "unlock": [
      "地灵殿西南侧酒水架处",
      "太阳花田东侧向日葵处",
      "辉针城东侧酒窖处（概率）采集，红魔馆妖精女仆处购买                        "
    ]
  },
  {
    "name": "水獭祭",
    "price": "130",
    "props": [
      "中酒精",
      "可加冰",
      "可加热",
      "清酒",
      "直饮"
    ],
    "unlock": [
      "妖怪兽道南侧码头附近",
      "太阳花田东侧向日葵处",
      "辉针城东侧酒窖处（概率）采集，命莲寺娜兹玲处购买                                      "
    ]
  },
  {
    "name": "风祝",
    "price": "130",
    "props": [
      "中酒精",
      "可加冰",
      "鸡尾酒",
      "现代",
      "甘"
    ],
    "unlock": [
      "博丽神社西侧守矢分社处（概率）祈愿，太阳花田东侧向日葵处",
      "辉针城东侧酒窖处（概率）采集，太阳花田太阳花精处购买                    "
    ]
  },
  {
    "name": "十四夜",
    "price": "440",
    "props": [
      "中酒精",
      "可加冰",
      "可加热",
      "清酒",
      "古典",
      "甘"
    ],
    "unlock": "辉针城东侧酒窖处（概率）采集，迷途竹林妖怪兔处购买                                                                            "
  },
  {
    "name": "天狗踊",
    "price": "70",
    "props": [
      "高酒精",
      "可加冰",
      "可加热",
      "清酒",
      "直饮"
    ],
    "unlock": [
      "博丽神社河童处",
      "旧地狱鬼商处购买                                                                                                  "
    ]
  },
  {
    "name": "教父",
    "price": "180",
    "props": [
      "高酒精",
      "可加冰",
      "西洋酒",
      "鸡尾酒",
      "古典",
      "苦"
    ],
    "unlock": [
      "地灵殿西南侧酒水架处",
      "辉针城东侧酒窖处（概率）采集，红魔馆妖精女仆处",
      "辉针城不良少年处购买                                "
    ]
  },
  {
    "name": "晓",
    "price": "400",
    "props": [
      "高酒精",
      "可加冰",
      "西洋酒",
      "直饮"
    ],
    "unlock": [
      "地灵殿西南侧酒水架处",
      "辉针城东侧酒窖处（概率）采集，博丽神社妖精女仆处（概率）购买                                                        "
    ]
  },
  {
    "name": "火鼠裘",
    "price": "420",
    "props": [
      "高酒精",
      "可加热",
      "烧酒",
      "辛"
    ],
    "unlock": "辉针城东侧酒窖处（概率）采集，旧地狱鬼商处购买                                                                                            "
  },
  {
    "name": "古法奶油冰沙",
    "price": "42",
    "props": [
      "无酒精",
      "可加冰",
      "古典",
      "甘"
    ],
    "unlock": "魔法森林上海人形处购买                                                                                                            "
  },
  {
    "name": "咖啡",
    "price": "62",
    "props": [
      "无酒精",
      "可加冰",
      "可加热",
      "现代",
      "提神",
      "苦"
    ],
    "unlock": "魔法森林上海人形处购买                                                                                                        "
  },
  {
    "name": "妖精雨露",
    "price": "80",
    "props": [
      "无酒精",
      "可加冰",
      "甘"
    ],
    "unlock": "魔法森林中部树根处采集                                                                                                                        "
  },
  {
    "name": "普通健身茶",
    "price": "32",
    "props": [
      "中酒精",
      "利口酒",
      "气泡",
      "苦"
    ],
    "unlock": "魔法森林上海人形处购买                                                                                                                "
  },
  {
    "name": "大吟酿",
    "price": "210",
    "props": [
      "中酒精",
      "可加冰",
      "清酒",
      "古典",
      "水果",
      "直饮",
      "甘"
    ],
    "unlock": "妖怪之山河童处购买                                                                                                        "
  },
  {
    "name": "古明地冰激凌",
    "price": "35",
    "props": [
      "无酒精",
      "现代",
      "水果",
      "甘"
    ],
    "unlock": "地灵殿地狱鸦处购买                                                                                                                    "
  },
  {
    "name": "气保健",
    "price": "45",
    "props": [
      "无酒精",
      "提神",
      "直饮",
      "甘"
    ],
    "unlock": "地灵殿地狱鸦处购买                                                                                                                            "
  },
  {
    "name": "鬼杀",
    "price": "320",
    "props": [
      "高酒精",
      "可加冰",
      "烧酒",
      "古典",
      "辛"
    ],
    "unlock": "旧地狱鬼商处购买                                                                                                                      "
  },
  {
    "name": "杨枝甘露",
    "price": "50",
    "props": [
      "无酒精",
      "可加冰",
      "水果"
    ],
    "unlock": "命莲寺娜兹玲处购买                                                                                                                        "
  },
  {
    "name": "麒麟",
    "price": "180",
    "props": [
      "中酒精",
      "啤酒",
      "直饮"
    ],
    "unlock": "神灵庙道士处购买                                                                                                                                  "
  },
  {
    "name": "伶人醉",
    "price": "100",
    "props": [
      "低酒精",
      "古典",
      "水果",
      "直饮",
      "甘"
    ],
    "unlock": "辉针城东侧酒窖处采集，太阳花田太阳花精处购买                                                                                          "
  },
  {
    "name": "天地无用",
    "price": "150",
    "props": [
      "高酒精",
      "烧酒"
    ],
    "unlock": "辉针城东侧酒窖处采集，辉针城不良少年处购买                                                                                                        "
  }
]
